{
  "README": "TTI is a tool developed to help the testing of TORCS drivers running in client-server mode. \nIt is under development, currently only available for Linux environments with limited testing done. TTI was created by Clara Caldeira (claramcaldeira@gmail.com) and is licensed under the terms of the GNU General Public License (GPL 2).\n\nThis library is intended for the necessary steps of performance evaluation during a process of developing algorithms for drivers, or for modifying numeric settings in order to optimize their abilities. Because TORCS's command line mode is used, and it was only introduced in v1.3.3, TTI is not compatible with earlier versions of the simulator.\n\n*Important*\n\tA TORCS installation, its source folder and a SCR patch are required, see the competition manual (http://arxiv.org/pdf/1304.1672.pdf) for details.\n\nInstallation:\n\n\tIf you do not have your TORCS installation in the default path (\"/usr/src/torcs/torcs-1.3.4\"),\n\tyou must define the TORCS_BASE value with your custom setting:\n\t$ export TORCS_BASE=/absolute/path/to/torcs-1.3.4\n\t\t(where you unpacked torcs-1.3.4.tar.bz2 or later version)\n\n\tSimilarly, the TORCS libraries are needed, so if you must include your path\n\tin the LD_LIBRARY_PATH (nothing needs to be done if you have the default value \n\t\"/usr/local/lib/torcs/lib\"):\n\t$ export LD_LIBRARY_PATH=$LD_LIBRARY_PATH:/absolute/path/to/torcs/lib\n\t\n\n\tNow your ready, go to TTI's main folder and run:\n\t$ make tti\n\n\tThis should do everything automagically. To test if it works, run:\n\t$ make test\n\t\n\tWhich will run a simple test, after a few seconds, the results of the race \n\tshould be displayed. The test is setup in file test/ttest.cpp, which can be \n\tseen as a simple example of TTI usage (step-by-step instructions included).\n\t\nFor full documentation (requires Doxygen):\n\n\t$ make doc\n\n\nThis program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 2 of the License, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details.\n", 
  "read_at": 1462547649, 
  "description": "", 
  "id": 10288648
}