{
  "read_at": 1462547622, 
  "description": "A multiple-metric framework for video quality assessment over IP networks", 
  "README.md": "Video Tester - Video Quality Assessment Tool\n============================================\n\nVideo Tester is a framework for video quality assessment over a real or simulated IP network. Parameter extraction is performed on the three levels involved in the video processing and transmission ---packet level, bitstream level and picture level--- in order to gather as much information as possible. Therefore, it is suitable for implementing any kind of metric: data metrics, picture metrics, packet-based metrics, bitstream-based metrics or hybrid metrics; with full-reference, reduced-reference or no-reference.\n\nIt is a Linux application programmed in Python with the aim of promoting extensibility, and the election of the GStreamer framework for video processing is due to its broad support in this area. Video Tester covers [EvalVid](http://www.tkn.tu-berlin.de/research/evalvid/) features and adds further improvements in terms of usability, extensibility, codec support, support of transmission methods and reliability in case of losses.\n\nFeatures\n--------\n\n* Codec support: H.263, H.264, MPEG-4 part 2, Theora.\n* Implemented metrics:\n * QoS metrics: latency, delta, jitter, skew, bandwidth, packet loss rate, packet loss distribution.\n * Bitstream metrics: stream eye, reference stream eye, gop size, I-frame loss rate.\n * Video quality metrics: PSNR, SSIM, ITU-T G.1070, MOS (PSNR to MOS mapping from EvalVid), MIV (from EvalVid).\n\nPublications\n------------\n\nIf you use this framework for your research, we would appreciate if you could cite the following reference:\n\n  Ucar, I.; Navarro-Ortiz, J.; Ameigeiras, P.; Lopez-Soler, J.M., **Video Tester -- A multiple-metric framework for video quality assessment over IP networks**, *Broadband Multimedia Systems and Broadcasting (BMSB), 2012 IEEE International Symposium on*, pp.1-5, 27-29 June 2012, DOI: [10.1109/BMSB.2012.6264243](http://dx.doi.org/10.1109/BMSB.2012.6264243), [arXiv:1301.5793](http://arxiv.org/abs/1301.5793) **[cs.MM]**\n\nInstallation\n------------\n\nVideo Tester has the following dependencies:\n\n* Python 2.7.\n* GStreamer (>=1.0) + plugins: base, good, ugly, bad, libav.\n* GStreamer RTSP server (>=1.0).\n* PyGObject (>=3.18.2).\n* Pylibpcap (>=0.6.4).\n* Numpy (>=1.4.1).\n* OpenCV (>=2.1) with Python bindings.\n* Matplotlib (>=1.0.1).\n* WxPython (>=2.8.11) + Matplotlib backend.\n\nIf you are using **Fedora**, first of all, enable the [RPM Fusion](http://rpmfusion.org) repositories. Then, these dependencies can be installed with the following command:\n\n\t$ sudo dnf install gstreamer1 gstreamer1-libav gstreamer1-plugins-base gstreamer1-plugins-good gstreamer1-plugins-ugly gstreamer1-plugins-bad-free gstreamer-plugins-bad-freeworld gstreamer1-rtsp-server python-gobject pylibpcap numpy python2-matplotlib python2-matplotlib-wx wxPython opencv-python\n\nNow, you can download the latest version of Video Tester. Then, follow this steps:\n\n\t$ tar xf VideoTester-x.x.x.tar.gz\n\t$ cd VideoTester-x.x.x\n\t$ sudo python setup.py install\n\nBasic Usage\n-----\n\nVT in server mode:\n\n\t$ VT server\n\nVT in client mode:\n\n\t$ VT client\n\nHow to specify another configuration file (by default, Video Tester looks for a `VT.conf` file in the current working directory):\n\n\t$ VT -c path/to/another.conf [server|client]\n\nVT in client mode with GUI:\n\n\t$ VT client -g\n\nFor more information, check the [documentation](http://enchufa2.github.io/video-tester/).\n", 
  "id": 10322158
}