{
  "read_at": 1462551062, 
  "description": "a wrapper around arxiv api and help user pile pdf from arxiv", 
  "readme.md": "Introduction\n============\n\narXiv-pyler, collects information of  arXiv:Pdf's on the path given by the user, generates a html and pile the pdfs.\n\nThis repo still needs further furnishments.\n\nscripts under py2 work normally while others need further check. I will port it to py3 asap and make it work as smoothly as possible.\n\nSituation\n==========\n\nWhen a user has lots of pdf downloaded from [arXiv.org](arxiv.org), all of whose names are something unrecognizable as '1305.5767.pdf' or 'arXiv:hep-th/0612073v2' etc. \n\nOr even worse, if the user renamed some of the files to its title, eg. '1305.5767.pdf' to 'Categories of Massless D-Branes', it might happens that there are two duplicates '1305.5767.pdf','Categories of Massless D-Branes' on the same path and the user does not realize it.\n\nTo help one manage the arXive:Pdf's easily, I write this stuff.\nIf you have encountered the situation above, then you are encouraged to try this.\n\nHow to use it\n=============\n\nOpen the commandline/terminal and type:\n\n\tpython arxiv_pyler.py path/to/folder [commands]\n\nIf only the html containing info of the Pdf are needed, then one can stop reading here and use arXiv-pyler.\n\nCommands\n========\n\nUp to now, **arXiv-pyler** will soon implement commands to pile files in different ways.\n\n###Pile commands(To be implemented)\n\n- flatten: put all files in the same directory path/to/folder\n- hierarchy: sort all files according to the arXiv category eg. hep-th pdf's are all collected into the hep-th folder.\n\nDependencies\n============\n\nIt runs under Python27.\nFollowing packages are required:\n\n- PyPdf2\n- htmltag(already included)\n\nHow it works\n=============\n\n- gets the `path/to/file`\n- scans the arXiv:Pdf\n- retrieves infomation of the pdf via arXiv api\n- generates the html, where users can open the pdf and look up the info's\n\nTodo\n====\n\n- Porting to Python33\n- Update the GUI version\n- Improve the html_generator.py or implement a simple template engine\n\nOn the 'Py2' folder\n===================\n\nThis folder contains the original version written under Python2.7. The two scripts depends on Pypdf2 and PySide(for the GUI).\nTo make both scripts work, one has to connect to network.\n", 
  "id": 10433892
}