{
  "read_at": 1462551128, 
  "description": "Code for the paper 'Fast Allocation of Gaussian Process Experts'", 
  "README.md": "Fast Allocation of Gaussian Process Experts\n\nAuthor: Trung V. Nguyen (trung.ngvan@gmail.com) and Edwin V. Bonilla\n\nThis is the package MSGP that implements the mixture of sparse Gaussian Process experts model in the paper 'Fast Allocation of Gaussian Process Experts'.\n\n1. Datasets\n-----------------------------\nThe 4 datasets (kin40k, pol, pumadyn32nm, and motorcycle) are provided in the 'data' directory.\n\nFor kin40k, pol, and pumadyn32nm, call load_data() to get the training and testing data used in the paper.\n\nExample: [x,y,xtest,ytest] = load_data('data/kin40k','kin40k');\n\n- The 100k songs dataset is not provided due to its large size but can be obtained at\n http://archive.ics.uci.edu/ml/datasets/YearPredictionMSD\n\nTo get the same training and testing data as in the paper, simply run:\n\nsrc/scripts/song100kscript.m \n\n2. How to run MSGP\n----------------------------\nThe two main functions for using MSGP are src/msgp_train.m and src/msgp_predict.m\nSee src/scripts/demo.m to see the example of using msgp on the motorcycle dataset.\n\n3. Other baselines\n----------------------------\nThe localFITC methods can be run with src/gps_fitc_train.m and src/gps_fitc_predict.m.\n\nSee src/scripts/randpar_batch.m for an example.\n\nThe SoD baseline is in src/scripts/song100k_sod.m\n\nThe GPSVI baseline is in src/gpsvi/batch_gpsvi_big.m (note that it requires the learned hyperparameters of SoD).\n\nOther baselines for the 100k dataset can be found in src/scripts/song100k_baselines.m.\n\n4. Multicore implementation\n----------------------------\nThe main code for multicore is in libs/multicore/msgp. Email me if you have problems using multicore with MSGP.\n\n5. Dependencies\n----------------------------\n- MSGP requires 3 external libraries: GPML [1], GPRApprox_Comparison [2], and SPGP_dist [3]\nin addition to my own library of utility function (myutils)\n- If multicore library is used, it also requires the multicore package\n- If GPSVI is used, it requires the gpsvi implementation by Edwin Bonilla which depends on the \nnetlab and myutil package\nAll libraries are included for your convenience.\n\nReferences:\n----------------------------\n[0] Nguyen, Trung Van and Bonilla, Edwin. Fast Allocation of Gaussian Process Experts. ICML 2014.\n\n[1] Rasmussen, Carl Edward and Nickisch, Hannes. Gaussian processes for machine learning (gpml) toolbox. The\nJournal of Machine Learning Research, 11:3011-3015, 2010\n\n[2] Chalupka, Krzysztof, Williams, Christopher KI, and Murray, Iain. A framework for evaluating approximation\nmethods for gaussian process regression. arXiv preprint arXiv:1205.6326, 2012.\n\n[3] Snelson, Ed and Ghahramani, Zoubin. Sparse gaussian processes using pseudo-inputs, NIPS 2006.\n\n", 
  "id": 10445154
}