{
  "read_at": 1462551157, 
  "description": "Code to calculate correlation functions for two (astrophysical) catalogue datasets", 
  "README.md": "milkywayproject_triggering\n==========================\nCode to calculate correlation functions for two (astrophysical) catalogue datasets\n\n\nWhat is this repository?\n------------------------\n\nThe main file in the repository is calc_corr.py. This file contains functions that calculate the correlation function between two astrophyiscal data catalogues using the Landy-Szalay approximator generalised for heterogeneous datasets ([Landy \\& Szalay, 1993](http://adsabs.harvard.edu/abs/1993ApJ...412...64L); [Bradshaw et al, 2011](http://adsabs.harvard.edu/abs/2011MNRAS.415.2626B)); or the auto-correlation function of one dataset.\n\nThe code was developed for use with the catalogue of bubbles in the interstellar medium generated from the [Milky Way Project] (http://www.milkywayproject.org) (MWP), an initiative by the [Zooniverse](http://www.zooniverse.org) citizen science organisation, and the catalogue of young stellar objects from the [Red MSX Source Survey](http://www.ast.leeds.ac.uk/RMS/) (RMS; [Urquhart et al. 2008](http://arxiv.org/abs/0711.4715)). It therefore assumes that one catalogue has positional information as well as an object size (effective radius), and the other only positional information. The catalogues do however contain many additional fields.\n\nIn addition, the repository contains a sample script demonstrating how to use the calc_corr code, with sample calls, data file generation and plots. Sample catalogues used in Kendrew et al (2012) are included in the cats/ subdirectory. NOTE that these may no longer be the most recent MWP data catalogues, these can be found at http://milkywayproject.org/data/.\n\n\nRequirements and Dependencies\n-----------------------------\n\nThe code is written in Python, and was fully tested in Python 2.6.6. It is compatible with Python 2.7.\n\nThe following Python packages are used:\n\n* numpy\n* scipy\n* scikit-learn\n* matplotlib\n* itertools\n* astropy (v. 0.2.3)\n* time\n* os\n* pdb (debugger, optional)\n\nThe code comes with no guarantees that it will run on your system, though please email me with questions. I will maintain the code on a best-effort basis.\n\n\nWho wrote it?\n-------------\n\nThis code was written by [Sarah Kendrew](http://www.mpia.de/~kendrew), Postdoc in Astronomy, while at the [Max Planck Institute for Astronomy](http://www.mpia.de) in Heidelberg, Germany. For more info, please contact me on sarahaskendrew AT gmail.com\n\nAdditional contributors:\n[Chris Beaumont](https://github.com/ChrisBeaumont), Harvard Center for Astrophysics\n\n\nReferencing\n------------\n\nIf you use this code, please cite:\nKendrew et al, 'The Milky Way Project: A Statistical Study of Massive Star Formation Associated with Infrared Bubbles', ApJ 755(1), 71 (2012) ([ADS](http://adsabs.harvard.edu/abs/2012ApJ...755...71K), [Arxiv](http://arxiv.org/abs/1203.5486))\n\nI'd like to hear about your correlation function work so drop me a line. If you use the code extensively, please consider adding me as a co-author to any resulting publications.\n\nFurther reading\n---------------\nMuch useful background reading can be found in the Kendrew+ 2012 paper.\n\n\nAcknowledgements\n-----------------\n\nThis work was made possible by the participation of more than 35,000 volunteers on the Milky Way Project. Their contributions are acknowledged individually at http://www.milkywayproject.org/authors. The Milky Way Project is supported by The Leverhulme Trust.\n\n\n--- _S. Kendrew, sarahaskendrew AT gmail.com, Aug 2013_\n", 
  "id": 10618448
}