{
  "read_at": 1462551160, 
  "description": "code for multiple Markov renewal process inference in timestamped event data", 
  "README.md": "markovrenewal - code for multiple Markov renewal process inference\n=============\n\nGiven:\n\n1. a set of input data where each data-point has a \"state\" and time,\n2. a generative model for transitions from statetime to statetime (a *Markov renewal process* model),\n\nthis code performs inference to determine the most likely clustering of the \ndata into individual MRP streams, plus noise.\n\nFor detailed description see this paper:\n\n* Stowell & Plumbley (2013),\n  ``Segregating event streams and noise with a Markov renewal process model''\n  accepted in Journal of Machine Learning Research\n  http://arxiv.org/abs/1211.2972\n\n\nSystem requirements\n-------------------\n\n* Python 2.7 or later\n* Cython  (NOT strictly required - the pure python code can be used as-is, but the \"setup.py\" file I provide will attempt to compile it to binary code using Cython. It runs faster that way, so it is strongly recommended.)\n\n* Optional: Python modules numpy, scipy, matplotlib (NOT required for the core code, only for the included experiment scripts)\n* Optional: In order to run the birdsong experiment script, you need various POSIX command-line audio tools such as sox, lame\n* Optional: graphviz, in order to generate graphviz plots of inferred graphs\n\nUsage\n-----\n\nTo install the main code module, run\n\n     python setup.py build_ext\n     sudo python setup.py install\n\nThen to get started using the code, from within a Python session:\n\n     import markovrenewal\n     help(markovrenewal)\n\nYou may find it more helpful to look at usage as embodied in the scripts inside the \"experiments\" folder.\nIn that folder is also a README which tells you how the scripts correspond to the figures in the research journal article cited above.\n\n\nLicence\n-------\n\nThis code was written by Dan Stowell 2012--2013.\n\nThis program is free software: you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation, either version 2 of the License, or\n(at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program.  If not, see <http://www.gnu.org/licenses/>.\n\n\n", 
  "id": 10643853
}