{
  "read_at": 1462551112, 
  "description": "utilities for filesystem exploration and automated builds", 
  "README.md": "pox\n===\nutilities for filesystem exploration and automated builds\n\nAbout Pox\n---------\nPox provides a collection of utilities for navigating and manipulating\nfilesystems. This module is designed to facilitate some of the low level\noperating system interactions that are useful when exploring a filesystem\non a remote host, where queries such as \"what is the root of the filesystem?\",\n\"what is the user's name?\", and \"what login shell is preferred?\" become\nessential in allowing a remote user to function as if they were logged in\nlocally. While pox is in the same vein of both the `os` and `shutil`\nbuiltin modules, the majority of its functionality is unique and compliments\nthese two modules.\n\nPox provides python equivalents of several unix shell commands such as\n\"which\" and \"find\". These commands allow automated discovery of what has\nbeen installed on an operating system, and where the essential tools are\nlocated. This capability is useful not only for exploring remote hosts,\nbut also locally as a helper utility for automated build and installation.\n\nSeveral high-level operations on files and filesystems are also provided.\nExamples of which are: finding the location of an installed python package,\ndetermining if and where the source code resides on the filesystem, and\ndetermining what version the installed package is.\n\nPox also provides utilities to enable the abstraction of commands sent\nto a remote filesystem.  In conjunction with a registry of environment\nvariables and installed utilites, pox enables the user to interact with\na remote filesystem as if they were logged in locally. \n\nPox is part of pathos, a python framework for heterogeneous computing.\nPox is in active development, so any user feedback, bug reports, comments,\nor suggestions are highly appreciated.  A list of known issues is maintained\nat http://trac.mystic.cacr.caltech.edu/project/pathos/query, with a public\nticket list at https://github.com/uqfoundation/pox/issues.\n\n\nMajor Features\n--------------\nPox provides utilities for discovering the user's environment::\n\n* return the user's name, current shell, and path to user's home directory\n* strip duplicate entries from the user's $PATH\n* lookup and expand environment variables from ${VAR} to 'value'\n\nPox also provides utilities for filesystem exploration and manipulation::\n\n* discover the path to a file, exectuable, directory, or symbolic link \n* discover the path to an installed package\n* parse operating system commands for remote shell invocation\n* convert text files to platform-specific formatting\n\n\nCurrent Release\n---------------\nThe latest stable release of pox is available from::\n    http://trac.mystic.cacr.caltech.edu/project/pathos\n\nor::\n    https://github.com/uqfoundation/pox/releases\n\nor also::\n    https://pypi.python.org/pypi/pox\n\nPox is distributed under a 3-clause BSD license.\n\n\nDevelopment Version\n-------------------\nYou can get the latest development version with all the shiny new features at::\n    https://github.com/uqfoundation\n\nFeel free to fork the github mirror of our svn trunk.  If you have a new\ncontribution, please submit a pull request.\n\n\nMore Information\n----------------\nProbably the best way to get started is to look at the tests that are\nprovided within pox. See `pox.tests` for a set of scripts that demonstrate\npox's ability to interact with the operating system.  Pox utilities can\nalso be run directly from an operating system terminal, using the\n`pox_launcher.py` script.  The source code is also generally well\ndocumented, so further questions may be resolved by inspecting the code\nitself.  Please also feel free to submit a ticket on github, or ask a\nquestion on stackoverflow (@Mike McKerns).\n\nPox is an active research tool. There are a growing number of publications\nand presentations that discuss real-world examples and new features of pox\nin greater detail than presented in the user's guide.  If you would like to\nshare how you use pox in your work, please post a link or send an email\n(to mmckerns at caltech dot edu).\n\n\nCitation\n--------\nIf you use pox to do research that leads to publication, we ask that you\nacknowledge use of pox by citing the following in your publication::\n\n    M.M. McKerns, L. Strand, T. Sullivan, A. Fang, M.A.G. Aivazis,\n    \"Building a framework for predictive science\", Proceedings of\n    the 10th Python in Science Conference, 2011;\n    http://arxiv.org/pdf/1202.1056\n\n    Michael McKerns and Michael Aivazis,\n    \"pathos: a framework for heterogeneous computing\", 2010- ;\n    http://trac.mystic.cacr.caltech.edu/project/pathos\n\nPlease see http://trac.mystic.cacr.caltech.edu/project/pathos or\nhttp://arxiv.org/pdf/1202.1056 for further information.\n\n", 
  "id": 11032687
}