{
  "README.markdown": "Python package for automating QUCS simulations\n==============================================\n\n_License GPL_\n\nExample usage of this package in my article:\n[Modeling the frequency response of microwave radiometers with QUCS](http://arxiv.org/abs/1011.6363)\n\nIntroduction\n------------\n\nIt was designed to easily iterate between testing a circuit on the QUCS GUI and running batch simulations,\nso that a system can be debugged interactively at several development stages. \n\nThe _simulate_ module parses the netlist produced interactively by the QUCS GUI and runs user defined regular expressions to create and save to disk the target set of netlists, then runs qucsator on each of them. The _extract_ and _plot_ modules allow then to read the custom QUCS file format, manipulate and plot the results.\n\nUsage\n-----\n\nThe easiest way is to run the demo:\n\n1. copy pythonqucstest_prj in your .qucs folder\n2. open QUCS GUI and run the pythonqucstest schematic in order to create the netlist\n3. check that QUCS created the netlist text file, usually in .qucs/netlist.txt\n4. run python demo.py in the demo folder\n5. simulations for 2 netlists with 2 different amplifiers are automatically run, results are plotted and written as csv files under the csv folder\n6. netlists and raw output files are written in the subfolders netlists and outputs\n\nCiting\n------\n\nIf you use python-qucs for research, please cite my work in your publication:\n[http://arxiv.org/abs/1011.6363](http://arxiv.org/abs/1011.6363)\n\n* [python-qucs homepage](http://andreazonca.com/software/python-qucs)\n* [python-qucs on on Github](https://github.com/zonca/python-qucs)\n* [QUCS](http://qucs.sf.net)\n", 
  "read_at": 1462543034, 
  "description": "QUCS, (http://qucs.sf.net), is a powerful open-source circuit simulator, python-qucs is a Python package that allows to automate the process of preparing input netlists for several simulations, run them, and export the results.", 
  "id": 1110990
}