{
  "read_at": 1462556997, 
  "description": "Command-line bibliography manager", 
  "README.md": "# bib\n\n## Quick Start\n\nCreate a `seed.bib` like the following:\n\n```\n@article{\n    teh.jordan:hdp,\n    doi = {10.1198/016214506000000302},\n    oai = {eprints.ucl.ac.uk.OAI2:13457},\n    pdf = {http://www.stat.berkeley.edu/~jordan/653.pdf},\n    keywords = {bnp}\n}\n\n@inproceedings{\n    teh:hpylm,\n    dblp = {conf/acl/Teh06},\n    doi = {10.3115/1220175.1220299},\n    pdf = {http://www.stats.ox.ac.uk/~teh/research/compling/acl2006.pdf},\n    keywords = {bnp}\n}\n\n@book{\n    mackay:itila,\n    isbn = {9780521642989},\n    url = {http://www.inference.phy.cam.ac.uk/itila/},\n    pdf = {http://www.inference.phy.cam.ac.uk/itprnn/book.pdf}\n}\n\n@inproceedings{\n    Duvenaud2013,\n    dblp = {conf/icml/DuvenaudLGTG13},\n    arxiv = {1302.4922}\n}\n```\n\nNow run:\n\n```\n./bib-update\n```\n\nThis will automatically pull metadata from the internet, download fulltext PDFs where possible, extract plaintext from PDFs, and generate a `library.bib` that looks like:\n\n```\n@article{\n    teh.jordan:hdp,\n    author = {Teh, Yee Whye and Jordan, Michael I and Beal, Matthew J and Blei, David M},\n    doi = {10.1198/016214506000000302},\n    oai = {eprints.ucl.ac.uk.OAI2:13457},\n    pdf = {http://www.stat.berkeley.edu/~jordan/653.pdf},\n    keywords = {bnp},\n    title = {Hierarchical Dirichlet Processes},\n    volume = {101},\n    url = {http://dx.doi.org/10.1198/016214506000000302},\n    number = {476},\n    journal = {Journal of the American Statistical Association},\n    publisher = {Informa UK (American Statistical Association)},\n    year = {2006},\n    month = {Dec},\n    pages = {1566-1581},\n    abstract = {We consider problems involving groups of data where each observation within a group is a draw from a mixture model and where it is desirable to share mixture components between groups. We assume that the number of mixture components is unknown a priori and is to be inferred from the data. In this setting it is natural to consider sets of Dirichlet processes, one for each group, where the well-known clustering property of the Dirichlet process provides a nonparametric prior for the number of mixture components within each group. Given our desire to tie the mixture models in the various groups, we consider a hierarchical model, specifically one in which the base measure for the child Dirichlet processes is itself distributed according to a Dirichlet process. Such a base measure being discrete, the child Dirichlet processes necessarily share atoms. Thus, as desired, the mixture models in the different groups necessarily share mixture components. We discuss representations of hierarchical Dirichlet processes in terms of a stick-breaking process, and a generalization of the Chinese restaurant process that we refer to as the \"Chinese restaurant franchise.\" We present Markov chain Monte Carlo algorithms for posterior inference in hierarchical Dirichlet process mixtures and describe applications to problems in information retrieval and text modeling.},\n    note = {J AM STAT ASSOC , 101 (476) 1566 - 1581. (2006)},\n    subject = {clustering, hierarchical model, Markov chain Monte Carlo, mixture model, nonparametric Bayesian statistics, NONPARAMETRIC PROBLEMS, DENSITY-ESTIMATION, COUNT DATA, MODELS, DISTRIBUTIONS, INFERENCE, INVARIANT, MIXTURES, PRIORS},\n    file = {pdf/a5b9c7c4e84231a622902e68c102ae30c5c9571c.pdf},\n    txt = {txt/a5b9c7c4e84231a622902e68c102ae30c5c9571c.txt}\n}\n\n@inproceedings{\n    teh:hpylm,\n    author = {Teh, Yee Whye},\n    dblp = {http://dblp.uni-trier.de/rec/bibtex/conf/acl/Teh06},\n    doi = {10.3115/1220175.1220299},\n    pdf = {http://www.stats.ox.ac.uk/~teh/research/compling/acl2006.pdf},\n    keywords = {bnp},\n    title = {A Hierarchical Bayesian Language Model Based On Pitman-Yor Processes},\n    booktitle = {ACL},\n    year = {2006},\n    ee = {http://aclweb.org/anthology/P06-1124},\n    crossref = {DBLP:conf/acl/2006},\n    bibsource = {DBLP, http://dblp.uni-trier.de},\n    url = {http://dx.doi.org/10.3115/1220175.1220299},\n    publisher = {Association for Computational Linguistics},\n    pages = {985-992},\n    file = {pdf/6bf6c77b895069239ef7a180aee5332ed7b40c79.pdf},\n    txt = {txt/6bf6c77b895069239ef7a180aee5332ed7b40c79.txt}\n}\n\n@proceedings{\n    DBLP:conf/acl/2006,\n    editor = {Calzolari, Nicoletta and Cardie, Claire and Isabelle, Pierre},\n    title = {ACL 2006, 21st International Conference on Computational Linguistics and 44th Annual Meeting of the Association for Computational Linguistics, Proceedings of the Conference, Sydney, Australia, 17-21 July 2006},\n    booktitle = {ACL},\n    publisher = {The Association for Computer Linguistics},\n    year = {2006},\n    ee = {http://aclweb.org/anthology/P/P06/},\n    bibsource = {DBLP, http://dblp.uni-trier.de},\n    url = {http://aclweb.org/anthology/P/P06/}\n}\n\n@book{\n    mackay:itila,\n    author = {MacKay, David J. C.},\n    isbn = {9780521642989},\n    url = {http://www.inference.phy.cam.ac.uk/itila/},\n    pdf = {http://www.inference.phy.cam.ac.uk/itprnn/book.pdf},\n    worldcat = {http://worldcat.org/isbn/9780521642989},\n    title = {Information Theory, Inference and Learning Algorithms},\n    bibsource = {calibre (0.9.37) [http://calibre-ebook.com]},\n    year = {2003},\n    month = {Sep},\n    abstract = {Information theory and inference, often taught separately, are here united in one entertaining textbook. These topics lie at the heart of many exciting areas of contemporary science and engineering - communication, signal processing, data mining, machine learning, pattern recognition, computational neuroscience, bioinformatics, and cryptography. This textbook introduces theory in tandem with applications. Information theory is taught alongside practical communication systems, such as arithmetic coding for data compression and sparse-graph codes for error-correction. A toolbox of inference techniques, including message-passing algorithms, Monte Carlo methods, and variational approximations, are developed alongside applications of these tools to clustering, convolutional codes, independent component analysis, and neural networks. The final part of the book describes the state of the art in error-correcting codes, including low-density parity-check codes, turbo codes, and digital fountain codes -- the twenty-first century standards for satellite communications, disk drives, and data broadcast. Richly illustrated, filled with worked examples and over 400 exercises, some with detailed solutions, David MacKay's groundbreaking book is ideal for self-learning and for undergraduate or graduate courses. Interludes on crosswords, evolution, and sex provide entertainment along the way. In sum, this is a textbook on information, communication, and coding for a new generation of students, and an unparalleled entry point into these subjects for professionals in areas as diverse as computational biology, financial engineering, and machine learning. \\par \\emph{Review} \\par \"...a valuable reference...enjoyable and highly useful.\" \\\\ American Scientist \\par \"...an impressive book, intended as a class text on the subject of the title but having the character and robustness of a focused encyclopedia. The presentation is finely detailed, well documented, and stocked with artistic flourishes.\" \\\\ Mathematical Reviews \\par \"Essential reading for students of electrical engineering and computer science; also a great heads-up for mathematics students concerning the subtlety of many commonsense questions.\" \\\\ Choice \\par \"An utterly original book that shows the connections between such disparate fields as information theory and coding, inference, and statistical physics.\" \\\\ Dave Forney, Massachusetts Institute of Technology \\par \"This is an extraordinary and important book, generous with insight and rich with detail in statistics, information theory, and probabilistic modeling across a wide swathe of standard, creatively original, and delightfully quirky topics. David MacKay is an uncompromisingly lucid thinker, from whom students, faculty and practitioners all can learn.\" \\\\ Peter Dayan and Zoubin Ghahramani, Gatsby Computational Neuroscience Unit, University College, London \\par \"An instant classic, covering everything from Shannon's fundamental theorems to the postmodern theory of LDPC codes. You'll want two copies of this astonishing book, one for the office and one for the fireside at home.\" \\\\ Bob McEliece, California Institute of Technology \\par \"An excellent textbook in the areas of infomation theory, Bayesian inference and learning alorithms. Undergraduate and post-graduate students will find it extremely useful for gaining insight into these topics.\" \\\\ REDNOVA \\par \"Most of the theories are accompanied by motivations, and explanations with the corresponding examples...the book achieves its goal of being a good textbook on information theory.\" \\\\ ACM SIGACT News \\par \\emph{Book Description} \\par Information theory and inference, often taught separately, are here united in one entertaining textbook. These topics lie at the heart of many exciting areas of contemporary science and engineering - communication, signal processing, data mining, machine learning, pattern recognition, computational neuroscience, bioinformatics, and cryptography. This textbook introduces theory in tandem with applications. Information theory is taught alongside practical communication systems, such as arithmetic coding for data compression and sparse-graph codes for error-correction. A toolbox of inference techniques, including message-passing algorithms, Monte Carlo methods, and variational approximations, are developed alongside applications of these tools to clustering, convolutional codes, independent component analysis, and neural networks. The final part of the book describes the state of the art in error-correcting codes, including low-density parity-check codes, turbo codes, and digital fountain codes -- the twenty-first century standards for satellite communications, disk drives, and data broadcast. Richly illustrated, filled with worked examples and over 400 exercises, some with detailed solutions, David MacKay's groundbreaking book is ideal for self-learning and for undergraduate or graduate courses. Interludes on crosswords, evolution, and sex provide entertainment along the way. In sum, this is a textbook on information, communication, and coding for a new generation of students, and an unparalleled entry point into these subjects for professionals in areas as diverse as computational biology, financial engineering, and machine learning.},\n    publisher = {Cambridge University Press},\n    amazon = {http://amazon.com/dp/0521642981},\n    gbooks = {http://books.google.com/books?id=AKuMj4PN_EMC},\n    subject = {Computers, Computer Science, Computer Vision & Pattern Recognition, Information Theory, Neural Networks, Programming, General, Data Modeling & Design, Science, Physics, Technology & Engineering, Electronics},\n    file = {pdf/201b835c3f3a3626ca07be68cc28cf7d286bf8d5.pdf},\n    txt = {txt/201b835c3f3a3626ca07be68cc28cf7d286bf8d5.txt}\n}\n\n@inproceedings{\n    Duvenaud2013,\n    author = {Duvenaud, David K. and Lloyd, James Robert and Grosse, Roger B. and Tenenbaum, Joshua B. and Ghahramani, Zoubin},\n    dblp = {http://dblp.uni-trier.de/rec/bibtex/conf/icml/DuvenaudLGTG13},\n    arxiv = {http://arxiv.org/abs/1302.4922},\n    title = {Structure Discovery in Nonparametric Regression through Compositional Kernel Search},\n    booktitle = {ICML (3)},\n    year = {2013},\n    pages = {1166-1174},\n    ee = {http://jmlr.org/proceedings/papers/v28/duvenaud13.html},\n    crossref = {DBLP:conf/icml/2013},\n    bibsource = {DBLP, http://dblp.uni-trier.de},\n    oai = {arXiv.org:1302.4922},\n    pdf = {http://arxiv.org/pdf/1302.4922},\n    url = {http://jmlr.org/proceedings/papers/v28/duvenaud13.html},\n    abstract = {Despite its importance, choosing the structural form of the kernel in nonparametric regression remains a black art. We define a space of kernel structures which are built compositionally by adding and multiplying a small number of base kernels. We present a method for searching over this space of structures which mirrors the scientific discovery process. The learned structures can often decompose functions into interpretable components and enable long-range extrapolation on time-series datasets. Our structure search method outperforms many widely used kernels and kernel combination methods on a variety of prediction tasks. \\par Comment: 9 pages, 7 figures, To appear in proceedings of the 2013 International Conference on Machine Learning},\n    month = {May},\n    subject = {Statistics - Machine Learning, Computer Science - Learning, Statistics - Methodology, G.3, I.2.6},\n    file = {pdf/57dbb4b91a2ef6a6b39cf252df860e536d373ad9.pdf},\n    txt = {txt/57dbb4b91a2ef6a6b39cf252df860e536d373ad9.txt}\n}\n\n@proceedings{\n    DBLP:conf/icml/2013,\n    title = {Proceedings of the 30th International Conference on Machine Learning, ICML 2013, Atlanta, GA, USA, 16-21 June 2013},\n    booktitle = {ICML},\n    publisher = {JMLR.org},\n    series = {JMLR Proceedings},\n    volume = {28},\n    year = {2013},\n    ee = {http://jmlr.org/proceedings/papers/v28/},\n    bibsource = {DBLP, http://dblp.uni-trier.de},\n    url = {http://jmlr.org/proceedings/papers/v28/}\n}\n```\n\nas well as a formatted bibliography `library.html` that can be viewed in a web browser:\n\n![](https://raw.githubusercontent.com/davidar/bib/master/screen.png)\n", 
  "id": 11114758
}