{
  "read_at": 1462557003, 
  "description": "C Library for reading/writing OIFITS files", 
  "README.md": "OIFITSlib\n=========\n\nOIFITSlib is a C library for input/output, merging, filtering and\nchecking of optical/IR interferometry datasets in the OIFITS exchange\nformat. A preprint of the draft specification for OIFITS version 2 is\navailable at http://arxiv.org/abs/1510.04556 .\n\nVersion 2.x of OIFITSlib supports the draft OIFITS version 2 standard:\nthe library can read either v1 or v2 OIFITS files, and writes v2\nfiles. The OIFITS standard has been designed such that v2 files are\nbackwards-compatible with reading software intended for v1; hence a\ncapability to write v1 files should not be needed. However, version\n1.x of OIFITSlib is available on GitHub for writing v1 OIFITS files if\nrequired.\n\nThe program `oifits-upgrade` will convert a version 1 OIFITS file to\nversion 2 of the standard. Other command-line utilities\n`oifits-merge`, `oifits-filter` and `oifits-check` are also provided -\nthese provide simple user interfaces to OIFITSlib routines.\n\nA python interface to OIFITSlib is also included (created using\nSWIG). To build this you will need SWIG 1.3 or later.\n\nInstallation\n------------\n\nThe following libraries are required - please install them first:\n\n- CFITSIO (version 3.x recommended):\n  http://heasarc.gsfc.nasa.gov/docs/software/fitsio/fitsio.html\n- GLib (version 2.16 or later required): http://www.gtk.org/\n\nCMake is now used for building - this should be more portable than the\nprevious Makefile. For those not familiar with CMake, instructions can\nbe found at https://cmake.org/runningcmake/ . If you are using a\nUnix-like operating system the following commands should build and\ninstall OIFITSlib:\n\n    cd build\n    cmake ..\n    make\n    sudo make install\n\nOptionally, run `make doc` to generate the API reference\ndocumentation.  Note that the \"oitable\" library can be built without\nGLib. If GLib is not detected or the `pkg-config` utility is not\ninstalled, only liboitable and its demonstration program\n`oitable-demo` will be built.\n\nOIFITSlib has been tested under Linux (Ubuntu and CentOS) and MacOS\nX. The author is interested in hearing about successes or failures\nunder other operating systems.\n\nUsage\n-----\n\nAPI reference documentation for OIFITSlib is automatically generated\nfrom comments in the C code using doxygen (refer to the build\ninstructions above). After building the documentation, point your web\nbrowser to the file\n[doc/oifitslib/html/index.html](doc/oifitslib/html/index.html).\n\nThe command-line utilities `oifits-merge`, `oifits-filter`,\n`oifits-check`, and `oifits-upgrade` will output brief usage\ninformation if invoked with the `--help` argument.\n\nThe `oifits-upgrade` utility converts a valid OIFITS version 1 file to\nOIFITS version 2. The input file must include OI_ARRAY table(s)\ncontaining all of the array elements used to obtain the data. Version\n2 of OIFITS defines several mandatory keywords for the primary\nheader. The values for ORIGIN and INSMODE must be specified on the\n`oifits-upgrade` command line. Values for the other mandatory keywords\nare obtained from the contents of the input file.\n\nThe python interface is documented using python docstrings generated\nfrom SWIG interface files. Use pydoc to view the documentation for the\noifits, oicheck, oimerge and oifilter modules.\n\nHistory\n-------\n\nThe table-level input/output code (see\n[exchange.h](src/oifitslib/exchange.h)) in OIFITSlib is derived from\nthe previously-released \"OIFITS example software in C\", and provides\nthe same Application Programming Interface (API). OIFITSlib provides a\nfile-level API built on top of the table-level code, containing\nfunctions to read and write an entire OIFITS file (see\n[oifile.h](src/oifitslib/oifile.h)).\n\nLicense\n-------\n\nOIFITSlib is free software: you can redistribute it and/or modify it\nunder the terms of the GNU Lesser General Public License as published\nby the Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\n\nOIFITSlib is distributed in the hope that it will be useful, but\nWITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\nLesser General Public License for more details.\n\nYou should have received a copy of the GNU Lesser General Public\nLicense along with OIFITSlib (in the file [lgpl.txt](lgpl.txt)).  If\nnot, see http://www.gnu.org/licenses/ .\n", 
  "id": 11204712
}