{
  "read_at": 1462556994, 
  "description": "Machine Learning on the Milky Way Project DR1", 
  "README.md": "# Brut\n\nThis repository contains the code and manuscript text used in the paper\n\n*The Milky Way Project: Leveraging Citizen Science and Machine Learning to Detect Interstellar Bubbles. Beaumont, Goodman, Kendrew, Williams, Simpson 2014, ApJS, in press ([arXiv link](http://arxiv.org/abs/1406.2692))*\n\nThe `v1` tag represents the state of the code at the time of publication.\n\nData associated with this project is also archived at [The Dataverse](http://thedata.harvard.edu/dvn/dv/brut) (doi:10.7910/DVN/26463)\n\n## High level summary\n\nBrut uses a database of known bubbles (from the [Milky Way Project](http://www.milkywayproject.org/)) and Spitzer images from our galaxy to build an automatic bubble classifier. The classifier is based on the Random Forest algorithm, and uses the [WiseRF](http://docs.wise.io/wiserf_python.html) implementation of this algorithm.\n\nThe main question that Brut attempts to answer is \"does this image contain a bubble?\" The images presented to Brut are 2-color square postage stamps extracted from 8 and 24 micron Spitzer images of the Galactic plane.\n\nThe [picloud](http://www.picloud.com/) platform was used to perform some of the computation in parallel, in the cloud.\n\nIf you want to dig into the details of how the model is built, start with the Makefile in the scripts/ directory.\n\n## Organization\n\n### bubbly/\nContains the python library used to fit Random Forest classification models to Spitzer images\n\n### figures/\nContains code to generate figures in the paper\n\n### notebooks/\nContains several IPython notebooks in various states of organization -- some are polished documents describing aspects of the analysis, others are temporary workbooks.\n\n### paper/\nContains the manuscript text itself\n\n### scripts/\nPython scripts to fit models and generate other derived data products\n\n\n## Reproduction\n\nThis repository is MIT Licensed.\n\nTo reproduce the figures and models generated for the paper, type:\n\n```\npython setup.py develop\ncd bubbly/data && make\ncd ../../paper && make\n```\n\nThough I promise you you'll have to play with dependencies to get this all set up :)\n\n## Dependencies\n\nBrut is built on top of several python libraries, and uses data from the GLIMPSE and MIPSGAL surveys from the Spitzer Space Telescope. You'll need the following libraries\n\n* aplpy\n* astropy\n* h5py\n* IPython\n* matplotlib\n* numpy\n* scipy\n* skimage\n* sklearn\n* picloud\n* WiseRF\n\nIn addition, you need to download the GLIMPSE and MIPSGAL mosaic data. The Makefile inside bubbly/data does this.\n", 
  "id": 11315199
}