{
  "ReadMe": "// Stop -> top + LSP\n  This code produces a weight per event, calling the method:\n \n double Reweight_Stop_to_TopChi0_with_SUSYmodel (std::vector<SUSYGenParticle> genParticles, double thetaMixingTarget, double TOPMASS_REF=172.5);\n\n which goes from the generated reference scenario with symmetric left-right couplings (in the stop -> top chi0 decay) to a different SUSY MC scenario with parameter thetaMixingTarget. It requires a vector of `struct SUSYGenParticle` which basically contains the info on Status = 3 particles at the generation level. \n\nA symmetric left-right coupling scenario implies thetaMixing = pi/4. If the top is produced on-shell, there is a direct relation between its polarization and thetaMixing. Use the method:\n\ndouble GetThetaMixing(double topPol, double m_stop, double m_top, double m_chi0)\n\nto obtain the value of thetaMixingTarget for a given value of the top helicity (left or right, for instance).\n\nUse:\n\ndouble GetTopPolarization(double thetaMixing, double m_stop, double m_top, double m_chi0)\n\nto determine what is the polarization expected for any given value of thetaMixing.\n\n This (together with other utilities) is in the file Stop_TopChi0_Reweighting.C and the script to create a shared library from it is Stop_TopChi0_Reweighting.\n\n An example on how a test program would look like is provided in TopReweight.C and TopReweight.\n/////\n\n// Stop -> b chargino -> b W LSP\n  This code produces a weight per event, calling the method\n \n double Reweight_T2bW (double thetaChi_eff, double thetaW_eff, std::vector<SUSYGenParticle> genParticles);\n\n which goes from a fully flat phase space generation for the subsequent two-body decays: chargino -> W LSP, and W -> f fbar', to a scenario defined by the L/R mixing angles thetaChi_eff and thetaW_eff. The first angle defines the mixing in the stop -> b chargino decay. The thetaW_eff angle defines the mixing in the chargino -> W LSP decay. The convention is the standard one, employed in I. Low, arXiv: 1304.0491. It requires a vector of `struct SUSYGenParticle` which basically contains the info on Status = 3 particles at the generation level. \n\n This method is in T2bW_reweighting.C. A script to build a library with it is T2bW_reweighting.\n\n A test program is provided in T2bW_referenceTest.C and T2bW_referenceTest.\n\n/////\n\n\n Juan Alcaraz, Begona de la Cruz\n\n\n", 
  "read_at": 1462556982, 
  "description": "Tools for polarization reweighting of stop SMS", 
  "id": 11472954
}