{
  "read_at": 1462557013, 
  "description": "NE 2001 code with slight modification", 
  "README.md": "NE2001\n------\n\nNE 2001 code with slight modification to calculate density for x,y,z coordinates in galactocentric cartesian coordiantes.\nNE2001 code described in Cordes & Lazio (2001), arXiv:astro-ph/0207156.\n\nInstallation\n------------\n\n1. Prerequisite: a running version of the g77 compiler\n2. Edit the source code to link to the right data files (this is a bit tedious, keep in mind the FORTRAN line width limitations!):\n    - In neclumpN.NE2001.f, line 77: change variable 'filename' to full path of neclumpN.NE2001.dat\n    - In neclumpN.f, line 77: change variable 'filename' to full path of neclumpN.NE2001.dat\n    - In density.NE2001.f, line 152: set path variable to input.NE2001 directory and set length of variable accordingly in line 149,\n    same in line 277 (263) and 640 (630)\n    - In nelism.NE2001.f, line 58: set path variable to input.NE2001 directory and set length of variable accordingly in line 55\n2. In the src.NE2001 directory: edit the BINDIR variable in the makefile to change the installation directory\n3. run:\n    - > make lib \n    - > make pgm\n    - > make dens\n\nRun NE2001 in python\n--------------------\n\nGet the gmf code package from github.com/me-manu/gmf\nThe ne2001.py contains the functions that interface the fortran code.\n\nSet the NE2001_PATH:\n\nexport NE2001_PATH=\"/path/to/bin/directory/\"\n\nLicense\n-------\n\nThe python implementation of NE2001 is distributed under the modified BSD License.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n- Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n- Redistributions in binary form must reproduce the above copyright\nnotice, this list of conditions and the following disclaimer in the\ndocumentation and/or other materials provided with the distribution.\n- Neither the name of the NE2001 developers  nor the\nnames of its contributors may be used to endorse or promote products\nderived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE NE2001 DEVELOPERS BE LIABLE FOR ANY\nDIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\nON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nThe original code can be found at http://www.astro.cornell.edu/~cordes/NE2001/\n", 
  "id": 11582727
}