{
  "read_at": 1462557018, 
  "description": "vmf90 - Vlasov solver for mean-field systems in Fortran 90", 
  "README.md": "vmf90 : Vlasov solver for mean-field systems in Fortran 90 {#README}\n==========================================================\n\nCopyright (c) 2009-2015 Pierre de Buyl\n\nvmf90 is a software for the numerical resolution of the Vlasov equation for \nmean-field systems, currently the Hamiltonian Mean-Field model and the\nColson-Bonifacio model for the free electron laser. vmf90 is based\non the semi-Lagrangian method with cubic spline interpolation.\n\nvmf90 is developed by Pierre de Buyl and is available under the [GNU General \nPublic License](http://www.gnu.org/licenses/gpl.html).\nThe GNU General Public License is found in the file LICENSE.\nThe homepage for vmf90 is <https://github.com/pdebuyl/vmf90>.\n\nvmf90 is presented in P. de Buyl,\n[The vmf90 program for the numerical resolution of the Vlasov equation for mean-field systems ](http://dx.doi.org/10.1016/j.cpc.2014.03.004),\nComp. Phys. Comm. (2014) **185**, 1822-1827 -\n[[arXiv:1310.0805]](http://arxiv.org/abs/1310.0805).\nCitations to this reference are recommended and appreciated if you use vmf90 to\nobtain scientific results.\n\n\nRequirements\n------------\n\n* A Fortran 95 compiler.\n* The [HDF5](http://www.hdfgroup.org/HDF5/) library.\n\nTo analyze the data, Python example scripts are provided. They require\n\n* [Python](http://python.org/).\n* The [NumPy](http://numpy.scipy.org/) library.\n* The [Matplotlib](http://matplotlib.sourceforge.net/) library.\n* The [h5py](http://www.h5py.org/) library.\n\nUsage\n-----\n\n1. Make sure that the ``h5fc`` Fortran compiler script for HDF5 is properly set\n   up.\n2. Run the make command with the argument ``hmf``:\n\n       make hmf\n\n3. The build directory now contains an executable ``vmf90_hmf``.\n4. A ``HMF_in`` configuration file is required to set up the\n   simulation. Examples are found in the ``scripts`` directory. To copy one of\n   these examples, type:\n\n       cd build\n       cp ../scripts/HMF_in.resonances ./HMF_in\n\n7. A run is performed by executing ``vmf90_hmf``:\n\n       ./vmf90_hmf\n\n8. After a run is completed, the data is found in the file ``hmf.h5``. Examples\n   scripts on how to read these files in Python are found in the ``scripts``\n   directory. To display the total energy and the interaction and kinetic parts,\n   issue the following command (NumPy, h5py and Matplotlib are required):\n\n       ../scripts/show_vmf90.py hmf.h5 plot energy en_int en_kin\n\nTo use the FEL program, the instructions are similar but \"make hmf\" becomes\n\"make fel\". Also, the program for the FEL is vmf90_fel and the parameters file\nfor the FEL program is FEL_in.\n\nDocumentation\n-------------\n\nA doxygen-generated documentation is readily available by executing:\n\n    make doc\n\nfrom the main directory of vmf90. The index of the documentation is found at\n``doc/html/index.html``.\n\nAppropriate references to the algorithms are given in the documentation, as well\nas a full API documentation for the code and the Fortran modules.\n\n", 
  "id": 11628857
}