{
  "read_at": 1462559045, 
  "description": "Platform to accelerate science 2.0. Providing a reddit like interface to arXiv and easily sharing notes. ", 
  "README.md": "SciencePlus\n===========\n\nA Platform to accelerate science 2.0. Providing a stack exchange interface to arXiv, and easily sharing science notes.\n\nScience 2.0 has advantages such as faster sharing ideas, experience and mistakes, making '''open collaboration creditable''', giving funding to the ones with the best ideas ideas (and not just submit applications).\n\nThis project aims to tackle the problem of everyday scientists not having time to '''manage open notebooks''' or blogs, nor promoting them in todays information overflow.\n\nThis project will implement a way to take out what scientific content is relevant to you through a reddit interface, focused on the articles '''openly published articles''' on arXiv.com. \n\n###Summary\nThe posts would automatically be structured with a **reputation system** like reddit, promoting interaction. \n\nScientists could follow interesting people in their field, and automatically get suggestions on which other scientists are writing about the same things. Promoting sparking ideas and start of new interconnected collaborations. \n\nThe profiles of a scientist would show how helpful their work is - what other scientists consider of their ideas and work, and which ideas that came from them originally, and opinions on their accepted publications (which are still a core part in Open Science).  Only using number of quotations is slow and does not tell the whole story.\n\n###Weekend goals\n* Providing an interface for arXiv.com similar to reddit. \n* Implementing an existing open source platform for this, with reputation system, and commenting (http://www.coordino.com/])\n* Outreach to scientists to make them pick it up\n\n###Resources\nThe former description for this project is a bit more visionary: http://antonosika.quora.com/\n\n\n###How contribute?\nWith:\nBeautiful Web Development , Database knowledge, Smart Scientist, Brainstorming, Search Engine Recommendation Algorithms, Open Source Implementations, API skills.\n", 
  "id": 11849844
}