{
  "read_at": 1462559171, 
  "description": "General Complex Polynomial Root Solver and Its Further Optimization for Binary Microlenses.  Authors: Jan Skowron and Andrew Gould", 
  "README.md": "General Complex Polynomial Root Solver and Its Further Optimization for Binary Microlenses\n==========================================================================================\n\nPaper\n-----\n\nJ. Skowron & A. Gould (2012)\n\nFull text: [ADS link](http://adsabs.harvard.edu/abs/2012arXiv1203.1034S) |\n[arxiv.org link](http://arxiv.org/abs/1203.1034)\n\nAbstract\n--------\n\nWe present a new algorithm to solve polynomial equations, and publish its code,\nwhich is 1.6-3 times faster than the `ZROOTS` subroutine that is commercially\navailable from *Numerical Recipes*, depending on application.  The largest\nimprovement, when compared to naive solvers, comes from a fail-safe procedure\nthat permits us to skip the majority of the calculations in the great majority\nof cases, without risking catastrophic failure in the few cases that these are\nactually required.  Second, we identify a discriminant that enables a rational\nchoice between Laguerre's Method and Newton's Method (or a new intermediate\nmethod) on a case-by-case basis.  We briefly review the history of root solving\nand demonstrate that \"Newton's Method\" was discovered neither by Newton (1671)\nnor by Raphson (1690), but only by Simpson (1740).  Some of the arguments\nleading to this conclusion were first given by the British historian of science\nNick Kollerstrom in 1992, but these do not appear to have penetrated the\nastronomical community.  Finally, we argue that *Numerical Recipes* should\nvoluntarily surrender its copyright protection for non-profit applications,\ndespite the fact that, in this particular case, such protection was the major\nstimulant for developing our improved algorithm.\n\nSouce code\n----------\n\nClick here to download the whole package:\n[cmplx_roots_sg.tar.gz](https://github.com/giordano/cmplx-roots-sg/archive/master.tar.gz).\n\nBoth code versions serve the same purpose, with the major difference being a\nprograming language.  Short reference of the subroutines is given at the\nbegining of the files and in the Appendix C of the Paper.  Purpose of each\nsubprogram and all its arguments are described at the begining of every\nsubroutine.  General ideas, limitations and comments are provided in the Paper.\n\nThe authors release the source codes associated with the Paper under terms of\nthe [GNU Lesser General Public License](http://www.gnu.org/licenses/lgpl.html)\nversion 2 or any later version, or under the\n[Apache License, Version 2.0](http://www.apache.org/licenses/LICENSE-2.0) as\nwell as under a \"customary scientific license\", which implies that if this code\nwas important in the scientific process or for the results of your scientific\nwork, we ask for the appropriate citation of the Paper\n([Skowron & Gould 2012](http://arxiv.org/abs/1203.1034)).\n", 
  "id": 11877575
}