{
  "read_at": 1462826702, 
  "description": null, 
  "README.md": "# StatFail: Confusing Descriptive and Inferential Statistics in Experimental Design \n\n# Read the paper\n\nSassenhagen, Jona and Phillip M. Alday (under review): A common misapplication of statistical inference: nuisance control with null-hypothesis significance tests. Brain & Language. [arXiv preprint](http://arxiv.org/abs/1602.04565). [Repository](https://github.com/jona-sassenhagen/statfail/). \n\nThe title will probably change in the near feature, as some of our initial reviewer feedback has been some very helpful terminological suggestions.\n\n# Simulation in R\n\n## Run it fast on your local machine\nRun the following command in R:\n\n```\n# make sure shiny is installed\nif(!require(shiny)){\n  install.packages(\"shiny\")\n  library(shiny)\n}\nrunGitHub(\"statfail\",username=\"jona-sassenhagen\",ref=\"master\",subdir=\"simulation\")\n```\n\n## Try it out slow on shinyapps.io\nA Shiny app that allows you to more closely individual simulated experiments for a given set of simulation parameters is available in the GitHub repository and on [shinyapps.io](https://palday.shinyapps.io/statfail/).\nIf you're going to do lots of computations, please run the app locally so that server time remains available for others.\n\n## See a static summary across different parameter levels\n\nA more comprehensive aggregrate, static simulation showing the effects across many settings of the simulation parameters simultaneously is available on [RPubs](http://rpubs.com/palday/statfail).\n\n## Simulation in Python\n\nAnother Python-based simulation will soon be made available on Binder, but the preliminary code is already in the GitHub repository.\n\n## Copyright\nCopyright (c) 2013-2015 by Jona Sassenhagen and Phillip Alday.\n\nUnless otherwise specified, the files contained in this work are licensed under the Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License. To view a copy of this license, visit http://creativecommons.org/licenses/by-nc-nd/3.0/ or send a letter to Creative Commons, 444 Castro Street, Suite 900, Mountain View, California, 94041, USA. \n\n", 
  "id": 12005538
}