{
  "read_at": 1462559377, 
  "description": "Analysis pipeline for assesing biasing factors in Illumina RNA-seq protocols through realistic simulations", 
  "README.md": "# Assessing biasing factors in Illumina RNA-seq protocols through realistic simulations\n\n![header](https://raw.github.com/sbotond/paper-rlsim/master/Info/head.png)\n\n## Reference\n\nThis repository contains the analysis pipeline, the description of workflow and the results presented in the manuscript:\n\n- Botond Sipos, Greg Slodkowicz, Tim Massingham, Nick Goldman (2013) *Realistic simulations reveal extensive sample-specificity of RNA-seq biases* *arXiv*:[1308.3172](http://bit.ly/rlsax) \n\n## Introduction\n\nThe [rlsim](http://bit.ly/rlsim-git) package is a collection of tools aiming to integrate in a common simulation framework the documented biases present in the data generated by standard Illumina [RNA-seq](http://bit.ly/rna-seq) protocols due to individual experimental steps such as hexamer priming ([Hansen et al.; 2010](http://bit.ly/hansen10)), PCR amplification ([Benjamini and Speed; 2011](http://bit.ly/benajmini11)) and size selection ([Lee et al.; 2010](http://bit.ly/lee2010)). \nThe [rlsim](http://bit.ly/rlsim-git) package provides an implicit simulation model inspired by the library construction protocols (implemented in the `rlsim` tool) and also simple approaches for estimating the parameters that can be recovered from standard RNA-seq data (implemented in the `effest` tool) in order to replicate the properties of individual datasets. The details of the simulation and estimation frameworks are described in the [rlsim package documentation](http://bit.ly/rlsim-doc).\n\nThe analyses implemented in the pipelines have the following goals:\n\n- To survey the magnitude of hexamer priming and PCR amplification biases in various paired-end RNA-seq [datasets](https://github.com/sbotond/paper-rlsim#datasets) publicly available through [ENA](http://www.ebi.ac.uk/ena), generated by the standard Illumina protocol and its dUTP-based strand-specific modification ([Levin et al.; 2010](http://bit.ly/levin10)).\n- To quantify whether the ensemble of knowledge incorporated in the simulation pipeline - parameters estimated from the individual [datasets](https://github.com/sbotond/paper-rlsim#datasets), priming affinities based on a physical model, species-specific information on poly(A) tail length - makes the simulated datasets more similar to the real ones as measured through different summary statistics, hence the \"realism\" of the `rlsim` estimation/simulation framework.\n- To study the correlation of the same (or similar) summary statistics between library construction technical replicates in order to establish an expectation regarding the magnitude of correlation potentially achievable between real and simulated datasets.\n\n### Cloning the pipeline repository\n\nThe pipeline tracks the [rlsim](http://bit.ly/rlsim-git) and [simNGS](http://bit.ly/simngs-git) packages as submodules; hence it is practical to use the `--recursive` flag when cloning the GitHub repository:\n\n```\ngit clone --recursive https://github.com/sbotond/paper-rlsim.git\n```\n\n### Downloading the estimated expression levels\n\nDue to the large size of the Fasta files, the canonical transcriptomes with the corrected expression levels estimated from the [datasets below](https://github.com/sbotond/paper-rlsim#datasets) are available from a separate repository at [http://github.com/sbotond/rlsim-params](http://bit.ly/rlsim-pa). The repository also contains the raw parameter JSON files in order to help running modified simulations.\n\n# The bias analysis pipeline\n\n## Analysis overview\n\nThe main goal of the bias analysis pipeline is to quantify the magnitude of biases across different datasets and the ability of the `rlsim` estimation/simulation framework to reproduce them (hence the degree of \"realism\" of the simulations). The pipeline relies on comparison of real datasets to simulated datasets obtained under two different simulation settings:\n\n- Datasets simulated  under the **\"full\" model**, which use the corrected expression levels and GC-dependent PCR efficiencies estimated by the `effest` tool in conjunction with a fragmentation method using an approach inspired by a physical model of oligonucleotide binding in order to simulate sequence biases around the start and end of the fragments (`after_prim_double`).\n\n- Datasets simulated under the **\"flat\" model**, which use uncorrected expression levels calculated by `effest` and a fixed PCR amplification efficiency (0.87 - the mean efficiency assumed by `effest`) in conjunction with a fragmentation method assuming uniform priming affinities (`after_noprim_double`).\n\nThe flat model can be considered as a submodel of the the full one, making fewer assumptions about the process generating the data. Both simulations use the insert size distribution estimated from the data and sample the same amount of fragments. The details of the full and flat simulation settings are described below.\n\n## Comparing datasets through summary statistics\n\nThe similarity between the real and simulated datasets is assessed by calculating Spearman rank correlations between various features of the datasets, summarising their properties on different levels:\n\n- Relative expression levels (per transcript fragment counts normalised by the number of total fragments) - calculated by the [cov_cmp](https://github.com/sbotond/rlsim#cov_cmp) tool from the `rlsim` package\n- The GC content distribution of the mapped fragments - calculated by the [pb_plot](https://github.com/sbotond/rlsim#pb_plot) tool from the `rlsim` package.\n- Sequence biases as summarised by the base counts around the start and end of mapped fragments (with a window size of 10) capturing sequence bias - calculated by `pb_plot`. The rank correlations are calculated for count vectors for the four bases around start/end individually and averaged to obtain a single value.\n- The fragment coverage vectors of individual transcripts - calculated by `cov_cmp`\n\nThe correlations and statistics calculated for individual datasets and pairs of datasets are stored as pickle files. The pipeline provides additional scripts to calculate and summarise the changes in correlation due to the additional simulation factors used in the full model:\n\n- [meta_cov_cmp](https://github.com/sbotond/paper-rlsim#meta_cov_cmp) calculates the shift in correlation for relative expression levels and per-transcript fragment coverage vectors.\n- [meta_pb_cmp](https://github.com/sbotond/paper-rlsim#meta_pb_cmp) calculates shift in correlation for GC content distributions and sequence biases around fragment start/end.\n\nBy assessing the direction of the shift in the correlations calculated for the features above one can asses whether including the additional factors (GC-dependent efficiencies, priming affinities, etc.) improve the \"realism\" of the simulation, while the magnitude of the shift quantifies the potential impact of the biasing factors on downstream applications.\n\n### Read mapping and parameter estimation\n\n- The datasets defined by their accession numbers (AN) in the makefiles under `data.mk` are automatically downloaded from ENA.\n- Reads are mapped to the [Ensembl](http://www.ensembl.org/) v69 _canonical transcriptomes_ fetched through the Perl API (along with the list of \"single isoform\" transcripts) using `BWA` (paired-end mode, default parameters). The same reference transcriptome and mapping strategy is used to map the simulated datasets.\n- Simulation parameters are estimated using `effest` using an expression multiplier (`-e`) of 10000.0 (see the [rlsim documentation](http://bit.ly/rlsim-doc) for more information) and the default assumed mean efficiency (0.87). The estimation of GC-dependent efficiencies is restricted to single isoform transcripts (through the `-i` flag).\n- Note that the estimation and simulation steps ignore the presence of isoforms by mapping to the canonical transcriptome. This is likely to decrease the correlation between real and simulated datasets, however it should not affect significantly the comparison of the full and flat models as they both use the same mapping strategy.\n\n### *Flat* simulations\n\nThe flat simulations do not attempt to simulate sequence-specific biases and they generate data under a simple scheme of random fragmentation, amplification under a fixed amplification efficiency and size selection:\n  \n- The number of simulated fragments is equal to the number of properly mapped read pairs from the real dataset.\n- The fragmentation approach used (`after_noprim_double`) assumes uniform \"priming affinities\".\n- A fixed PCR amplification efficiency of 0.87 is used when simulating PCR, independent of the fragment GC content.\n- Size selection is simulated according to the empirical fragment size distribution estimated from the data.\n- The length of the simulated poly(A) tails are set to zero.\n\n\n### *Full* simulations\n\nThe full simulations attempt to use the maximum amount of knowledge derived from the dataset and literature, aiming to replicate the biases. Hence, in addition to the parameters used by the flat simulations, they also include the following factors:\n\n- The fragmentation process (`after_prim_double`, see the [rlsim documentation](http://bit.ly/rlsim-doc) for more details) uses sequence-specific \"priming affinities\" based on a nearest neighbor model of oligonucleotide binding in order to simulate sequence specific biases near the start and end of the simulated fragments.\n- Simulation of PCR amplification biases uses the \"empirical\" GC-dependent efficiencies estimated by the `effest` tool (with the minimum efficiency set to 0.05).\n- The simulated poly(A) tail distributions in the *full* simulations are set on a per-species basis based on relevant publications. We assume that the distributions of the tail lengths (specified with the syntax described in the [rlsim documentation](http://bit.ly/rlsim-doc)) follows a geometric distribution with a mean equal to the half of the maximum tail length observed in the respective species and truncated at the maximum value:\n    * *Homo sapiens*:  `1.0:g:(125,1,0,250)` ([Kuhn et al. 2009](http://bit.ly/ZBXWeJ))\n    * *Mus musculus*: `1.0:g:(38,1,0,77)` ([Clegg and Piko 1983](http://bit.ly/Zx1YbB))\n    * *Drosophila melanogaster*: `1.0:g:(65,1,0,130)` ([Benoit et al. 2005](http://bit.ly/Zx1zpA))\n    * *Saccharomyces cerevisiae*: `1.0:g:(40,1,0,80)` ([Brown and Sachs 1998](http://bit.ly/16eDFnV))\n\n### Simulating Illumina sequencing\n\nSimulation of paired-end Illumina sequencing of the fragments generated by `rlsim` was performed using the [simNGS](http://bit.ly/simngs-git) package (version 1.6). Simulations were parametrised by the runfile [s_3_4x](https://raw.github.com/timmassingham/simNGS/master/data/s_3_4x.runfile) shipped in the simNGS GitHub repository, trained on intensity data from a paired-end run with 101 cycles. The simulated read length was equal to the read length of the respective real datasets.\n\n## Datasets\n\n*Homo sapiens*\n\n|                         Accession                        |              Info URL            | Read length | PCR cycles| Source                         |\n|:--------------------------------------------------------:|:--------------------------------:|:-----------:|:----------|:-------------------------------|\n|[SRR065496](http://www.ebi.ac.uk/ena/data/view/SRR065496) | [[details]](http://j.mp/10gF04D) |      75     | not reported | human liver carcinoma (HepG2)  |\n|[SRR521457](http://www.ebi.ac.uk/ena/data/view/SRR521457) | [[details]](http://j.mp/10gF04D) |      75     | not reported | K562 cell line                 |\n|[SRR521448](http://www.ebi.ac.uk/ena/data/view/SRR521448) | [[details]](http://j.mp/10gF04D) |      75     | not reported | GM12878 cell line              |\n|[ERR030885](http://www.ebi.ac.uk/ena/data/view/ERR030885) | [[details]](http://j.mp/10gF8kP) |      50     |     15    | Illumina BodyMap: kidney       |\n|[ERR030874](http://www.ebi.ac.uk/ena/data/view/ERR030874) | [[details]](http://j.mp/10gF8kP) |      50     |     15    | Illumina BodyMap: ovary        |\n\n*Mus musculus*\n\n|                         Accession                        |              Info URL            | Read length | PCR cycles| Source                         |\n|:--------------------------------------------------------:|:--------------------------------:|:-----------:|:----------|:-------------------------------|\n|[SRR040000](http://www.ebi.ac.uk/ena/data/view/SRR040000) | [[details]](http://j.mp/10gFhoe) |      76     |     16    | embryonic stem cells           |\n|[SRR530635](http://www.ebi.ac.uk/ena/data/view/SRR530635) | [[details]](http://j.mp/109cLZI) |101 stranded | not reported | leukemia cell line (K562 analog), dUTP-based stranded protocol|\n|[SRR530634](http://www.ebi.ac.uk/ena/data/view/SRR530634) | [[details]](http://j.mp/109cLZI) |101 stranded | not reported | leukemia cell line (K562 analog), dUTP-based stranded protocol|\n|[ERR120702](http://www.ebi.ac.uk/ena/data/view/ERR120702) | [[details]](http://j.mp/10gFpUJ) |      72     | not reported | liver                          |\n|[SRR549333](http://www.ebi.ac.uk/ena/data/view/SRR549333) | [[details]](http://j.mp/10gFoAj) | 99 stranded | not reported | mouse megakaryocyte erythroid progenitor cells with lineages CD16/32 and CD34, dUTP-based stranded protocol|\n|[SRR549337](http://www.ebi.ac.uk/ena/data/view/SRR549337) | [[details]](http://j.mp/10gFoAj) | 99 stranded | not reported | mouse megakaryocyte erythroid progenitor cells with lineages CD16/32 and CD34, dUTP-based stranded protocol |\n|[SRR496440](http://www.ebi.ac.uk/ena/data/view/SRR496440) | [[details]](http://j.mp/10gFyaG) |     100     | not reported | multipotential cell line that can be converted by 5-azacytidine into three mesodermal stem cell lineages |\n\n*Drosophila melanogaster*\n\n|                         Accession                        |              Info URL            | Read length | PCR cycles| Source                         |\n|:--------------------------------------------------------:|:--------------------------------:|:-----------:|:----------|:-------------------------------|\n|[SRR042423](http://www.ebi.ac.uk/ena/data/view/SRR042423) | [[details]](http://j.mp/10gFGad) |      75     | not reported | 30 third-instar wandering larvae|\n|[SRR059066](http://www.ebi.ac.uk/ena/data/view/SRR059066) | [[details]](http://j.mp/10gFGad) |      75     | not reported | 30 third-instar wandering larvae|\n|[SRR034309](http://www.ebi.ac.uk/ena/data/view/SRR034309) | [[details]](http://j.mp/10gFQOU) |      76     | not reported | mixed stage embryos            |\n|[SRR031717](http://www.ebi.ac.uk/ena/data/view/SRR031717) | [[details]](http://j.mp/109dj1L) |      37     | not reported | S2-DRSC cell line              |\n|[SRR015074](http://www.ebi.ac.uk/ena/data/view/SRR015074) | [[details]](http://j.mp/10gFUOP) |      50     | not reported | CME\\_W1\\_Cl.8+ cell line       |\n\n## Running the bias analysis pipeline\n\nThe bias analysis pipeline can be launched on an LSF cluster by running the `Run_bias_analysis.sh` script.\nThe script will submit one job per dataset.  Job parameters can be tuned by editing the script. The analyses\ncan be run locally as well by editing the `run` function in the launch script. The runlogs are stored under the `runlogs` directory.\n\nAfter all jobs finish running, a global report can be generated by issuing:\n\n```\nmake gr\n```\n## Interpreting the results\n\nThe global report summarising the correlations of different features between data simulated under the *full* and *flat* conditions and real datasets is at `reports/global_bias_report.pdf`\n\nThe per-dataset output of the bias analysis pipeline (with the exception of the transcriptome fasta files augmented with the estimated expression levels) are available at [http://www.ebi.ac.uk/goldman-srv/paper-rlsim/Bias](http://www.ebi.ac.uk/goldman-srv/paper-rlsim/Bias) and they are also checked in the repository under the `Bias/AN/log` directory, where `AN` is the dataset accession number. They can be regenerated by running the pipeline as instructed above.\n\nThe log directories (e.g. [Bias/SRR549337/log](https://github.com/sbotond/paper-rlsim/tree/master/Bias/SRR549337/log)) store the following output files important for interpreting the results:\n\n- `meta_cov_cmp.pdf` - report on the shift of correlations and p-values for the per-transcript fragment coverage vectors (full/flat model vs. real data)\n- `meta_cov_cmp.txt` - text report on the shift in the correlation of relative expression levels.\n- `meta_pb_sim_flat.log` - text report on the correlation of GC content distribution and sequence bias between real and *flat* simulated data\n- `meta_pb_sim.log` - text report on the correlation of GC content distribution and sequence bias between real and *full* simulated data\n- `effest_report.pdf` - effest PDF report\n- `cov_cmp_flat.pdf` - report on the comparison of relative expression levels and transcript coverage vectors between the real and *flat* simulated dataset. Contains a scatter-plot of relative expression levels, the histogram of rank correlations and corresponding p-values for per-transcript fragment coverage vectors. Also contains a plot of the simulated and real coverage vectors for 30 transcripts with the lowest p-values.\n- `cov_cmp_report_flat.txt` - text report on the correlation of relative expression levels and coverage vectors between the real and the *flat* simulated dataset.\n- `cov_cmp.pdf` - report on the comparison of relative expression levels and transcript coverage vectors between the real and *full* simulated dataset\n- `cov_cmp_report.txt` - text report on the correlation of relative expression levels and coverage vectors between the real and the *full* simulated dataset.\n- `pb_plot_aln.pdf` - sequence bias and GC content distribution plots for the real data\n- `pb_plot_sim_flat.pdf` - sequence bias and GC content distribution plots for the *flat* simulated data\n- `pb_plot_sim.pdf` - sequence bias and GC content distribution plots for the *full* simulated data\n- `re_effest_report.pdf` - PDF report of the effest run on the *full* simulated data\n- `rlsim_report_flat.json.pdf` - PDF report file for *flat* simulation\n- `rlsim_report.json.pdf` -  PDF report file for the *full* simulation.\n\nThe log directories also contain several intermediary files:\n\n- `effest_log.txt` - effest log file\n- `effest_raw_params.json` - \"raw parameters\" estimated by effest\n- `effest_suggestions.txt` - command line parameters suggested by effest\n- `rlsim_report_flat.json` - JSON report file for the *flat* simulation\n- `rlsim_report.json` - JSON report file for the *full* simulation\n- `*.pk` - pickle files storing the results of various analyses\n- `flat_re_SRR549337_expr.fas` - uncorrected relative expression levels re-estimated from the full simulated data (**not included in repo**)\n- `flat_SRR549337_expr.fas` - uncorrected relative expression levels estimated from the real data (**not included in repo**)\n- `re_SRR549337_expr.fas` - uncorrected relative expression levels estimated from the full simulated data (**not included in repo**)\n- `SRR549337_expr.fas` - relative expression levels estimated from the real data (available from a [separate repository](http://bit.ly/rlsim-pa))\n- files prefixed with `re_` - output of effest parameter re-estimation from *full* simulated data\n\n\n\n# The replicate analysis pipeline\n\nAnalysis overview\n-----------------\nIn addition to the bias analysis described above, we performed analysis of correlation of summary statistics between pairs of technical replicates.\n\nIn the absence of a paired-end dataset with technical replicates, we took advantage of the single-ended datasets from [Bullard et al.](http://bit.ly/bullard10) (2010) where library preparation, lane and flow cell effects have been analysed using Universal Human Reference (UHR) and Ambion's human brain reference RNA.  The RNA used was commercial-grade and the sequencing was performed in-house by Illumina; the differences between replicates obtained in less ideal conditions are likely to be larger and so we believe such analysis provides an upper bound on the correlation between any two datasets.\n\nThe calculated summary statistics are conceptually the same but there are small differences due the fact that sequencing data have unpaired-end reads:\n\n- Relative expression levels are calculated in the same way as in the bias analysis\n- GC content is calculated for reads rather than fragments\n- Sequence biases are calculated for beginnings and ends of reads rather than fragments\n\nDatasets\n--------\n\n*Homo sapiens*\n\n|                         Accession                        |              Info URL            | Read length | PCR cycles| Source                         |\n|:--------------------------------------------------------:|:--------------------------------:|:-----------:|:----------|:-------------------------------|\n|[SRR037466](http://www.ebi.ac.uk/ena/data/view/SRR037466) | [[details]](http://j.mp/19XV4Dl) |      35     |     -     | UHR RNA                        |\n|[SRR037467](http://www.ebi.ac.uk/ena/data/view/SRR037466) | [[details]](http://j.mp/19XV4Dl) |      35     |     -     | UHR RNA                        |\n|[SRR037468](http://www.ebi.ac.uk/ena/data/view/SRR037466) | [[details]](http://j.mp/19XV4Dl) |      35     |     -     | UHR RNA                        |\n|[SRR037469](http://www.ebi.ac.uk/ena/data/view/SRR037466) | [[details]](http://j.mp/19XV4Dl) |      35     |     -     | UHR RNA                        |\n|[SRR037473](http://www.ebi.ac.uk/ena/data/view/SRR037466) | [[details]](http://j.mp/19XV4Dl) |      35     |     -     | UHR RNA                        |\n|[SRR037474](http://www.ebi.ac.uk/ena/data/view/SRR037466) | [[details]](http://j.mp/19XV4Dl) |      35     |     -     | UHR RNA                        |\n|[SRR037475](http://www.ebi.ac.uk/ena/data/view/SRR037466) | [[details]](http://j.mp/19XV4Dl) |      35     |     -     | UHR RNA                        |\n|[SRR037476](http://www.ebi.ac.uk/ena/data/view/SRR037466) | [[details]](http://j.mp/19XV4Dl) |      35     |     -     | UHR RNA                        |\n\nRunning the replicate analysis pipeline\n---------------------------------------\nThe replicate analysis can be launched in a manner similar to the bias analysis, by running `Run_replicate_analysis.sh` and also uses the LSF queuing system for job submission.\n\nInterpreting the results\n------------------------\nThe principal results of the analysis have been added to the global report file in the form of baselines representing the average correlation of each summary statistic between pairs of technical replicates.\n\nThe intermediate results of the analysis are stored in the `Replicate` subdirectory.  Results for each pair or replicates are stored in a directory called `AN1-AN2` where AN1 and AN2 are accession numbers for the two datasets.  The `log` directories contain the following output files:\n\n- `cov_cmp.pdf` - the same as cov_cmp_sim.pdf/cov_cmp_flat.pdf but containing correlations between the replicates\n- `cov_cmp_report.txt` - text report containing the correlation of relative expression levels between the replicates\n- `meta_pb.log` - text report containing the correlation of GC content distribution and sequence bias between the replicates\n- `pb_plot_ANX.pdf` - sequence bias and GC content distribution for AN1/AN2\n- `*.pk` - pickle files with results of various analyses\n\n# Acknowledgements\n\nThanks for the useful discussions and suggestions to (in no particular order):\nKevin Gori, Christophe Dessimoz, Nick Williams, Ernest Turro, John Marioni, Nuno Fonseca, Par Engstrom, Paul Bertone.\n\n# Files and dependencies\n\n## Dependencies\n\nYou will need the following software installed in order to compile and run the pipeline:\n\n- The [Ensembl](http://www.ensembl.org/) Perl API [version 69](http://www.ensembl.org/info/docs/api/api_cvs.html).\n- The dependencies for building the [rlsim package](https://github.com/sbotond/rlsim#dependencies)\n- The dependecies for building the [simNGS package](https://github.com/timmassingham/simNGS).\n- [BWA](http://bio-bwa.sourceforge.net) >= 0.7.4-r385\n- [samtools](http://samtools.sourceforge.net) >= 0.1.19-44428cd\n\n## Directories\n\n- *Bias/*       - files produced by the bias analysis pipeline\n- *data.mk/*    - dataset-specific makefiles\n- *Info/*       - miscellaneous info\n- *lib/*        - Python classes used by the analysis tools\n- *ref_cache/*  - Reference transcriptomes indexed by BWA\n- *Replicate/*  - files produced by the replicate analysis pipeline\n- *reports/*    - PDF reports\n- *runlogs/*    - directory to store runglogs\n- *scripts/*    - analysis scripts\n- *simulators/* - directory containing the simulator (rlsim, simNGS) submodules\n\n## Scripts quick reference\n\n### ensembl_versions\n\nPrint out various Ensembl related info.\n\n### py_versions\n\nPrint out Python-related versions.\n\n### get_ref_transcripts\n\nFetch canonical transcriptome and the list of single isoform transcipt using the [Ensembl](http://www.ensembl.org/) v69 Perl API.\n\n### mapnsort\n\n```\nusage: mapnsort [-h] [-f ref_fasta] [-s] [-o output_file]\n                input file [input file ...]\n\nMap and sort reads.\n\npositional arguments:\n  input file      Paired-end reads in separate fastq files.\n\noptional arguments:\n  -h, --help      show this help message and exit\n  -f ref_fasta    Reference sequences in fasta format.\n  -s              Assume reads are single ended.\n  -o output_file  Output file name.\n```\n\n### simulate_data\n\n```\nusage: simulate_data [-h] -f ref_fasta [-m map_ref] [-r rlsim_opts]\n                     [-n simngs_opts] -x simngs_runfile [-o out_dir]\n                     [-l log_file] -z tools_path [-y dir_name]\n\nSimulate RNA-seq library construction and Illumina sequencing.\n\noptional arguments:\n  -h, --help         show this help message and exit\n  -f ref_fasta       Reference sequences in fasta format for simulation.\n  -m map_ref         Reference sequences for mapping.\n  -r rlsim_opts      Extra rlsim options.\n  -n simngs_opts     simNGS options.\n  -x simngs_runfile  simNGS runfile.\n  -o out_dir         Output directory.\n  -l log_file        Log file.\n  -z tools_path      Path to simulation tools.\n  -y dir_name        Name of the simulation directory\n```\n\n### meta_cov_cmp\n\n```\nusage: meta_cov_cmp [-h] -m m_pickle -f f_pickle [-r pdf] [-p el_pickle]\n\nCompare the distributions of pickled coverage stats (version 1.0).\n\noptional arguments:\n  -h, --help    show this help message and exit\n  -m m_pickle   Pickle generated with full model.\n  -f f_pickle   Pickle generated with flat model.\n  -r pdf        Report PDF.\n  -p el_pickle  Result pickle file.\n```\n\n### meta_pb_cmp\n\n```\nusage: meta_pb_cmp [-h] -a a_pickle -s s_pickle [-p res_pickle]\n\nCompare pickled bias stats (version 1.0).\n\noptional arguments:\n  -h, --help     show this help message and exit\n  -a a_pickle    Pickle generated from real data.\n  -s s_pickle    Pickle generated from simulated data.\n  -p res_pickle  Result pickle file.\n```\n\n### plot_global_report\n\n```\nusage: plot_global_report [-h] [-c cov_pickles [cov_pickles ...]]\n                          [-p pb_pickles [pb_pickles ...]] [-l labels]\n                          [-r pdf]\n\nCollate the results from different datasets on a single plot(version 1.0).\n\noptional arguments:\n  -h, --help            show this help message and exit\n  -c cov_pickles [cov_pickles ...]\n                        Pickles generated by cov_cmp.\n  -p pb_pickles [pb_pickles ...]\n                        Pickles generated by pb_plot.\n  -l labels             Dataset labels file.\n  -r pdf                Report PDF.\n```\n\n[![githalytics.com alpha](https://cruel-carlota.pagodabox.com/97ee4c664b001634390e89baeb291f11 \"githalytics.com\")](http://githalytics.com/sbotond/paper-rlsim)\n", 
  "id": 12080604
}