{
  "read_at": 1462559178, 
  "description": "A modification of the comparative phylogeographic method, msBayes", 
  "README.md": "Table of Contents\n=================\n\n -  [Overview](#overview)\n -  [Requirements](#requirements)\n -  [Installation](#installation)\n -  [Citing dpp-msbayes](#citing-dpp-msbayes)\n -  [Documentation](#documentation)\n    -  [The Configuration File](#the-configuration-file)\n        -  [The Preamble](#the-preamble)\n -  [Acknowledgements](#acknowledgements)\n -  [License](#license)\n -  [Literature Cited](#literature-cited)\n\nOverview\n========\n\nThis is a modified version of the `msBayes` package. It is modified by [Jamie\nOaks](http://www.phyletica.com) from version 20130611 (revision 146) available\nvia SVN here: <http://sourceforge.net/projects/msbayes/>.\n\n`dpp-msbayes` implements approximate-Bayesian model choice to infer comparative\nphylogeographic histories.\n\nIn this distribution of the code, the phylogeographic model has been\nre-parameterized, and different probability distributions are made available to\nexpress prior uncertainty about many of the models' parameters.\n\nI strongly recommend you use this software via the Python multiprocessing\npackage `PyMsBayes` (<https://github.com/joaks1/PyMsBayes>). This package comes\nbundled with pre-compiled `dpp-msbayes` executables (and the original `msBayes`\nexecutable, as well, which you can use interchangeably). Also, the test suite\nof `PyMsBayes` is *much* more extensive. If you do opt to use `PyMsBayes`,\nhowever, I still encourage you to read the `Documentation` section below.\n\nRequirements\n============\n\nThe primary requirement is the GNU Scientific Library (GSL;\n<http://www.gnu.org/software/gsl/>). To use the bundled `R` code for\nlocal-linear regression/multinomial logistic regression adjustment of posterior\nestimates, you will also need `R` and add-on packages `locfit`, `VGAM`, and\n`KernSmooth`. However, there are alternative posterior adjustment procedures\navailabe (e.g., GLM regression implemented by `ABCtoolbox`;\n<http://www.cmpg.iee.unibe.ch/content/softwares__services/computer_programs/abctoolbox/index_eng.html>).\n\nInstallation\n============\n\nThis version of `msBayes` now uses `CMake` (<http://www.cmake.org/>) for the\nbuild system.  For specifics, please see\n[`INSTALL.md`](https://github.com/joaks1/dpp-msbayes/blob/master/INSTALL.md).\n\nCiting dpp-msbayes\n==================\n\nIf you publish results obtained using this software, please cite:\n\n > Oaks, J. R. (2014). An Improved Approximate-Bayesian Model-choice Method for\n > Estimating Shared Evolutionary History. arXiv:1402.6303 [q-bio:PE].\n > <http://arxiv.org/abs/1402.6303>\n\nAlso, please cite the work describing the version of `msBayes` this code is\nbased on:\n\n > Huang, W., N. Takebayashi, Y. Qi, and M. J. Hickerson, 2011.\n > MTML-msBayes: Approximate Bayesian comparative phylogeographic\n > inference from multiple taxa and multiple loci with rate\n > heterogeneity. BMC Bioinformatics 12:1.\n\nAlso, more details of the model implemented in the original version\nof `msBayes` can be found in:\n\n > Oaks, J. R., Sukumaran, J., Esselstyn, J. A., Linkem, C. W., Siler, C. D.,\n > Holder, M. T., & Brown, R. M. (2012). Evidence for climate-driven\n > diversification? A caution for interpreting ABC inferences of simultaneous\n > historical events. Evolution, 67(4), 991-1010.\n > doi:10.1111/j.1558-5646.2012.01840.x.\n\nDocumentation\n=============\n\nDocumentation for the original version of `msBayes` from which this software\nhas been modified can be found in `documents/mtml-msBayes-manual.pdf` and at\n<https://docs.google.com/document/d/15heQlz60cGe6GWKcXqf1AIYMBZ6p2sKuGct-EoEHiNU/edit>.\nThese sources are still helpful for using this version of the software, but\nplease read below to understand the differences in the model and how it is\nused.\n\nThe Configuration File\n----------------------\n\nThis section provides some information needed to use this software. It is\nprobably best to use this method via the Python multiprocessing package\n`PyMsBayes` (<https://github.com/joaks1/PyMsBayes>), and thus this section\ndoes not provide all the details for doing a full analysis from start to\nfinish \"by hand.\" All that is needed to use this method via `PyMsBayes` is\nan understanding of the `msBayes` configuration file. Below is an example\nconfiguration file:\n\n    concentrationShape = 0\n    concentrationScale = 0\n    thetaShape = 1\n    thetaScale = 0.001\n    ancestralThetaShape = 1\n    ancestralThetaScale = 0.001\n    thetaParameters = 001\n    tauShape = 1.0\n    tauScale = 2.0\n    bottleProportionShapeA = 5\n    bottleProportionShapeB = 1\n    bottleProportionShared = 1\n    numTauClasses = 0\n    migrationShape = 1\n    migrationScale = 1\n    recombinationShape = 0\n    recombinationScale = 0\n    constrain = 0\n    subParamConstrain = 111111111\n    \n    BEGIN SAMPLE_TBL\n    pair0\tlocus0\t1\t1\t10\t10\t15.6\t1000\t0.35\t0.28\t0.13\tpair0.locus0.fasta\n    pair1\tlocus0\t1\t1\t10\t10\t15.6\t1000\t0.35\t0.28\t0.13\tpair2.locus0.fasta\n    pair2\tlocus0\t1\t1\t10\t10\t15.6\t1000\t0.35\t0.28\t0.13\tpair3.locus0.fasta\n    pair3\tlocus0\t1\t1\t10\t10\t15.6\t1000\t0.35\t0.28\t0.13\tpair3.locus0.fasta\n    END SAMPLE_TBL\n\nA configuration file has two parts, (1) the *sample table* delimited by the\n`BEGIN SAMPLE_TBL` and `END SAMPLE_TBL` lines, and (2) the *preamble*\ncontaining keyword arguments prior to the sample table.\n\nThere are two differences between this modified implementation of `msBayes` and\nthe original when it comes to the preamble of configuration files.\n\n 1. The preamble is processed differently in this version. The original\n    implementation is case-sensitive regarding the keywords in the preamble.\n    I.e., the camel-case type for `subParamConstrain` is strictly enforced.\n    More importantly, the old version quietly uses default settings when any\n    options are mis-typed.  in other words if you specify `uppertheta = 0.01`\n    in a config (note the lower case \"t\"), it will quietly use the default\n    setting for `upperTheta` and *not* report any warning or error.\n\n    In this version of the software, the keywords in the preamble are case\n    insensitive, and if any unrecognized keywords are encountered, an error is\n    reported and the process exits (i.e., crashes).\n\n 2. In this version, the options in the preamble are different and allow you to\n    parameterize the model and specify prior probability distributions on\n    parameters, as follows detailed in the next section.\n\n###The Preamble\n\n -  `concentrationShape`/`concentrationScale`\n    \n    Rather than assume the U-shaped prior of the original `msBayes` (see Oaks\n    et al., 2012), this implementation allows the user to specify a\n    Dirichlet-process prior over all possible divergence models.  Specifically\n    when both of these options are positive numbers, they define the shape and\n    scale parameters of a gamma hyperprior controlling the concentration\n    parameter of a Dirichlet-process prior on divergence models.\n\n    If either or both are zero (as above), this specifies that a uniform prior\n    over order-independent divergence models (*not* over the number of\n    divergence events; I.e., Psi) is to be used.\n\n    If either or both are -1.0 or less, then the original U-shaped prior is\n    used. It's an odd combination of a discrete uniform distribution on the\n    number of divergence events (Psi) and a multinomial distribution on the\n    divergence model given the number of events (with the constraint that there\n    must be Psi elements in the model; see Oaks et al. 2012 for full details).\n -  `thetaParameters`\n    \n    This implementation allows the user full control over the parameterization\n    of the population size parameters for each population pair, which we will\n    refer to theta_a, theta_d1, and theta_d2 for the ancestral, and two\n    descendant populations.\n\n    `000` is one extreme, where theta_a, theta_d1, and theta_d2 are all\n    constrained to be equal for each population pair (population sizes will\n    still vary among pairs).\n\n    `012` is the other extreme, where theta_a, theta_d1, and theta_d2 are all\n    estimated as independent parameters. This is most similar to the original\n    `msBayes`, however, the descendant population sizes are constrained to be\n    negatively correlated in the original implementation (see Oaks 2012).\n\n    Another example is `001`: the descendant populations share the same size\n    parameter, but the ancestral population size is free to vary.\n\n    For `011` and `010`, one of the descendant population is constrained to the\n    same size as the ancestral, and the other is free to vary.\n\n    Note, this indicator sequence should always be three integers long, always\n    start with `0` and increment by 1 whenever a free parameter is added.\n -  `thetaShape`/`thetaScale`\n\n    These settings define the shape and scale parameters of a gamma prior\n    distribution on population size parameters (scaled by the per-site mutation\n    rate (u); Nu).\n -  `ancestralThetaShape`/`ancestralThetaScale`\n    \n    If these settings are both provided and both are positive, they define the\n    shape and scale parameters of a gamma prior on the sizes of ancestral\n    populations.\n    \n    If they are excluded, or both are zero, the `thetaShape` and `thetaScale`\n    settings are used for the gamma prior on ancestral population size\n    parameters.\n -  `tauShape`/`tauScale`\n    \n    These settings define the shape and scale parameters of a gamma prior\n    distribution on divergence time parameters. The units are in coalescent\n    units, Nc generations, where \"Nc\" is a constant reference population size\n    based on the mean of the theta prior (defined by `thetaShape` and\n    `thetaScale`). If we use theta_prior_mean to represent the mean of the\n    theta prior, then Nc is theta_prior_mean / u, where \"u\" is the per-site\n    mutation rate. Thus, you can convert these \"Nc generations\" units to the\n    number of generations by assuming a mutation rate and multiplying by\n    (theta_mean_prior/u). See Oaks (2012) for more details.\n -  `bottleProportionShapeA`/`bottleProportionShapeB`\n    \n    If both are positive, settings define the shape parameters alpha and beta,\n    respectively, of a beta prior distribution on the magnitude parameters (in\n    units of the proportion of the population size) of a post-divergence\n    bottleneck in each of the descendant populations.\n\n    The bottleneck proportions are in terms of the proportion of the effective\n    population size that remains following the bottleneck. Thus a value of 0.95\n    would mean that bottleneck reduces the effective population size by 5%.\n\n    If either or both are zero or less, there is no post-divergence population\n    bottleneck (i.e., these parameters along with the timing of the bottleneck\n    are removed from the model).\n\n    NOTE, there are also a parameters in the model for the timing of the end of\n    the bottleneck (it begins at speciation in forward time). There is one of\n    these parameters for each descendant population (i.e., the descendant\n    populations of each pair share the same bottleneck-end-time parameter).\n    Thus if either or both of the\n    `bottleProportionShapeA`/`bottleProportionShapeB` settings are zero or\n    less, you are also removing these bottleneck timing parameters from the\n    model. This means you are removing 3*Y parameters from the model, where \"Y\"\n    is the number of taxon pairs.\n -  `bottleProportionShared`\n\n    If this option is zero, then there are two free bottleneck-magnitude\n    parameters for each population pair (one for each descendant population).\n    If it is any other number, then there is one bottleneck-magnitude parameter\n    for each population pair (i.e., the descendant populations of each pair\n    share the same bottleneck parameter).\n\n    NOTE, this setting is overridden if either or both of the\n    `bottleProportionShapeA` or `bottleProportionShapeB` settings is zero or\n    less (because then there is no bottleneck parameters at all).\n -  `migrationShape`/`migrationScale`\n\n    These settings define the shape and scale parameters of a gamma prior\n    distribution on symmetric migration parameters (in units of the number of\n    gene copies per generation).\n\n    If either or both are zero or less, there is no migration in the model.\n -  `recombinationShape`/`recombinationScale`\n\n    These settings define the shape and scale parameters of a gamma prior\n    distribution on the intragenic recombination rate parameters.\n\n    If either or both are zero or less, there is no recombination in the model.\n -  `numTauClasses`\n    \n    If this setting is zero, the number of divergence events is free to vary\n    according to the prior on divergence models specified by\n    `concentrationShape` and `concentrationScale`.\n\n    If greater than zero, then the model is constrained to `numTauClasses`\n    divergence events.\n -  `constrain`/`subParamConstrain`\n    \n    I strongly recommend *not* changing these settings. The software is\n    completely untested in how it behaves when constrained models are specified\n    with these options.\n\nAcknowledgements\n================\n\nThis software greatly benefited from funding provided to [Jamie\nOaks](http://www.phyletica.com) from the National Science Foundation (DEB\n1011423 and DBI 1308885), University of Kansas (KU) Office of Graduate Studies,\nSociety of Systematic Biologists, Sigma Xi Scientific Research Society, KU\nEcology and Evolutionary Biology Department, and the KU Biodiversity Institute.\n\nLicense\n=======\n\nThis program is free software; you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation; either version 2 of the License, or\n(at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along\nwith this program. If not, see <http://www.gnu.org/licenses/>.\n\nSee \"LICENSE\" for full terms and conditions of usage.\n\nLiterature Cited\n================\n\n > Oaks, J. R., Sukumaran, J., Esselstyn, J. A., Linkem, C. W., Siler, C. D.,\n > Holder, M. T., & Brown, R. M. (2012). Evidence for climate-driven\n > diversification? A caution for interpreting ABC inferences of simultaneous\n > historical events. Evolution, 67(4), 991-1010.\n > doi:10.1111/j.1558-5646.2012.01840.x.\n\n", 
  "id": 12113748
}