{
  "read_at": 1462559100, 
  "description": "A list of potential research topics and project ideas for Jacobs University students", 
  "README.md": "Research Topics\n===============\n\nA list of potential research topics and project ideas for Jacobs University students:\n\n\n## Language and Mathematics Processing and Understanding\n### ([LLaMaPUn](https://trac.kwarc.info/lamapun/))\n\nThe novel challenges in the bellow topics rest largely in the adaptation of classic methods to scientific papers\nrich in mathematics, which lift the unstructured analysis of traditional NLP to the semi-structured world of XML.\n\nAdditionally, we have a number of large document collections that have yet to be investigated.\n\n  * [**Statistical Footprints of Large-scale Corpora of Scientific Documents**](Footprints.md)\n  \n  * [**Discovering Declarations of Mathematical Terms**](DiscoveringDeclarations.md)\n  \n  * [**Discovering Definitions in Scientific Texts**](DiscoveringDefinitions.md)\n  \n  * [**Collocation Patterns in arXiv**](CollocationPatterns.md)\n  \n  * [**Domain Extensions to a Grammar for Math Syntax**](GrammarExtensions.md)\n  \n  * [**Discover Embellished Objects in Mathematical Syntax**](EmbelishedObjects.md)\n\n## Knowledge Discovery of Mathematical Concepts\n### ([NNexus](https://github.com/dginev/nnexus))\n\n  * **Concepts as Topics**\n\n   Collect backlinks from NNexus-annotated pages to the source concepts, then explore the generated resource\n   by exporting the concept dictionary as a web site. Targets to auto-link include: MathOverflow, other Q&A sites,\n   original sites in NNexus index.\n \n  * **Improving Concept Discovery**\n  \n   Given a set of possible matches and a distance metric, design, implement and evaluate several clustering algorithms.\n  \n  * **Statistical Concept Extraction**\n   \n    Implement a term extraction algorithm for discovering not only concepts in the dictionary, \n    but also possible new terms, currently unknown to NNexus. Anntoate such occurances as dangling links.\n    Use the initial NNexus dictionary, together with the arXiv and ZBL corpus to bootstrap the learning process.\n \n\n## Semantic Authoring\n### ([sTeX](https://trac.kwarc.info/sTeX))</h3>\n\n  * [**MarkTeX**](MarkTeX.md) - design semantic authoring for MarkDown\n\n## Representation Toolkits\n### (General MKM)\n\n  * [**RegXML**](RegXML.md) - bring the power of regular expressions to XML\n  \n  * **OffPath**\n   \n    Create a general toolkit for bidirectionally converting the two classes of absolute offset-based annotation\n    and structural annotations (XPath, CSS and JQuery selectors), given a document as a reference point.\n    The idea is vaguely similar to converting between absolute and relative paths, provided a base directory.\n\n## Questions?\nIn order to reserve a topic or arrange a meeting for further discussion feel free to drop me an email.\n", 
  "id": 12354114
}