{
  "read_at": 1462549906, 
  "description": "Photon Asymmetry", 
  "README.md": "A_phot computing library\n========================\n\nAbout\n-----\n  * This is a library for computing Photon Asymmetry (A_phot)\n    parameter for morphological classification of clusters.\n    This parameter is described in detail in the following publication:\n    \n        D. Nurgaliev, M. McDonald, B. A. Benson, C. W. Stubbs, A. Vikhlinin\n        Robust Quantification of Galaxy Cluster Morphology Using Asymmetry and Central Concentration\n        arXiv:1309.7044\n\n  * This program is free software: you can redistribute it, modify\n    it or include parts of it in your free or proprietary software, provided\n    that you reference the aforementioned scientific publication.\n    \nThis software is freely available, but we expect that all publications describing work using this software, or all commercial products using it, quote at least one of the references given below. This software is released under the BSD License\n\n  * Copyright (C) 2013 Daniyar Nurgaliev\n\n\n\nPrerequisites\n-------------\n  * Python 2.4+ \n  * Installed numpy, scipy and pyfits packages \n\n\n\nInstallation\n------------\n  * Simply copy all python files (aphot.py, chandra.py, common.py, get_args.py, libaphot.py) to one folder.\n  * aphot.py is the main program that parses the command line and calls all necessary library functions.\n \n\n\nExamples\n--------\n\n  * Calculating A_phot given event 2 file, exposure map and point sources file:\n\n        cd examples/SPT-CLJ0352-5647/\n        python ../../aphot.py --evt_files=13490.evt.fits --exp_files=13490.exp.fits --reg_files=13490.psf.reg --ra=28.172 --dec=-13.970 --z=0.833 --R500=811.7\n\n    Here \"evt_files\", \"exp_files\" and \"reg_files\" set the paths to Chandra level 2 event file, \n    \"ra\" and \"dec\" are the coordinates of the cluster, \"z\" and \"R500\" are cluster redshift and radius \n    corresponding to overdensity 500 relative to the *critical* density at the cluster redshift. \n    \n\n  * Exposure maps and/or point sources can be omitted:\n\n        python ../../aphot.py --evt_files=13490.evt.fits --ra=28.172 --dec=-13.970 --z=0.833 --R500=811.7\n\n    In this case the program assumes uniform illumination of the chip, and uses an \n    internal ad-hoc routine for identifying point sources to be excluded from the image. This way of\n    using the program is NOT recommended, because the assumption of uniform illumintation is far from\n    reality, and the internal point sources finder is known to fail in some cases.\n        \n\n  * Instead of specifying all the parameters on the command line, they can be put in a configuration file:\n\n        python ../../aphot.py --cfg=13490.cfg\n\n    13490.cfg is a file with Python syntax which defines all relevant variables. \n\n\n  * Any variables from the configuration file can be overriden in the command line:\n\n        python ../../aphot.py --cfg=13490.cfg --H=72\n\n    Command line input has a higher priority and overrides values given in the configuration files.\n\n\n  * Multiple observations can be used:\n    \n        python ../../aphot.py --cfg=all_obs.cfg \n        python ../../aphot.py --evt_files='13490.evt.fits 15571.evt.fits' --exp_files='13490.exp.fits 15571.exp.fits'  ...\n\n    Event files, exposure maps, and point sources for both OBSIDs 13490 and 15571 will be used. \n    (See file all_obs.cfg for details.) \n    evt_files, exp_files, and reg_files can be either strings with filenames separated by spaces \n        \n        evt_files = 'file1 file2'\n\n    or Python lists\n        \n        evt_files = ['file1','file2']\n\n\n  * Several event files can be used with one exposure map:\n\n        cd examples/cl0405m4100\n        python ../../aphot.py --evt_files='5756.evt.fits 7191.evt.fits' --exp_files=cl0405m4100.exp.fits --reg_files=cl0405m4100.reg \\\n                --ra=61.351 --dec=-41.004 --R500=742 --z=0.686\n\n\n  * To check whether all input data are aligned correctly, add --inspect option:\n    \n        cd examples/SPT-CLJ0352-5647\n        python ../../aphot.py --cfg=all_obs.cfg --inspect=CL\n\n    This command will create several .png images with names starting with 'CL', that show events, exposures, \n    and points sources at different states of processing. Red shows exposure values, green - X-ray photons,\n    blue - region used for background estimation, black - excluded point sources.\n\n\n  * To suppress uncertainty calclation so that program runs faster, use\n\n        python ../../aphot.py --cfg=all_obs.cfg --Nresamplings=0\n\n    Nresamplings is the number of bootstrap iterations used to compute uncertainty. If it is set to 0, no bootstrapping happens.\n    The default value is 100. It can be changed to find a balance between computation speed and accuracy of uncertainty estimation.\n\n\n\nConfiguration file variables\n----------------------------\n\nVariable | Meaning\n---------|--------\nH        | Hubble constant in km/s/Mpc, default value 70\nOm       | Matter density (Flat cosmology is assumed, so that Dark Energy density = 1-Om), default value 0.27  \nEband    | X-ray energy band in eV, default value [500,5000]\nR_bkgr   | Annnulus to extract background level, in units of R500, default value [2,4]\nannuli   | Annuli for computing Aphot, default value [0.05, 0.12, 0.2, 0.3, 1.0]\nNresamplings |   Number of Monte-Carlo iterations for uncertainty estimation. If 0, uncertainty is not computed. Default value is 100\n\n\n", 
  "id": 12632795
}