{
  "read_at": 1462549888, 
  "description": "A Journal of Brief Ideas", 
  "README.md": "journalofbriefideas\n===================\n\nA Journal of Brief Ideas\n\n\n\nOne thing slowing down the flow of research information is that the quantum of research, or the smallest publishable amount, is actually quite large, meaning that a lot of good ideas don't get published (i.e. spread). Ideas stuck in a mind are no use to anybody except that one individual, and that limits the power of the idea.\n\nFurthermore, in some fields it can take five years of work or more for a postdoc to gather enough data and do the analysis for a single strong paper. The quantum is definitely too large in those fields.\n\nThe idea of a long paper of many pages is an evolved phenomenon with the original \"papers\"-letters in early journals-often taking half a page or less to print. But those days are long gone.\n\nIdeas which might be important but are small in size don't have a natural home. So what if there were a journal, or more specifically the equivalent of the arXiv, for these briefly-expressible ideas?\n\nThe key features of such a journal would be:\n\n* time and date stamped submission, for claiming priority\n* revisions allowed with a new date stamp\n* easy to cite like arXiv entries\n* include citations to other ideas in the journal\n* allow good search\n* have RSS feed for individual authors so you can follow one person's ideas if you like the way they think\n* ideas should be rateable by others\n* limit to the size of what can be presented. If it takes too much space to write down it is probably breakable into smaller ideas. Ideally each entry should be a single idea.\n\nOne of the main requirements for a journal are attributability and citabilty. One way to get these \"free\" are by building on a platform like www.figshare.com. It automatically provides a DOI for each uploaded object.\n\nThen the minimal version of a journal would involve a database of references between \"papers\" and a way to search them. Next would be a way to rate to the ideas so that the better ideas are more discoverable.\n\nPeer review is probably not required as experience with the arXiv shows that people are able to judge the value of a paper by themselves, and having brief ideas means that this should be even easier for an individual to assess. However, the rating of papers, either by citations, network analysis, or some kind of scoring system, would aid discoverability, which will be a major issue as the the journal scales.\n\nThe first couple of entries in the Journal of Brief Ideas are as follows:\n\nConcept document: http://figshare.com/articles/Journal_of_Brief_Ideas_concept/789014\n\nPlatform suggestions: http://figshare.com/articles/Journal_of_Brief_Ideas_platform/789062\n\n## Screenshots\n\nScreenshots of the site created at Science Hack Day 2013 in San Francisco:\n\nhttps://github.com/physicsdavid/journalofbriefideas/wiki\n\nFor more details see app/README.md\n", 
  "id": 13180454
}