{
  "read_at": 1462549862, 
  "description": "", 
  "README.md": "# Microgrid_sim\n\nAdvisors: [Hemanshu Kaul](http://iit.edu/csl/am/faculty/kaul_hemanshu.shtml) and [Michael Pelsmajer](http://iit.edu/csl/am/faculty/pelsmajer_michael.shtml)\n\n## Problem definition\n\nWe are going to build a model about small size power grid, which is called \"Microgrid\". The goal is to satisfy the (local) demand, optimized distribution, fairness requirement, reliable, and extensible of microgrid.\n\n## (Stochastic) Models in Energy Resources Management\n\nPotential reference papers:\n\n1. Borghetti, Alberto, et al. \"A Two-Stage Scheduler of Distributed Energy Resources.\" Power Tech, 2007 IEEE Lausanne. IEEE, 2007.\n\t[link](http://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=4538654)\n\n2. Li, G. C., et al. \"Development of a GHG-mitigation oriented inexact dynamic model for regional energy system management.\" Energy 36.5 (2011): 3388-3398.\n\t[link](http://www.sciencedirect.com/science/article/pii/S0360544211002040)\n\n3. Wong, Steven, and J. David Fuller. \"Pricing energy and reserves using stochastic optimization in an alternative electricity market.\" Power Systems, IEEE Transactions on 22.2 (2007): 631-638.\n\t[link](http://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=4162624)\n\n4. Wallace, Stein W., and Stein-Erik Fleten. \"Stochastic programming models in energy.\" Handbooks in operations research and management science 10 (2003): 637-677.\n\t[link](http://www.sciencedirect.com/science/article/pii/S0927050703100102)\n\n### Other supplementary papers\n\n* Niknam, Taher, Rasoul Azizipanah-Abarghooee, and Mohammad Rasoul Narimani. \"An efficient scenario-based stochastic programming framework for multi-objective optimal micro-grid operation.\" Applied Energy (2012).\n\thttp://www.sciencedirect.com/science/article/pii/S0306261912003030\n\n* Shen, Siqian. \"Optimizing designs and operations of a single network or multiple interdependent infrastructures under stochastic arc disruption.\" Computers & Operations Research (2013).\n\thttp://www.sciencedirect.com/science/article/pii/S0305054813001287\n\n* Hines, Paul, et al. \"The topological and electrical structure of power grids.\" System Sciences (HICSS), 2010 43rd Hawaii International Conference on. IEEE, 2010.\n\thttp://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=5428366&tag=1\n\n* Zhang, Weixiong, et al. \"Distributed stochastic search and distributed breakout: properties, comparison and applications to constraint optimization problems in sensor networks.\" Artificial Intelligence 161.1 (2005): 55-87.\n\thttp://www.sciencedirect.com/science/article/pii/S0004370204001481\n\n* Gregoratti, David, and Javier Matamoros. \"Distributed Energy Trading: The Multiple-Microgrid Case.\" arXiv preprint arXiv:1307.7622 (2013).\n\thttp://arxiv.org/abs/1307.7622\n\n* Dall'Anese, Emiliano, and Georgios B. Giannakis. \"Risk-Constrained Microgrid Reconfiguration Using Group Sparsity.\" arXiv preprint arXiv:1306.1820 (2013).\n\thttp://arxiv.org/abs/1306.1820\n\n* Sobe, Anita, and Wilfried Elmenreich. \"Smart microgrids: Overview and outlook.\" arXiv preprint arXiv:1304.3944 (2013).\n\thttp://arxiv.org/abs/1304.3944\n\n### For Microgrid terminologies:\n\n* [http://www.iitmicrogrid.net/](http://www.iitmicrogrid.net/)\n\n* [http://der.lbl.gov/](http://der.lbl.gov/)\n\n* [http://www.nrel.gov/tech_deployment/microgrids.html](http://www.nrel.gov/tech_deployment/microgrids.html)\n\n## General Optimization Resources\n\n* Winston, Wayne L., and Jeffrey B. Goldberg. Operations research: applications and algorithms. Belmont: Thomson/Brooks/Cole, 2004. \n\n* Bertsimas, Dimitris, and John N. Tsitsiklis. \"Introduction to linear optimization.\" (1997).\n\n## Stochastic Programming Resources\n\n* Shapiro, Alexander, Darinka Dentcheva, and Andrzej P. Ruszczynski. Lectures on stochastic programming: modeling and theory. Vol. 9. SIAM, 2009. \n\t[link](http://www2.isye.gatech.edu/people/faculty/Alex_Shapiro/SPbook.pdf)\n\n* Wallace, Stein W., and William T. Ziemba, eds. Applications of stochastic programming. Siam, 2005.\n\t[link](http://books.google.com/books?hl=en&lr=&id=KAI0jsuyDPsC&oi=fnd&pg=PR1&dq=application+of+stochastic+programming&ots=RQ-W_C5dbl&sig=W55SVosukgR_QlsBgyL244LW1EI#v=onepage&q=application%20of%20stochastic%20programming&f=false)\n\n## CPLEX: High-performance mathematical programming solver for linear programming, mixed integer programming, and quadratic programming\n\nModel business issues mathematically and solve them with IBM ILOG CPLEX Optimizer's powerful algorithms to produce precise and logical decisions.\n\nIBM ILOG CPLEX Optimizer's mathematical programming technology enables decision optimization for improving efficiency, reducing costs, and increasing profitability.\n[Official Site](http://www-01.ibm.com/software/commerce/optimization/cplex-optimizer/)\n\n## Question about fairness\n\n* Anton J. Kleywegt\n\nOptimization and Stochastic Modeling applied to Transportation, Distribution and Logistics, especially in the following areas: Vehicle Routing and Scheduling, Distribution Operations, Distribution Network Design, Yield Management, Terminal Design and Operations, Logistics Planning and Control, Multimodal Transportation, Intelligent Transportation Systems.\n[Profile link](http://www2.isye.gatech.edu/~anton/)\n\n\np.s.\nFor researchers and students from Applied Mathematics division, if you are interested in large complex systems, and want to work on energy related research, please read a report from DOE: [At the U.S. Department of Energy: Past, Present and a View of Future](http://science.energy.gov/~/media/ascr/pdf/program-documents/docs/Brown_report_may_08.pdf). It may help you to understand how to begin your research and set up a startpoint.", 
  "id": 13199615
}