{
  "read_at": 1462550593, 
  "description": "A new version of the Vevacious code that is so different that it warrants a new project!", 
  "README.txt": "/*****************************************************************************\\\n * README.txt                                                                *\n *                                                                           *\n *  Created on: Feb 18, 2014                                                 *\n *      Authors: Ben O'Leary (benjamin.oleary@gmail.com)                     *\n *      Copyright 2014 Ben O'Leary                                           *\n *                                                                           *\n *      This file is part of VevaciousTwo, a program designed to find        *\n *      configurations of vacuum expectation values (VEVs) for the           *\n *      minima of a quantum field theory potential energy function, and to   *\n *      calculate quantum and thermal tunneling out of a given desired       *\n *      symmetry-breaking vacuum if possible. It is a re-write of Vevacious  *\n *      by Ben O'Leary, Florian Staub, Jos Eliel Camargo Molina, and Werner *\n *      Porod.                                                               *\n *                                                                           *\n *      VevaciousTwo is free software: you can redistribute it and/or modify *\n *      it under the terms of the GNU General Public License as published by *\n *      the Free Software Foundation, either version 3 of the License, or    *\n *      (at your option) any later version.                                  *\n *                                                                           *\n *      VevaciousTwo is distributed in the hope that it will be useful, but  *\n *      WITHOUT ANY WARRANTY; without even the implied warranty of           *\n *      MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU     *\n *      General Public License for more details.                             *\n *                                                                           *\n *      You should have received a copy of the GNU General Public License    *\n *      (in HoTTMiLC/GNU_public_license.txt ) along with VevaciousTwo. If    *\n *      not, see <http://www.gnu.org/licenses/>.                             *\n *      A full list of the files of VevaciousTwo is at the end of this file. *\n\\*****************************************************************************/\n\n Now that the legalese preamble is out of the way, the description of the code\n and how to use it can begin!\n\n VevaciousTwo is a program written in C++ to try to find all the minima of a\n loop-corrected potential and to calculate tunneling out of a desired\n symmetry-breaking minimum if this happens to be a false vacuum. It is designed\n to be used with model files which we recommend be generated by SARAH by\n Florian Staub, and utilizes the MINUIT algorithms by Fred James. Much of the\n tunneling code is based on the Python package CosmoTransitions, by Carroll\n (Max) Wainwright.\n \n VevaciousTwo is an implementation of the process of attempting to find the\n minima of a quantum field theory potential with loop and thermal corrections,\n as decided upon by the collaboration of\n Jos Eliel Camargo Molina (elielx@gmail.com),\n Ben O'Leary (benjamin.oleary@gmail.com),\n Werner Porod (porod@physik.uni-wuerzburg.de), and\n Florian Staub (florian.staub@googlemail.com). This README file was written by\n Ben O'Leary.\n \n A manual describing the physics and process of VevaciousTwo will be available\n from http://arxiv.org/abs/????.???? and there will be a quickstart guide\n available from http://vevacious.hepforge.org/ following the appropriate link.\n A rough version of the installation instructions will be also contained in\n this README file, below the description of the process.\n\n Phase 1) Collect underpants\n Phase 2) ?\n Phase 3) Profit!\n Phase 4) Download and compile the LesHouchesParserClasses (LHPC) C++ library.\n          The files are available at\n          http://www.hepforge.org/downloads/lhpc\n          (link last checked 2013-08-29) or\n          https://github.com/benoleary/LesHouchesParserClasses_CPP\n          (link last checked 2013-08-29). The installation should just be\n          downloading, unzipping, and then running make.\n Phase 5) Compile VevaciousTwo. The Makefile should be edited to have the\n          correct paths to the header files and library file of LHPC (these are\n          /path/to/unzipped/LHPC/include/ and /path/to/unzipped/LHPC/lib/ by\n          default). LHPC version 0.8.5 or higher is required.\n\n\nCHANGELOG:\n * 18th February 2014: version 2.0.prealpha001\n - Not even released!\n\n\nThe C++ files of VevaciousTwo are:\n\n <> headers in VevaciousTwo/include/:\n *.hpp\n\n <> source files in VevaciousTwo/source/:\n *.cpp\n\n <> and also:\n VevaciousTwo/Makefile\n and README.VevaciousTwo.txt\n which describes the package (copied as README.txt).\n The makefile creates a single executable in VevaciousTwo/bin/:\n VevaciousTwo.exe, the executable which performs the full set of steps to try\n to find the minima of the loop- and thermal-corrected potential and tunneling\n out of the DSB minimum if it is a false vacuum.\n \n <> Some example files are also given:\n * VevaciousTwo/bin/VevaciousTwoInitialization.xml which is a default\n   initialization file, which uses paths that need to be changed.\n * Various files in VevaciousTwo/ModelFiles/, with the extension .vin, which\n   specify various models.\n   \n ", 
  "id": 13778355
}