{
  "read_at": 1462550536, 
  "description": "Gaussian process regression code.", 
  "README.md": "PyGPML\n======\n\nPython version of Carl Rasmussen and Hannes Nickisch for Gaussian Processes. Their code can be found here: \n\nhttp://www.gaussianprocess.org/gpml/code/matlab/doc/\n\nThis repo, so far, is implementing a small subset of the original MATLAB code from above. It mainly implements a Gaussian process with Gaussian noise, making the maximum likelihood integral analytically solveable exactly. The corresponding function is given in inferences.py.\n\nThere are a few standard built-in kernels, but this code also implements a spectral mixture (SM) kernel for pattern recognition (which was the original motivation for this code) given by Andrew G. Wilson and Ryan P. Adams in the following references:\n\n[1] http://arxiv.org/abs/1302.4245\n\n[2] http://arxiv.org/abs/1310.5288\n\nAnd a resource page for this work is given here:\n\nhttp://mlg.eng.cam.ac.uk/andrew/pattern/\n\nBriefly, it implements a typical gaussian process with a covariance kernel function that is a mixture of Gaussians:\n\nk(t) = sum_{q=1}^Q w_q prod_{p=1}^P exp(-2pi^2 t_p^2 v_{p,q}^2) cos(2pi t_p m_{p,q})\n\nwhere t = x-x', q = ith out of Q Gaussians in the mixture, p = jth out of P dimensions, w = weighting of qth Gaussian mixture, v2 = v^2 = std. deviation, and m = means.\n\nThis form allows the SM kernel to approximate any kernel with enough Gaussians in the mixture and to capture any consistent pattern in the data. An example problem using the airline data from [1] is given here as well as the atmospheric CO2 problem.\n\nFor any model functions, like inference, likelihood, mean, and kernel/covariance, the user can specify a built-in function included with the code, or define their own (using the built-in functions as a template as the arguments and return types obviously must be the same).\n\nCode has been tested with Python 2.7 only. Requires SciPy, NumPy, and matplotlib.\n\n\n## Testing\n\nTo test the code, simply navigate to the testing/ directory, edit addpath.py accordingly with the absolute path of PyGPML (it will add it to your python path), and then simply run 'nosetests', or 'nosetests -sv' to see what's going on. Obviously this requires nosetests to be installed.\n\n\n## Usage\n\nThe example scripts are probably the best place to start understanding how to use the code, and they're found in the examples/ dir. Some of them have data, which is included in examples/data/. There is a file called addpath.py that requires you to edit in the absolute path of PyGPML folder so that it can add it to your python-path. Same goes for the tests.\n\nFeel free to ping me for help: had sed (at) google mail\n", 
  "id": 14027738
}