{
  "read_at": 1462556847, 
  "description": "A Mathematica package to call other programs commonly used in cosmology", 
  "README.md": "What is cosmomathica?\n=====================\n\nWolfram Mathematica is a powerful and convenient software package used by\nmany cosmologists everywhere. However, since it is not always the most\nefficient for low-level computing, most popular algorithms for numerical\ncomputations in cosmology have been written in C or Fortran, since these\nlanguages are typically much better suited for the task at hand. This\npackage bundles the functionality of some of these algorithms in\na Mathematica package, which makes them easier to use and avoids the need to\nlearn C or Fortran.\n\nIt makes use of the MathLink technology, which means that the original\nsource code remains untouched. The algorithms are not reimplemented either,\nbecause that would negate the advantage of having them implemented in\na lower level language in terms of efficiency. On top of that, it would\ninevitably introduce new bugs given the complexity of these algorithms.\n\nFor further details on how MathLink works, see\nhttp://arxiv.org/abs/1107.4379.\n\n\n\nRequirements\n============\n\n  * Wolfram Mathematica version >=8\n\n  * For CosmicEmulator and FrankenEmu: GSL (GNU Scientific Library)\n\n  * For CAMB: Possibly cfitsio, healpix\n\n  * For Copter: The Boost C++ library headers\n\n  * The GNU Compiler Compilation (gcc) version >=4.6\n\n\n\nExternal programs\n=================\n\nDue to copyright issues, the external packages cannot be delivered as part\nof this package. You need to download the source code of the following\nprograms yourself. To make sure you got the right version, the MD5 sums of\nthe files in question are given here.\n\n  * Transfer function: \n    tf_fit.c\n    38ef737fe3bab405bac17db78815559f\n    power.c\n    32c6a5912acd36f5522d0a81c8f8c5d7\n    http://background.uchicago.edu/~whu/transfer/transferpage.html\n    Daniel Eisenstein and Wayne Hu \n\n  * Halofit+:\n    halofit+.tar\n    4ce61ec6504a2f7cf750ab007142dea8\n    http://www.roe.ac.uk/~jap/haloes/\n    Robert Smith et al, Martin Kilbinger\n\n  * CAMB (Nov 2013):\n    CAMB.tar.gz\n    473b1a87c9aa4972aedb0b5ba8ec037b\n    http://camb.info/\n    Antony Lewis and Anthony Challinor\n\n  * CLASS (v2.3.2):\n    class_v2.3.2.tar.gz\n    4ece1125f2cffc63ad2c4212441fea88\n    http://class-code.net/\n    Julien Lesgourges\n\n  * CosmicEmulator \"Coyote\" (v1.1):\n    CosmicEmu_v1.1.tar.gz   \n    a3c7da2b41152b7d30ba458e56f7e4ab  \n    http://www.lanl.gov/projects/cosmology/CosmicEmu/emu.html\n    Earl Lawrence\n\n  * FrankenEmu\n    CosmicEmu_v2.tar.gz\n    1018867d84d9e6820a9ae8ee2f213b06\n    http://www.hep.anl.gov/cosmology/CosmicEmu/CosmicEmu_v2.tar.gz\n    Earl Lawrence\n\n  * Copter (v0.8.7):\n    copter-0.8.7.tar.gz\n    397afcad4a0ace992fe23828b2071a32\n    http://mwhite.berkeley.edu/Copter/\n    Jordan Carlson et al\n\nThe (extracted) files need to placed in directories with names `tf`,\n`halofit`, `camb`, `CosmicEmulator`, `FrankenEmu`, `class_v2.3.2` and\n`copter-0.8.7`, respectively, inside the `ext` directory.\n\nIf you wish to use a different version of CAMB, for instance, cosmomathica\nmay still work, but it has not been tested for it. If you use a modified\nversion of CAMB, the same applies. In general, if you modify things like the\ntype `CAMBparams`, you almost certainly will have to modify cosmomathica as\nwell.\n\n\nHow to compile the MathLink\n===========================\n\nThe paths to the required Mathematica libraries are often different on every\nsystem, so first you should adjust the Mathematica-related lines in the\nMakefile, which is located in the `ext` directory. Next, change into the\n`ext` directory and type `make`. \n\nCAMB uses the Intel Fortran compiler by default. Due to compatibility issues\nwith linking the different object files, CAMB needs to be compiled with GNU\ngfortran. When building the MathLink, CAMB's Makefile is automatically\nchanged accordingly.\n\nNote that all warnings and errors that you see may be cause by the external\nprograms. Make sure the warning is not from compiling the MathLink and\ncontact the respective authors if you have concerns. Otherwise, feel free to\nfile a bug report on GitHub.\n\n\nHow to use Cosmomathica\n=======================\n\nIn general, each one of the functions `CAMB`, `Transfer`, `Halofit`, `Class`\nand `CosmicEmu` returns a list of replacement rules containing the raw data\nas computed by the respective program. See the notebook `demo.nb` for\na demonstration. \n\n\nVersion\n=======\n\nThis is version 0.3. Since this is an alpha status, backwards compatibility\nmay be broken in future releases.\n\n\nCopyright and licensing\n=======================\n\nCosmomathica is released under the GPL2. Contributions are welcome. Note\nthat the copyright of the external software packages belong to their\nrespective owners. Read their copyright remarks before using them.\n", 
  "id": 14137982
}