{
  "README": "These directories contain various scripts for estimating the age of \nf2 variants, as described in \"Demography and the age of rare variants\"\n- Mathieson & McVean, (http://arxiv.org/abs/1401.4181). This is not finished software by \nany means, but we provide the scripts for people to explore the results\nin the paper, or investigate their own datasets. \n\nWarning:\nThis code does not handle missing data well. If your data contains missing \ngenotypes you should apply a pre-processing step to the vcf where you either remove \nrows with missing calls, or replace missing calls with majority calls.\n\nRequirements: \n\nThe code is written variously in C, R and python, and relies on various \nbash scripts. It has been tests on MacOSX and linux, but it's unlikely \nto run as it is on any other platform. \n\n1) R: Developed with R version 2.15. Packages required: gsl, RColorBrewer \n(not strictly required).\n\n2) python: 2.6 or higher. Packages required: numpy, biopython, gzip, sys, \ngetopt. Most of these are standard, but you may need to install numpy\nand certainly biopython. \n\n3) c: tested with gcc.\n\n4) For simulations, macs (http://code.google.com/p/macs/). And/or fastsimcoal\n (http://cmpg.unibe.ch/software/fastsimcoal2/)\n\n5) For data analysis, vcftools (0.1.11). \n\n6) Generally, standard unix utilities: awk, grep, sed, gzip and so on. \n\nQuickstart: \n\n1) Complie c code: in the \\libs directory: \n>R CMD SHLIB inference.C\n\n2) To test, edit simulations/run_chr.sh as follows:\n\na) MACS_DIR should point to the directory where the macs (and msformatter)\nbinary is.\n\nb) SIMS_DIR should read \"dir_to_put_simulations/${sim_type}/chr${CHR}\"\n\nc) CODE_DIR should point to this diretory (i.e. the git repository)\n\nd) HM2_MAP you can ignore for now. \n\n3) Then run test as follows:\n\n> run_chr CONST 1000000 constant_rate\n\nThis should generate a bunch of subdirectories in \n\"dir_to_put_simulations/constant_rate/CONST\" - check that there are\na bunch of things in the results subdirectory to make sure everything's\nworking. \n\n4) To run more sophisticated simulations, make sure HM2_MAP points to \na directory with some recombination maps (genetic_map_GRCh37_chrXX.txt.gz)\nand then run: \n> run_chr chr length sim_type 0 \n\nwhere chr=1..22, length=length in bp and sim_type is one of those listed\nin run_chr.sh. To run whole-genome simulations, look at run_all.sh.\n\n5) To actually run analysis on a dataset, refer to the scripts in \\analysis\nThese are set up to run on 1kg data, but shouldn't be too difficuly if you \nwanted to work out how to run them on any other dataset. \n\nDirectory descriptions:\n\n./analysis - top level scripts for analysing whole chromosome or whole\ngenome datasets. \n\n./dev - Experimental files, mainly for comparing results with msmc\nunsupported.\n\n./libs - libraries with all the actual inference, processing and plotting\nfunctions.\n\n./scripts - low level scripts for processing data and running analysis. Called\nby the scripts in ./analysis and ./simulations. \n\n./simulations - top level scripts for running simulations.\n\n./simulations2 - simulations using fastsimcoal2 instead of macs\n\n./test - contains some dummy files used for testing.\n\n\n", 
  "read_at": 1462556886, 
  "description": "Scripts for estimating the age of f2 variants from the paper \"Demography and the age of rare variants\"", 
  "id": 14233971
}