{
  "read_at": 1462556821, 
  "description": "'Spatial point pattern testing' (alias 'Surprisingly powerful and practical testing') library for R.", 
  "README.md": "# spptest\n\nAn R library for spatial point pattern testing\n\nspptest provides envelope and deviation tests for spatial point processes.\nThe main motivation for a new package are the scalings for deviation tests\nand global envelope tests.\n\n## Installation\n\nInstall the library to R with the following two R commands:\n\n```R\nlibrary(devtools)\ninstall_github('myllym/spptest', ref = 'no_fastdepth')\n```\n\nIf you do not have the library 'devtools' installed, install it first by\n\n```R\ninstall.packages(\"devtools\")\n```\n\nAfter installation, in order to start using `spptest`, load it to R and see\nthe main help page, which describes the usage of the functions of the library:\n```R\nlibrary(spptest)\nhelp(spptest) # or help(spptest, help=\"html\")\n```\n\nIn order to use the function random_labelling, the R library `marksummary` is\nneeded. It is currently available by request.\n\n## Branches\n\nThe branch for current public use is called `no_fastdepth`. It includes all the\nsame features as the `master` branch. The only difference is that the `master` \nbranch includes references to functional depth measures provided by the R \nlibrary fastdepth which is not yet publicly available.\n\n## References\n\nMyllymaki, M., Grabarnik, P., Seijo, H., and Stoyan, D. (2015).\nDeviation test construction and power comparison for marked spatial point\npatterns. Spatial Statistics 11, 19-34.\n(Preprint of the article: http://arxiv.org/abs/1306.1028)\n\nMyllymaki, M., Mrkvicka, T., Grabarnik, P., Seijo, H. and Hahn, U. (2015).\nGlobal envelope tests for spatial processes. arXiv:1307.0239v4 [stat.ME].\nhttp://arxiv.org/abs/1307.0239v4\n\nMrkvicka, T., Myllymaki, M. and Hahn, U. (2015).\nMultiple Monte Carlo testing with applications in spatial point processes.\narXiv:1506.01646 [stat.ME]. http://arxiv.org/abs/1506.01646\n", 
  "id": 14497677
}