{
  "read_at": 1462556893, 
  "description": "", 
  "README.md": "Finding the Void Probability Function of galaxies in BOSS data (CMASS and LOWZ)\n-------------------------------------------------------------------------------\n\n        Kilian Walsh and Jeremy Tinker\n        (arxiv article: ...)\n\n\n### Introduction\n\n> And I, infinitesimal being,\n> drunk with the great starry\n> void,\n> likeness, image of\n> mystery,\n> felt myself a pure part\n> of the abyss,\n> I wheeled with the stars,\n> my heart broke loose on the wind.\n>\n> ~ Pablo Neruda\n\nThe Void Probability Function (VPF) is a probability density function over the\nradius of randomly placed spheres in space, showing the probability that a\nsphere of a given radius will be empty - in this case, empty of galaxies. We\ncalculate the VPF for galaxies in the CMASS and LOWZ surveys of BOSS and\ncompare it with a VPF calculated from a HOD-populated dark matter simulation.\n\nThe Halo Occupation Distribution is a model for nonlinear galaxy bias that\nassigns galaxies to dark matter halos based solely on the mass of the halo.\nBy fitting the HOD parameters to have a mock galaxy catalogue that agrees with\nthe observed galaxy number density and 2-point projected correlation function,\nwe show the consistency of the HOD with the BOSS data via comparison of VPFs.\n\n\n### Code and Data\n\nThe code in this repository is designed to work as a standalone automated\nreproduction of the exact methodology of our experiment. Simply by running the\nscript \"run_expt.py\" you should reproduce all the results from our paper.\n\nBefore this is possible, a few configurations may be necessary. Firstly, all\nthe necessary python packages will need to be available. An easy way to ensure\nthis is through the command\n\n```\npip install -r requirements.txt\n```\n\nwhich should install the nonstandard python package this experiment uses. If\nyou need to make a local install, consult the pip documentation here:\n\nhttp://www.pip-installer.org/en/latest/cookbook.html\n\nAs for having all of the necessary data in the right place, you will need a lot\nof free space to store the necessary files, in particular the simulation output\nand mock galaxy catalogues. Most of the observational data is downloaded\nautomatically by the main script but for custom directory organisation in the\ncase of server space restrictions, you will have to symlink accordingly. These\ndetails are treated in the DATA.doc readme\n\nTODO\n\nFor access to as of yet proprietary data, you will have to contact the authors.\n\n\n### Subdirectories\n\n        BOSS_vpf\n        |\n        |--dat\n        |  (stores the modules for data manipulation and storage and the\n        |   subdirectories in which the output of the code is stored)\n        |\n        |--tests\n        |  (stores scripts and modules that test the consistency of the\n        |   algorithms used and that visualise the data in a useful way to\n        |   help understand its structure)\n        |\n        |--figs\n        |  (stores the modules that plot the figures from the paper and their\n        |   output)\n", 
  "id": 14496024
}