{
  "read_at": 1462551418, 
  "description": "An R-Java Bayesian Additive Regression Trees implementation", 
  "README.md": "bartMachine\n===========\n\nAn R-Java Bayesian Additive Regression Trees implementation (BART)\nSoftware for Supervised Statistical Learning\n\nCopyright (C) 2016 Adam Kapelner  \nDepartment of Mathematics, Queens College, City University of New York & \nJustin Bleich\nDepartment of Statistics, The Wharton School of the University of Pennsylvania\n\nThis is a Java implementation of the algorithm found in Chipman, George, & McCulloch \n[BART: Bayesian Additive Regressive Trees. The Annals of Applied Statistics. \n2010 4(1): 266-298](http://projecteuclid.org/DPubS/Repository/1.0/Disseminate?view=body&id=pdfview_1&handle=euclid.aoas/1273584455 \"PDF download of the BART paper\")\nas well as many other features.\n\n\nThe Paper\n---------\n\nFor a vignette describing the BART model and bartMachine's features, see our [vignette](http://cran.r-project.org/web/packages/bartMachine/vignettes/bartMachine_vignette.pdf) \nwhich is also on arXiv and is currently being reviewed by the Journal of Statistical Software.\n\n\nThe Manual\n----------\n\nSee the [manual](https://github.com/kapelner/bartMachine/blob/master/bartMachine.pdf?raw=true \"BART package manual\") for detailed information about the \npackage's functions and parameters.\n\n \nSetup Instructions\n------------------\n\nTo install the bartMachine package in R, you first need to install Java and rJava and configure your computer, then you \ncan install the package from CRAN or compile from source.\n\n### Install Java JDK (not the JRE)\n\nDownload the latest [Java JDK](http://www.oracle.com/technetwork/java/javase/downloads/jdk7-downloads-1880260.html \"Download the Java JDK for all operating systems\")\nand install it properly (Java7 or above required). rJava requires the JDK; you cannot just have a JRE.\n\n### Install rJava\n\nUse `install.packages(\"rJava\")` within R. If you experience errors, make sure your `JAVA_HOME` system variable is set to the root of your java installation (on a windows machine that\nwould look something like `C:\\Program Files\\Java\\jdk1.7.0_09`). Also try running `R CMD javareconf` from the command line. On ubuntu, you should run `sudo apt-get install r-cran-rjava`\nto install from the command prompt. If you still have errors, google your error message. There are many people who have had problems with the rJava installation in the past and the \nmajority of issues have been resolved on forums.\n\n### Install bartMachine via CRAN\n\nUse `install.packages(\"bartMachine\")` within R and then `options(java.parameters = \"-Xmx2500m\")` to set a larger amount of RAM than the default of 500MB and then `library(bartMachine)`.\n\n### Install bartMachine via compilation from source\n\nThis is recommended as you will get the [benefits of Java 7](http://www.oracle.com/technetwork/java/javase/jdk7-relnotes-418459.html) as well as the latest release of the\nsoftware (see [changelog](https://github.com/kapelner/bartMachine/blob/master/bartMachine/CHANGELOG)).\n\n1. Make sure you have [git](http://git-scm.com/downloads \"Download git for all operating systems\") \nproperly installed.\n\n2. Run `git clone https://github.com/kapelner/bartMachine.git` from your command line and navigate into the cloned project directory via `cd bartMachine`.\n\n3. Make sure you have a [Java JDK](http://www.oracle.com/technetwork/java/javase/downloads/jdk7-downloads-1880260.html \"Install Java JDK 7 for all operating systems\") \ninstalled properly. Then make sure the bin directory is an element in the PATH variable (on a windows machine it would look something like \n`C:\\Program Files\\Java\\jdk1.7.0_09\\bin`).\n\n3. Make sure you have [apache ant](http://ant.apache.org/bindownload.cgi \"Download apache ant for all operating systems\") installed properly. \nMake sure you add the bin directory for ant to your system PATH variable (on a windows machine it would be something like `C:\\Program Files\\apache-ant-1.8.4\\bin`).\nWe also recommend making a system variable `ANT_HOME` which would be set to the root of ant (on a windows machine it would be something like \n`C:\\Program Files\\apache-ant-1.8.4`). Also, double check the `JAVA_HOME` variable to make sure it points to the JDK \n\n4. Compile the JAVA source code into a JAR using `ant`. You should see a compilation record and then `BUILD SUCCESSFUL` and a total time.\n\n5. Now you can install the package into R using `R CMD INSTALL bartMachine`. On Windows systems, this may fail because it expects multiple architectures. This can \nbe corrected by running `R CMD INSTALL --no-multiarch bartMachine`. This may also fail if you don't have the required packages installed (run `install.packages(\"car\")` \nand `install.packages(\"missForest\")`). Upon successful installation, the last line of the output should read `DONE (bartMachine)`. \nIn R, you can now run `library(bartMachine)` and start using the package normally.\n\nAcknowledgements\n------------------\n\nWe thank Ed George, Abba Krieger, Shene Jensen and Richard Berk for helpful discussions. We thank Matt Olson for pointing out an important memory issue. \nWe thank [JProfiler](http://www.ej-technologies.com/products/jprofiler/overview.html) for profiling the code which allowed us to create a lean implementation.\n", 
  "id": 14871291
}