{
  "read_at": 1462551489, 
  "description": "An attempt to find inequalities between Chern classes on complex manifolds", 
  "README.md": "The inner product on exterior powers of a complex vector space\n===============================\n\nThe compiled pdf of the project is [here](http://dl.dropboxusercontent.com/u/1963234/cci.pdf).\nAn archive of the references cited in the bibliography is [here](http://dl.dropboxusercontent.com/u/1963234/cci-refs.tar.gz).\n\n* Description of the project\n\nThis was an attempt to find inequalities between Chern classes on complex\nmanifolds. The basic inequality we modelled our efforts on was the\nKobayashi-Lubke inequality for Hermite-Einstein vector bundles.\n\nThe first step in this attempt was to reprove the Kobayashi-Lubke inequality\nusing coordinate-invariant notation. This was necessary because the standard\nproof of the inequality is by calculations in local coordinates and there\nwas no way these remain managable when the degree of the Chern classes\ninvolved goes up. That said, the \"new\" proof is very probably the same as\nthe standard one if we write everything in a given basis; we just calculate\nthe square of the norm of a curvature tensor on the given bundle and\ncombine the result with a version of the Cauchy-Schwarz inequality.\n\nTo do this we viewed the curvature form of a vector bundle as a (2,2)-form\non the total space of the bundle. Then it was necessary to work out how to\nexpress the square of the norm of a (p,p)-form on a complex vector space in\nterms of its traces against the Kahler form of the inner product. Such an\nexpression is well-known for a (1,1)-form but I don't think it had already\nbeen worked out for higher-degree forms.\n\nThe next step, to find similar inequalities involving higher Chern classes,\nunfortunately failed. The reason is basically because we cannot calculate\nthe Hodge star or Lefschetz adjoint of a product of two forms, which is\nagain because the product of primitive forms is no longer primitive. I see\nno way past this difficulty and have stopped working on the project and\nsubmitted a note with what I did to the arXiv.\n\n\n* Open source mathematics\n\nAnyone was and is free to contribute to this project. I'll play the role of\nbenevolent dictator/editor, but anyone who wants his or her contribution\nrecognized will be credited in the paper, possibly exploding the \"author\"\nfield in the LaTeX file. \n\n\nGunnar Thor Magnusson,\ngunnarthormagnusson@gmail.com\n", 
  "id": 14986573
}