{
  "read_at": 1462551376, 
  "description": "A Mathematica package for computing thermodynamics (and more) in holographic Veneziano QCD. See arXiv:1112.1261, arXiv:1210.4516 and arXiv:1312.5199 for background, and README.md for details on the code.", 
  "README.md": "VQCDThermo\n==========\n\nA Mathematica package for computing thermodynamics (and more) in holographic Veneziano QCD. See [arXiv:1112.1261](http://arXiv.org/abs/1112.1261), [arXiv 1210.4516](http://arxiv.org/abs/1210.4516) and especially [arXiv 1312.5199](http://arxiv.org/abs/1312.5199) for background on VQCD and the type of computations this package does.\n\nCritical bugfix on May 22nd 2014\n-------------------\n\nOn the version that was public before May 22nd 2014, there was a mistake in the equations of motion, which lead to incorrect results when both &tau; and &ntilde; are non-zero. The errors are proportional to &ntilde;<sup>2</sup>&tau;<sup>2</sup>. Therefore any computations made at finite &mu; in the chirally broken phase with this code are wrong, and should be redone with the new release.\n\nWe apologize for the inconvenience.\n\nThe phase diagram in [arxiv 1312.5199](http://arxiv.org/abs/1312.5199) is also computed with the erroneous code. A correction will be published in the near future.\n\nWhat's new\n----------------\n\nJune 11th 2014\n- A bug caused the code that finds the correct Efimov vacuum to be disabled when using functions from the ThermoFactory package. This was the cause for the large number of fluctuations, since for most points the correct vacuum is found without the actual search phase, but in a number of individual points the root finder would pick the wrong vacuum. The tutorials have been updated to reflect this.\n- The project is now entirely developed and tested only in Mathematica 9\n- See the commit log for other fixes and improvements\n\nMay 22nd 2014:\n- Fix a critical error in the equations of motion\n- w &ne; &kappa; is now handled correctly\n- The automatic thermo computation is now in a usable state. The release includes tutorials for getting started with this part of the package.\n- Various smaller bug, usability and numerical stability fixes, see the commit log for details.\n\nWhat this code does\n-------------------\n\nThis code takes care of much of the boilerplate in doing numerical computations in the VQCD model at finite temperature and finite chemical potential. The lowest level work, that is, setting up the boundary conditions, solving the differential equations, fixing the various scales and so on, is contained in a fully automated form. Code for generating data from which the phase diagram can be deduced from, and code for analysing that data, are included in a semi-automated form.\n\nGetting Started\n===============\n\nInstallation\n------------\n\nThe sub-directory VQCDThermo (not the similarly named top-level repository directory!) needs to be in Mathematica's search path. The usual place to install the package can be found as follows:\n\n1.    Open a new Mathematica notebook. Type $UserBaseDirectory to an empty cell, and evaluate it. It should print out       a directory on your local filesystem.\n2.    Navigate to that directory on you computer. It should have a sub-directory Applications.\n3.    Copy the sub-directory VQCDThermo from the repository into the Applications sub-directory\n\nThe file should now be discoverable by Mathematica. Verify this by evaluating Needs[\"VQCDThermo`\"] in a notebook cell. It should not produce any output, especially you should not see a Get:noopen warning, if everything went right.\n\nYou are then ready to move to the next step.\n\nComputing black hole background solutions and extracting basic thermo observables\n---------------------------------------------------------------------------------\n\nFirst of all, read [arXiv 1312.5199](http://arxiv.org/abs/1312.5199), and make sure you have a basic understanding on the purpose of the code, and the various observables. Then open Examples/BasicTutorial.nb, which shows how to carry out the basic numerical computations.\n\nComputing thermodynamics\n------------------------\n\nIn order to compute full thermodynamics in this model, you need to scan over the boundary parameters &lambda;<sub>h</sub> and &ntilde;. This is handled, including automatic parallelization, file saving, finding the correct region in the parameter space (for some potentials), bookkeeping and so on, by the functions in VQCDThermo.m. See ThermoComputationTutorial.nb and ThermoAnalysisTutorial.nb in the Examples directory.\n\nThe computations in [arXiv 1312.5199](http://arxiv.org/abs/1312.5199) were done using a less automated (i.e. requiring manual parameter setup and manual parallelization) and more complicated predecessor to this code (the parts in VQCDCore.m are pretty much unchanged), and a somewhat laborious semi-manual analysis stage. Once we finish the automatic code, it will be released here.\n\nGetting help\n------------\n\nYou can always contact me by e-mail, and I'll do my best to help you out with any problems concerning the code. If your problem is clearly a bug in the code, you can also just leave an issue in https://github.com/timoalho/VQCDThermo/issues.\n\nTODO:\n=====\n\n- [x]   Finish the automated thermo and analysis code\n- [ ]   Write better documentation\n- [ ]   Include initial conditions in the core solvers to also construct the vacuum solutions\n- [ ]   Set up a method in the core solvers to allow this code to be used for IHQCD calculations also (they are a special case of calculations in VQCD anyway).\n", 
  "id": 15136996
}