{
  "read_at": 1462551461, 
  "description": "Gaussian Process State-Space Models", 
  "README.md": "GP-SSM\n======\n\nGaussian Process State-Space Models\n\n\nIntroduction\n-----\n\nThis Matlab toolbox implements algorithms to learn (i.e. identify) state-space models of nonlinear dynamical systems based on Gaussian processes. There are a few advantages of the proposed approaches:\n\n* No parametric form of the system dynamics needs to be given by the user. Assumptions about the kind of smoothness of the dynamics function are introduced via the choice of the covariance function (see chapter 4 in Rasmussen and Williams, Gaussian Processes for Machine Learning, 2006).\n\n* Model complexity and fit is traded off automatically.\n\n* Error bars on model predictions capture uncertainty due to scarce or ambiguous data.\n\nIn particular, this toolbox implements the algorithms of the two following papers:\n\n[1] R. Frigola, F. Lindsten, T. B. Schon and C. E. Rasmussen. Bayesian Inference and Learning in Gaussian Process State-Space Models with Particle MCMC, in Neural Information Processing Systems (NIPS), 2013.\nhttp://media.nips.cc/nipsbooks/nipspapers/paper_files/nips26/1449.pdf\n\n[2] R. Frigola, F. Lindsten, T. B. Schon and C. E. Rasmussen. Identification of Gaussian Process State-Space Models with Particle Stochastic Approximation EM, 2013, submitted. http://arxiv.org/pdf/1312.4852\n\n\nFirst Steps\n-----\n\n**IMPORTANT:**  The GP-SSM code requires the Gaussian Process for Machine Learning (GPML) toolbox which is freely available here:\nhttp://www.gaussianprocess.org/gpml/code\n\n1. You need to run two different startup.m files, first the one for the GPML toolbox and then the one in this toolbox (GP-SSM/startup.m).\n\n2. Create a problem definition file. As an example, see GP-SSM/OneDimNonlinear/onedimnonlinearset.m which defines the problem of learning the 1-dimensional nonlinear system used in references [1] and [2].\n\n3. Call learngpssm.m with the training data and the S structure containing the problem definition generated in the previous step.\n\n\nContributing\n-----\nPlease feel free to fork this repo and modify it and improve it in any way that suits you. This version of the code emphasises modularity and clarity and can deal with multidimensional states. However, some features are not yet implemented, e.g.\n\n* Sequential factorisation of the covariance matrices.\n* Efficient use of sparse covariance functions, e.g. FIC.\n\n", 
  "id": 15333479
}