{
  "id": 15333297, 
  "read_at": 1462551445, 
  "README.rst": "diffpy.srxplanar\n========================================================================\n\ndiffpy.srxplanar package provides 2D diffraction image integration using\nnon splitting pixel algorithm. And it can estimate and propagate statistic\nuncertainty of raw counts and integrated intensity. If you are using this \nsoftware. If you use this program to do productive scientific research that \nleads to publication, we kindly ask that you acknowledge use of the program \nby citing the following paper in your publication:\n\n    Xiaohao Yang, Pavol Juhas, Simon J. L. Billinge, On the estimation of \n    statistical uncertainties on powder diffraction and small angle \n    scattering data from 2-D x-ray detectors, arXiv:1309.3614 \n\nTo learn more about diffpy.srxplanar library, see the examples directory\nincluded in this distribution or the API documentation at\n\nhttp://diffpy.github.io/diffpy.srxplanar/\n\nREQUIREMENTS\n------------------------------------------------------------------------\n\nThe diffpy.srxplanar requires Python 2.6 or 2.7 and the following software:\n\n* `setuptools`  >=0.61(https://pypi.python.org/pypi/setuptools)\n* `numpy`       >=1.60(http://www.numpy.org/)\n* `scipy`       >=1.10(www.scipy.org/)\n* `FabIO`       >=0.80(http://sourceforge.net/projects/fable/files/fabio/)\n\nIf your python version < 2.7 (these two packages are included in 2.7 but not in 2.6)\n    \n* `ordereddict` https://pypi.python.org/pypi/ordereddict\n* `argparse`    https://pypi.python.org/pypi/argparse\n\nOn Ubuntu Linux the part of required software can be easily installed using\nthe system package manager::\n\n    sudo aptitude install \\\n        python-setuptools python-numpy python-scipy\n        \nFor Mac OS X machine with the MacPorts package manager one could do::\n\n    sudo port install \\\n        python27 py27-setuptools py27-numpy py27-scipy\n\nWhen installing with MacPorts, make sure the MacPorts bin directory is the\nfirst in the system PATH and that python27 is selected as the default\nPython version in MacPorts::\n\n    sudo port select --set python python27\n    \nFor other Linux distributions use their respective package manager; note\nthe packages may have slightly different names. diffpy.srxplanar should work\non other Unix-like operating systems as well.  Please, search the\nweb for instructions how to install external dependencies on your particular\nsystem.\n\nFor other packages, please go to the webpage list above to download and install. \n\n\nINSTALLATION\n------------------------------------------------------------------------\n\nTo install the diffpy.srxplanar package::\n\n    python setup.py install\n\nBy default the files are installed in the system directories, which are\nusually only writeable by the root.  See the usage info \n\"./setup.py install --help\" for options to install as a normal user under\ndifferent location.  Note that installation to non-standard directories may\nrequire adjustments to the PATH and PYTHONPATH environment variables.\n\nDEVELOPMENT\n------------------------------------------------------------------------\n\ndiffpy.srxplanar is an open-source software developed at the Columbia University\nThe diffpy.srxplanar sources are hosted at\n\nhttps://github.com/diffpy/diffpy.srxplanar\n\nFeel free to fork the project and contribute.  To install diffpy.srxplanar\nin a development mode, where the sources are directly used by Python\nrather than copied to a system directory, use::\n\n    python setup.py develop --user\n\nCONTACTS\n------------------------------------------------------------------------\n\nFor more information on diffpy.srxplanar please visit the project web-page:\n\nhttp://www.diffpy.org/\n\nor email Prof. Simon Billinge at sb2896@columbia.edu\n\n\n", 
  "description": "2D integration software using pixel non-splitting algorithm"
}