{
  "read_at": 1462510897, 
  "description": "Dichotic Harmony Accords Generator program and other data", 
  "README.txt": "Dichotic Harmony Project. Proekt \"Dikhoticheskaia Garmoniia\".\n\n** Vvedenie.\n\nDichotic Harmony Project posviashchion sozdaniiu teoreticheskoi bazy i programmnogo\nobespecheniia dlia porozhdeniia muzykal'nykh proizvedenii novogo tipa, ispol'zuiushchikh\nmetod dikhoticheskogo slushaniia kak osnovopolagaiushchii printsip v sovremennom iskusstve\nkompozitsii i aranzhirovki, v tom chisle, i preimushchestvenno klassicheskikh muzykal'nykh\nproizvedenii.\n\nKak izvestno, pri razvedenii dvukh garmonicheskikh zvukov po odnomu v kazhdoe ukho\n(\"dikhoticheskoe slushanie\") proiskhodit umen'shenie dissonantnosti sozvuchiia.\n\nDissonantnost' mnogogolosnykh akkordov mozhno umen'shit' tochno takim zhe obrazom,\nnapravliaia chast' golosov v odno ukho, a ostal'nuiu chast' - v drugoe.\nPri etom \"emotsional'noe vzaimodeistvie\" razvedionnykh po raznym usham golosov v\nznachitel'noi stepeni sokhraniaetsia.\n\nEto pozvoliaet nadeiat'sia, chto blagodaria dikhoticheskomu slushaniiu mozhno uvelichit'\n\"blagozvuchnost'\" muzykal'nykh proizvedenii s ves'ma slozhnoi garmoniei.\n\n** Ustanovka i rabota.\n\nDlia ustanovki proekta na PK s OS Windows zapustite fail 2h_setup.exe iz direktorii\nsetup.\nPodrobnoe opisanie proekta nakhoditsia v faile help.txt v direktorii bin.\nVse programmy skompilirovany dlia operatsionnoi sistemy win32.\nIskhodnyi kod testirovalsia na kompiliatorakh MSVC 7 i GCC 4.5.2 (MinGW versiia).\n\nDostup ko vsem direktoriiam proekta osushchestvliaetsia cherez iarlyk na rabochem stole\n\"Dichotic Harmony Project\".\n\n** Sostav proekta, v poriadke imion (sub)direktorii:\n\n* addons\n  .exe ustanovshchik programmy Dichotic Harmony Keyboard\n  dokumentatsiia (fail readme.txt)\n\n* arxiv\n  .pdf stat'i avtora v arkhive nauchnykh statei arXiv.org\n\n* bin   \n  .exe programma Dichotic Harmony Accords Generator (DHAG)\n  dokumentatsiia (help.txt)\n\n* bin\\accords\n  dikhoticheskie demonstatsionnye faily v formate daccords\n\n* midi\n  dikhoticheskie demonstatsionnye faily v formate midi\n  dokumentatsiia (readme.txt)\n\n* setup\n  .exe ustanovshchik proekta Dichotic Harmony Project\n  .iss instruktsii dlia sozdaniia proekta v Inno Setup\n\n* src\n  iskhodnye teksty programmy DHAG na iazyke C++\n\n* utils\n  .exe programma Dichotic Harmony Files Converter (DHFC)\n  dokumentatsiia (readme.txt)\n\n** Litsenziia.\n\nAvtor: Vadim Madgazin, Zelenograd, Rossiia. mailto: vadim@vmgames.com\n\nMaterialy proekta mozhno svobodno ispol'zovat' dlia oznakomitel'nykh i uchebnykh tselei.\nLiuboe drugoe primenenie etikh materialov trebuet otdel'nogo razresheniia avtora.\nCopyright (c) 2010 Vadim Madgazin. All Rights reserved Worldwide.\n\n** Domashniaia stranitsa proekta:\n\nna saite avtora   http://vmgames.com/ru/music/\nv Git repozitorii http://github.com/vadimrm/Dichotic-Harmony-Project\n\nData poslednego obnovleniia proekta: 27 sentiabria 2011 g.\n", 
  "id": 1540352
}