{
  "read_at": 1462547002, 
  "description": "An Alfred workflow for searching papers on INSPIRE", 
  "README.md": "ainspire\n========\n\n`ainspire` is an [Alfred 2](http://www.alfredapp.com) workflow for searching papers on [INSPIRE](http://inspirehep.net/).\nIt can do the following:\n\n  * Searching all of INSPIRE from within Alfred.\n  * Open the INSPIRE record page of a paper.\n  * Search for more publications of a paper author.\n  * Download and open the arXiv PDF of a paper.\n  * Open the DOI referral of a paper.\n  * Lookup references of a paper.\n  * Lookup citations of a paper.\n  * Copy the paper's BibTeX to the clipboard.\n  * Search locally stored papers\n\n\nInstallation\n------------\n\nDownload the [latest release](https://github.com/teake/ainspire/releases)\nand open it (from the Finder or from Alfred) to import it in Alfred.\n\nUsage\n-----\n\n### Searching INSPIRE ###\n\nYou can search INSPIRE by typing `insp {query}` in Alfred's main input. `insp` is the default keyword,\nwhich can be changed editing the workflow via Aflred's prefences. For instance,\n\n![incomplete query](https://raw.github.com/teake/ainspire/master/screenshots/incomplete_query.png)\n\nwill search for all papers that match `witten`. In order to perform the actual\nsearch, you will need to hit enter after typing a search query. Beforing hitting\nenter, `ainspire` will show you list of previous searches that match the\ncurrent one.\n\nAfter pressing enter, Alfred will display the INSPIRE search results:\n\n![example search](https://raw.github.com/teake/ainspire/master/screenshots/complete_query.png)\n\nThe loading of results may a couple of seconds or more, depending on the current traffic on INSPIRE.\nEach paper in the search results is formatted as follows:\n\n    Title of paper\n    (Eprint or Year) Authors (Journal)\n\nAfter selecting a paper from the results and pressing enter, a menu for that paper appears:\n\n![paper menu](https://raw.github.com/teake/ainspire/master/screenshots/paper_menu.png)\n\nFrom this menu, it is possible to do further searches (e.g. for more papers of the authors\nor for citations of the paper), to go various websites (e.g. the INSPIRE record page\nor the DOI referral page), or to copy the BibTeX of the paper to the clipboard.\n\nIf the paper has more than one author, selecting the `Find more papers of authors` item\nwill display another menu, from which it is possible search for papers from one of the authors.\n\nSelecting the arXiv e-print will download it to a local folder (which can be set\nin `ainspire`'s settings) and open it.\n\n### Settings ###\n\nBy only entering the `ainspire` keyword (which is `insp` by default), it is possible\nto go to `ainspire`'s settings:\n\n![no query](https://raw.github.com/teake/ainspire/master/screenshots/no_query.png)\n\nThere, the following can be changed:\n\n  * The cache can be cleared, which erased all stored previous searches.\n  * The cache timeout (in days) can be adjusted, which affects how long searches are cached.\n  * The local directory where PDFs from the arXiv can be set. It defaults to `~/Papers`.\n\n### Local search ###\n\nNot only does the local directory contain the PDFs downloaded from the arXiv, it can\nalso be searched for PDFs with the `paper` keyword:\n\n![local search](https://raw.github.com/teake/ainspire/master/screenshots/local_search.png)\n\nBesides returning PDFs that match the search query, the local search also offers a fallback\nINSPIRE search for the same query, in case the locally stored PDFs are not what you're looking\nfor.\n\n\nLimitations\n-----------\n\n`ainspire` only loads up to 100 results per search. Also, when looking up citations or references\nof a paper, `ainspire` only shows those papers that have records in INSPIRE. Thus citations to\nwebsites and such will not be included in the list of citations.\nFurthermore, the BibTeX that can be copied to the clipboard is not the exact same BibTeX as\nobtained directly from the INSPIRE website, but is equivalent to it.\n\nDependencies\n------------\n\n`ainspire` needs the following Python libraries:\n\n  * alp (https://github.com/phyllisstein/alp)\n    for communicating with Alfred \n  * pyinspire (https://bitbucket.org/ihuston/pyinspire/)\n    for performing searches on INSPIRE\n  * bs4 (http://www.crummy.com/software/BeautifulSoup/)\n    because pyinspire needs it\n  * bibtexparser (https://pypi.python.org/pypi/bibtexparser)\n    for parsing BibTeX\n\n\nIf you check out the source from Git, you need to include these libaries in the `ainspire`\ndirectory root in order obtain a working Alfred workflow. When you download the workflow from\nthe [releases page](https://github.com/teake/ainspire/releases), this is not necessary.\n\nLicense\n-------\n\n[WTFPL](http://www.wtfpl.net/about/), of course.\n", 
  "id": 15584941
}