{
  "read_at": 1462547043, 
  "description": "code for simulating massively parallel sequencing data", 
  "README.md": "INTRODUCTION\n-------\n\nmps-sim is a repository for code used to simulate massively parallel sequencing data. \n\nLicense\n-------\n\nThe code within this repository is available under a 3-clause BSD license. See the License.txt file \nfor more information.\n\nCitation\n--------\n\nIf you use this documentation or the mps-sim software for your own research, please cite:\n\nHarvey, M. G., B. T. Smith, T. C. Glenn, B. C. Faircloth, and R. T. Brumfield. 2013. Sequence capture versus restriction site associated DNA sequencing for phylogeography. arXiv:1312.6439.\n\nPlease also provide the link to this software repository in your manuscript:\n\n    https://github.com/mgharvey/mps-sim\n\nDependencies\n--------\n\nThis list may be incomplete.\n\n- [ms (Hudson 2002)](http://home.uchicago.edu/~rhudson1/source/mksamples.html)\n- [seq-gen (Rambaut and Grass 1997)](http://tree.bio.ed.ac.uk/software/seqgen/)\n- [BioPython (Cock et al. 2009)](http://biopython.org/wiki/Main_Page)\n\nMake sure ms and seq-gen are in $PATH. \n\nUsage\n--------\n\nThis repository contains two scripts: sim_uce_seqs.py simulates data resembling sequences from \nsequence capture of genomic ultraconserved elements (e.g., Faircloth et al. 2012), and \nsim_gbs_snps.py simulates data resembling genotypes from genotyping by sequencing (e.g., Hohenlohe \net al. 2010, Elshire et al. 2011). Both take the same arguments. To run the scripts, at the command \nprompt type:\n\n```\npython sim_uce_seqs.py config_file.txt\n```\n\nor\n\n```\npython sim_gbs_snps.py config_file.txt\n```\n\nafter replacing config_file.txt with the name of your configuration file. The configuration file\ncontains user-provided information about how to simulate data and which output files to generate. \nThe following pieces of information should be provided (see Config_file_example.txt for format):\n\n- number of datasets \n\n- number of loci per dataset\n\n- length of loci \n\n- per-site theta value for seq-gen\n-- *This scales trees before simulating sequence data. See the seq-gen manual for details.*\n\n- is an outgroup being included (see \"ms command string\" below for details)? \n\n- maximum number of SNPs/locus (sim_gbs_snps.py only)\n-- *Most pipelines for GBS data set a maximum number of SNPs. Loci above this threshold are removed \nbecause they are more likely to contain paralogous sequences.*\n\n- ms command string \n-- *The number of loci in the command must be 1. If you would like to include outgroup information (e.g. \nfor rooting trees or polarizing SNPs in the AFS), make sure the LAST POPULATION in the ms command \ncomprises two haplotypes and diverges first (ie. coalesces last). If you would like to generate \nunphased diploid input files for G-PhoCS, all populations must have an even number of samples equal \nto 2x the desired number of diploid individuals.*\n\n- the output directory\n\n- if you would like to output the following files (default is \"Yes\" for all):\n\t- a file with summary statistics\n\t- separate Nexus alignments of sequences \n\t- a Nexus alignment of all SNPs concatenated \n\t- a Nexus alignment of one random SNP from each locus concatenated\n\t- a hapmap genotype file (includes 1 random SNP/locus)\n\t- input files for dadi (Gutenkunst et al. 2009; includes 1 random SNP/locus)\n\t- input files for G-PhoCS (Gronau et al. 2011)\n", 
  "id": 15685594
}