{
  "read_at": 1462547028, 
  "description": "Collection of methods and tools for using PSRs to model dynamical systems.", 
  "README.md": "#PSRToolbox\n\nAuthor: William L Hamilton, (previously of McGill University, Reasoning and Learning Lab, currently Stanford University)\nContact: wleif@stanford.edu\n\nNOTE: I am not longer actively maintaining this repo, but I welcome inquires from people interested in working with the code. \n\n# Description\n\nCollection of methods and tools for using PSRs to model dynamical systems and to construct model-based reinforcement learning algorithms. \nThe PSR code optionally uses randomized compression techniques to increase performance (so called \"Compressed Predictive State Representations\"). \nFor details refer to the paper \"Efficient Learning and Planning with Compressed Predictive States\" at arXiv:1312.0286 [cs.LG].\nThe provided Java documentation should also be of aid. \n\nNOTE: Currently I am shifting most of my code to other languages (e.g., C++ for speed, Python for usability).\nThus I will not be regularly committing to this repo. If you have specific questions, please email me. \n\nDISCLAIMER: The code is a both fully functional and a work in progress (as is most research code). As such, I cannot guarantee particular functionality.\nMoreover, the code is not intended for commerical use. Also, it is not intended as an out-of-the-box package and users will likely need to write code to create their required functionality. The code is, in essence, a large library of methods and classes. \n\n## Using the code\n\nBefore running anything the libraries in the lib directory must be added to the Java classpath.\n\nThe PSRToolbox contains a large set of related Java classes for using PSR-based models for prediction or creating reinforcement learning agents.\nThere are many possible use scenarios and the code is not intended as an out-of-the-box package.\nThus, no simple concrete steps for use can be provided; a general overview of the code structure in the context of a (somewhat) typical use case is provided below.\n\nFor reinforcement learning applications, one would make use of the PSRPlanningExperiment class.\nThis class contains high level methods that connect a PSR model, to a simulator.\n\nThe planning aspects of the code are contained within the \"planning\" java package.\nThis code using a version of fittedQ, which in turn uses random forests.\n\nThe PSR models are contained within the model section.\nThe different models all offer different tradeoffs.\nTPSR is the a standard PSR model, CPSR uses random projections for compression, etc.\n\nI encourage potential users to contact me directly with specific use cases (as the code-base is quite large), or to refer to the paper cited above.\n\n## Acknowledgements\n\nMuch thanks to Guillame Saulnier for providing his Java random forests code.\n", 
  "id": 15739732
}