{
  "read_at": 1462547007, 
  "description": "Sort and Smooth Algorithm for Graphon Estimation (Matlab)", 
  "Readme.txt": "================================================\nSort and Smooth (SAS) Algorithm for Consistent Graphon Estimation\n\n\n================================================\nThis MATLAB package is a supplement to the paper \n\nS. H. Chan and E. M. Airoldi, \"A Consistent Histogram Estimator for Exchangeable Graph Models\", in Proceedings of International Conference on Machine Learning, 2014.\n\n\n================================================\nContent:\n\n1. Construct Graphs from a Graphon\n\tMethod 1: [G P u] = construct_a_graph(w,n,T)\n\t\tInput:  w - a Graphon \n\t\t\tn - number of nodes\n\t\t\tT - number of observations\n\t\tOutput: G - graph (size nxnxT)\n\t\t\tP - probability of each node\n\t\t\tu - label indices\n\n\tMethod 2: G = construct_a_graph_from_P(P,n,T)\n\t\tInput:  P - probability of each node\n\t\t\tn - number of nodes\n\t\t\tT - number of observations\n\t\tOutput: G - graph (size nxnxT)\n\n2. Sorting and Smoothing (sort_and_smooth.m)\n\tInput:  G    - a graph\n\tOutput: west - estimated graphon\n\t\n\tAlgorithm dependency: ./deconvtv_v1/\n\n\n3. Results reported in the paper\n\tFigure1.m - plot a twin graphon\n\tFigure2.m - display an example of the SAS algorithm\n\tFigure3.m - results of SAS, USVT and SBA for graphons no. 5 and no. 10\n\tFigure4.m - runtime plot\n\tFigure5.m - graphon estimation of soc-Epinion1 and ca-astroph network\n\tTable2.m  - mean squared error (average and standard deviation) of SAS, USVT and SBA.\n\n4. Compared Methods\n\t(i)   stochastic_block.m (Stochastic Blockmodel Approximation, Airoldi et al. 2013)\n\t(ii)  usvt.m             (Universal Singular Value Thresholding, Chatterjee 2012)\n\n\n\t\nReferences\n[1] E. M. Airoldi, T. B. Costa, and S. H. Chan, \"Stochastic blockmodel approximation of a graphon: Theory and consistent estimation\", Advances in Neural Information Processing Systems. ArXiv: 1311.1731. 2013.\n\n[2] S. Chatterjee. Matrix estimation by universal singular value thresholding. ArXiv:1212.1247. 2012.\n\n\n================================================\nCOPYRIGHT (C) 2014 Stanley Chan and Edoardo Airoldi\n\nThis program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\n\n\n\n================================================\nPlease report bugs to Stanley Chan schan@seas.harvard.edu\n\nLast update: January 10, 2014\n", 
  "id": 15808978
}