{
  "readme.markdown_strict": "# $title$\n\n$author$\n\n# Abstract\n\n$abstract$\n\n$body$\n", 
  "read_at": 1462547048, 
  "description": "Organellar Genomes of White Spruce (Picea glauca)", 
  "README.md": "# Organellar Genomes of White Spruce (*Picea glauca*): Assembly and Annotation\n\nShaun D Jackman, Rene Warren, Ewan Gibb, Ben Vandervalk, Hamid Mohamadi, Justin\nChu, Anthony Raymond, Stephen Pleasance, Robin Coope, Mark R Wildung, Carol\nRitland, Steven JM Jones, Joerg C Bohlmann, Inanc Birol\n\n# Abstract\n\nThe genome sequences of the plastid and mitochondrion of white spruce (*Picea\nglauca*) are assembled from whole genome Illumina sequencing data using ABySS.\nWhole genome sequencing data contains reads from both the nuclear and organellar\ngenomes. Reads of the organellar genomes are abundant, because each cell\ncontains hundreds of mitochondria and plastids. One lane of MiSeq data assembles\nthe 123 kbp plastid genome, and one lane of HiSeq data assembles the 5.9 Mbp\ndraft mitochondrial genome. The coding genes, ribosomal RNA and transfer RNA of\nboth genomes are annotated. The transcript abundance of the mitochondrial genes\nis quantified in three developmental tissues and five mature tissues. C-to-U RNA\nediting is observed in the majority of mitochondrial genes and modifies ACG\ncodons to create cryptic AUG start codons in four genes. NCBI GenBank contains a\nsingle mitochondrial genome of a gymnosperm, and this work contributes the first\nconiferous mitochondrial genome.\n\nIntroduction\n============\n\nMost plant cells contain two types of organelles that harbour their own genomes,\nmitochondria and plastids. In the *Pinaceae*, mitochondrial genomes are\ninherited maternally, and plastid genomes are inherited paternally (Whittle &\nJohnston 2002).\n\nComplete plastid genomes of the gymnosperms Norway spruce (*Picea abies*)\n(Nystedt et al. 2013), *Podocarpus lambertii* (Nascimento Vieira, Faoro,\nRogalski, et al. 2014), *Taxus chinensis* var. *mairei* (Zhang et al. 2014) and\nfour *Juniperus* species (Guo et al. 2014) have recently been published in NCBI\nGenbank (Benson et al. 2014). These projects used a variety of strategies for\nisolating cpDNA, using physical separation methods in the lab or computationally\nseparating cpDNA sequences from nuclear sequences, sequencing and assembly,\nshown in Table 1.\n\nThe *Picea abies* genome used 454 GS FLX Titanium sequencing and Sanger\nsequencing of PCR amplicons for finishing, BLAST (Altschul et al. 1990) to\nisolate the cpDNA reads, and the software Newbler to assemble the reads. The *P.\nlambertii* genome assembly isolated the cpDNA using the saline Percoll gradient\nprotocol of Nascimento Vieira, Faoro, Freitas Fraga, et al. (2014), Illumina\nMiSeq sequencing and the software Newbler to assemble the reads. The *Juniperus\nbermudiana* genome assembly used long-range PCR to amplify the plastid DNA, a\ncombination of Illumina GAII and Sanger sequencing, and the software Geneious to\nassemble the reads using *C. japonica* as a reference genome. The other three\n*Juniperus* genome assemblies used Illumina MiSeq sequencing and the software\nVelvet (Zerbino & Birney 2008) to assemble the reads. The *T. chinensis* genome\nassembly used whole-genome Illumina HiSeq 2000 sequencing, BLAT (Kent 2002) to\nisolate the cpDNA reads and SOAPdenovo (Luo et al. 2012) to assemble the\nisolated cpDNA reads. All of these projects used DOGMA (Wyman et al. 2004) to\nannotate the assembly.\n\n<table>\n<caption>Table 1: Methods of cpDNA separation, sequencing and assembly of complete plastid genomes of gymnosperms published. <sup>a</sup> Finished with PCR and Sanger sequencing</caption>\n<thead>\n<tr class=\"header\">\n<th align=\"left\">Species</th>\n<th align=\"left\">cpDNA Separation</th>\n<th align=\"left\">Sequencing</th>\n<th align=\"left\">Assembler software</th>\n</tr>\n</thead>\n<tbody>\n<tr class=\"odd\">\n<td align=\"left\"><em>Picea abies</em></td>\n<td align=\"left\">BLAST <em>in silico</em></td>\n<td align=\"left\">454 GS FLX Titanium <sup>a</sup></td>\n<td align=\"left\">Newbler</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\"><em>Podocarpus lambertii</em></td>\n<td align=\"left\">Saline Percoll gradient</td>\n<td align=\"left\">Illumina MiSeq</td>\n<td align=\"left\">Newbler</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\"><em>Juniperus bermudiana</em></td>\n<td align=\"left\">Longer-range PCR</td>\n<td align=\"left\">Illumina GAII <sup>a</sup></td>\n<td align=\"left\">Geneious</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\">Other <em>Juniperus</em></td>\n<td align=\"left\">Unspecified</td>\n<td align=\"left\">Illumina MiSeq</td>\n<td align=\"left\">Velvet</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\"><em>Taxus chinensis</em></td>\n<td align=\"left\">BLAT <em>in silico</em></td>\n<td align=\"left\">Illumina HiSeq 2000</td>\n<td align=\"left\">SOAPdenovo</td>\n</tr>\n</tbody>\n</table>\n\nOnly one complete mitochondrial genome of a gymnosperm has been published,\n*Cycas taitungensis* (Chaw et al. 2008), while complete mitochondrial genome\nsequences of the angiosperms *Brassica maritima* (Grewe et al. 2014), *Brassica\noleracea* (*ibid.*), *Capsicum annuum* (Jo et al. 2014), *Eruca sativa* (Wang et\nal. 2014), *Helianthus tuberosus* (Bock et al. 2014), *Raphanus sativus* (Jeong\net al. 2014), *Rhazya stricta* (Park et al. 2014) and *Vaccinium macrocarpon*\n(Fajardo et al. 2014) have been published in NCBI Genbank. Six of these projects\ngave details of the sample preparation, sequencing, assembly and annotation\nstrategy. Three projects enriched organellar DNA using varying laboratory\nmethods (Keren et al. 2009; Kim et al. 2007; Chen et al. 2011), and the\nremainder used total genomic DNA. Three projects used Illumina HiSeq 2000\nsequencing and Velvet for assembly, and three projects used Roche 454 GS-FLX\nsequencing and Newbler for assembly. Most projects used an aligner such as BLAST\n(Altschul et al. 1990) to isolate sequences with similarity to known\nmitochondrial sequence, either before or after assembly. Two projects used\nMitofy (Alverson et al. 2010) to annotate the genome, and the remainder used a\ncollection of tools such as BLAST, tRNAscan-SE (Lowe & Eddy 1997) and ORF Finder\nto annotate genes. Plant mitochondrial genomes can substantially vary in size,\nwith some of the largest mitochondrial genomes reported for the basal angiosperm\n*Amborella trichopoda* (3.9 Mbp; Rice et al. 2013) and the two Silene species\n*S. noctiflora* and *S. conica* (6.7 Mbp and 11.3 Mbp, respectively; Sloan et\nal. 2012).\n\nThe SMarTForests project has recently published a set of stepwise improved\nassemblies of the 20 gigabase white spruce (*Picea glauca*) genome (Birol et al.\n2013; Warren, Keeling, et al. 2015), a gymnosperm genome seven times the size of\nthe human genome, sequenced using the Illumina HiSeq and MiSeq sequencing\nplatforms. The whole genome sequencing data contained reads originating from\nboth the nuclear and organellar genomes. Whereas one copy of the diploid nuclear\ngenome is found in each cell, hundreds of organelles are present, and thus\nhundreds of copies of the organellar genomes. This abundance results in an\noverrepresentation of the organellar genomes in whole genome sequencing data.\n\nAssembling a single lane of white spruce whole genome sequencing data using the\nsoftware ABySS (Simpson et al. 2009) yielded an assembly composed of organellar\nsequences and nuclear repeat elements. The assembled sequences that originate\nfrom the organellar genomes were separated from those of nuclear origin by\nclassifying the sequences using their length, depth of coverage and GC content.\nThe plastid genome of white spruce is compared to that of Norway spruce (*Picea\nabies*) (Nystedt et al. 2013), and the mitochondrial genome of white spruce is\ncompared to that of prince sago palm (*Cycas taitungensis*) (Chaw et al. 2008).\n\nAnalysis of cpDNA is useful in reconstructing phylogenies of plants (Wu et al.\n2007), in determining the origin of an expanding population (Aizawa et al. 2012)\nand in determining when distinct lineages of a species resulted from multiple\ncolonization events (Jardon-Barbolla et al. 2011). These contrasting inheritance\nschemes of plastids and mitochondria can be useful in the characterization of\nspecies expanding their range. In the case of two previously allopatric species\nnow found in sympatry, the mitochondrial DNA (mtDNA) is contributed by the\nresident species, whereas introgression of the plastid genome into the expanding\nspecies is limited, since pollen is more readily dispersed than seeds (Du et al.\n2011). Differential gene flow of cpDNA and mtDNA due to different methods of\ninheritance and dispersion results in new assemblages of organellar genomes and\nan increase of genetic diversity after expansion from a refugium (Gerardi et al.\n2010).\n\nMaterial and Methods\n====================\n\nDNA, RNA and software materials\n-------------------------------\n\nGenomic DNA was collected from the apical shoot tissues of a single interior\nwhite spruce tree, clone PG29, and sequencing libraries constructed as described\nin Birol et al. (2013). Because the original intention of this sequencing\nproject was to assemble the nuclear genome, an organelle exclusion method was\nused to preferentially extract nuclear DNA. Sequencing reads from both\norganellar genomes were present in sufficient depth however to assemble their\ngenomes.\n\nRNA was extracted from eight samples, three developmental stages and five mature\ntissues: megagametophyte, embryo, seedling, young buds, xylem, mature needles,\nflushing buds and bark, described in Warren, Keeling, et al. (2015). These\nsamples were sequenced with the Illumina HiSeq 2000 (Warren, Keeling, et al.\n2015). The RNA-seq data was used to quantify the transcript abundance of the\nannotated mitochondrial genes using the software Salmon (Patro et al. 2014).\n\nThe software used in this analysis and their versions are listed in\nsupplementary Table S1. All software tools were installed using Homebrew\n(<http://brew.sh>).\n\nMethods used to assemble the plastid genome\n-------------------------------------------\n\nA single lane of Illumina MiSeq paired-end sequencing (SRR525215) was used to\nassemble the plastid genome. Paired-end sequencing usually leaves a gap of\nunsequenced nucleotides in the middle of the DNA fragment. Because 300 bp\npaired-end reads were sequenced from a library of 500 bp DNA fragments, the\nreads are expected to overlap by 100 bp. These overlapping paired-end reads were\nmerged using ABySS-mergepairs, a component of the software ABySS (Simpson et al.\n2009). These merged reads were assembled using ABySS. Contigs that are\nputatively derived from the plastid were separated by length and depth of\ncoverage using thresholds chosen by inspection of a scatter plot (see\nsupplementary Figure S1). These putative plastid contigs were assembled into\nscaffolds using ABySS-scaffold.\n\nWe ran the gap-filling application Sealer (Paulino et al., in review; options\n`-v -j 12 -b 30G -B 300 -F 700` with `-k` from 18 to 108 with step size 6) on\nthe ABySS assembly of the plastid genome, closing 5 of the remaining 7 gaps,\nwith a resulting assembly consisting of two large (~50 and ~70 kbp) scaftigs.\nGiven the small size of the plastid genome, we opted to manually finish the\nassembly using the software Consed 20.0 (Gordon & Green 2013). We loaded the\nresulting gap-filled assembly into Consed and imported Pacific Biosciences\n(PacBio) sequencing data (SRR2148116 and SRR2148117), 9204 reads 500 bp and\nlarger, into the assembly and aligned them to the plastid genome using\ncross\\_match (Green 1999) from within Consed. For each scaftig end, 6 PacBio\nreads were pulled out and assembled using the mini-assembly feature in Consed.\nCross\\_match alignments of the resulting contigs to the plastid assembly were\nused to merge the two scaftigs and confirm that the complete circular genome\nsequence was obtained. In a subsequent step, 7,742 Illumina HiSeq reads were\nimported and aligned to the assembly using Consed. These reads were selected\nfrom the library of 133 million reads used to assemble the mitochondrion on the\nbasis of alignment to our draft plastid genome using BWA 0.7.5a (Li 2013),\nfocusing on regions that would benefit from read import by restricting our\nsearch to regions with ambiguity and regions covered by PacBio reads\nexclusively. The subset of Illumina reads were selected using samtools 0.1.18,\nmini-assembled with Phrap (Green 1999) and the resulting contigs re-merged to\ncorrect bases in gaps filled only by PacBio, namely one gap and sequence at\nedges confirming the circular topology. The starting base was chosen using the\nNorway spruce plastid genome sequence (NC\\_021456, Nystedt et al. 2013). Our\nassembly was further polished using the Genome Analysis Toolkit (GATK)\n2.8-1-g932cd3a FastaAlternateReferenceMaker (McKenna et al. 2010).\n\nThe assembled plastid genome was initially annotated using DOGMA (Wyman et al.\n2004). Being an interactive web application, it is not convenient for automated\nannotation. The software MAKER (Campbell et al. 2014) is not interactive and is\ndesigned for automated annotation, and we used it to annotate the white spruce\nplastid using the Norway spruce plastid genome (NC\\_021456, Nystedt et al. 2013)\nfor both protein-coding and non-coding gene homology evidence. The parameters of\nMAKER are show in supplementary Table S2. The inverted repeat was identified\nusing MUMmer (Kurtz et al. 2004), shown in supplementary Figure S3.\n\nThe assembled plastid genome was aligned to the Norway spruce plastid using\nBWA-MEM (Li 2013). The two genomes were compared using QUAST (Gurevich et al.\n2013) to confirm the presence of the annotated genes of the Norway spruce\nplastid in the white spruce plastid.\n\nMethods used to assemble the mitochondrial genome\n-------------------------------------------------\n\nABySS-Konnector (Vandervalk et al. 2014) was used to fill the gap between the\npaired-end reads of a single lane of Illumina HiSeq 2000 paired end-sequencing\n(SRR525196). These connected paired-end reads were assembled using ABySS.\nPutative mitochondrial sequences were separated from nuclear sequences by their\nlength, depth of coverage and GC content using k-means clustering in R (see\nsupplementary Figure S2). The putative mitochondrial contigs were then assembled\ninto scaffolds using ABySS-scaffold with a single lane of Illumina HiSeq\nsequencing of a mate-pair library.\n\nThe ABySS assembly of the white spruce mitochondrial genome resulted in 71\nscaffolds. We ran the gap-filling application Sealer attempting to close the\ngaps between every combination of two scaffolds. This approach closed 10 gaps\nand yielded 61 scaffolds, which we used as input to the LINKS scaffolder 1.1\n(Warren, Vandervalk, et al. 2015) (options `-k 15 -t 1 -l 3 -r 0.4`, 19\niterations with `-d` from 500 to 6000 with step size 250) in conjunction with\nlong PacBio reads, further decreasing the number of scaffolds to 58. The\nKonnector pseudoreads were aligned to the 58 LINKS scaffolds with BWA 0.7.5a\n(`bwa mem -a multimap`), and we created links between two scaffolds when reads\naligned within 1000 bp of the edges of any two scaffolds. We modified LINKS to\nread the resulting SAM alignment file and link scaffolds satisfying this\ncriteria (options `LINKS-sam -e 0.9 -a 0.5`), bringing the final number of\nscaffolds to 38. We confirmed the merges using mate-pair reads. The white spruce\nmate-pair libraries used for confirmation are presented in Birol et al. (2013)\nand available from DNAnexus (SRP014489\n<http://sra.dnanexus.com/studies/SRP014489>). In brief, mate-pair reads from\nthree fragment size libraries (5, 8 and 12 kbp) were aligned to the 38-scaffold\nassembly with BWA-MEM 0.7.10-r789 and the resulting alignments parsed with a\nPERL script. A summary of this validation is presented in supplemental Table S4.\nAutomated gap-closing was performed with Sealer 1.0 (options\n`-j 12 -B 1000 -F 700 -P10 -k96 -k80`) using Bloom filters built from the entire\nwhite spruce PG29 read data set (Warren, Keeling, et al. 2015) and closed 55 of\nthe 182 total gaps (30.2%). We polished the gap-filled assembly using GATK, as\ndescribed for the plastid genome.\n\nThe assembled scaffolds were aligned to the NCBI nucleotide (nt) database using\nBLAST to check for hits to mitochondrial genomes and to screen for\ncontamination.\n\nThe mitochondrial genome was annotated using MAKER (parameters shown in\nsupplementary Table S3) and Prokka (Seemann 2014), and the two sets of\nannotations were merged using BEDTools (Quinlan & Hall 2010) and GenomeTools\n(Gremme et al. 2013), selecting the MAKER annotation when the two tools had\noverlapping annotations. The proteins of all green plants (*Viridiplantae*) with\ncomplete mitochondrial genome sequences in NCBI GenBank (Benson et al. 2014),\n142 species, were used for protein homology evidence, the most closely related\nof which is the prince sago palm (*Cycas taitungensis*) (NC\\_010303 Chaw et al.\n2008), being the only gymnosperm with a complete mitochondrial genome. Transfer\nRNA (tRNA) were annotated using ARAGORN (Laslett & Canback 2004). Ribosomal RNA\n(rRNA) were annotated using RNAmmer (Lagesen et al. 2007). Prokka uses Prodigal\n(Hyatt et al. 2010) to annotate open reading frames. Repeats were identified\nusing RepeatMasker (Smit et al. 1996) and RepeatModeler.\n\nThe RNA-seq reads were aligned to the annotated mitochondrial genes using\nBWA-MEM and variants were called using samtools and bcftools requiring a minimum\ngenotype quality of 50 to identify possible sites of C-to-U RNA editing.\n\nResults\n=======\n\nThe white spruce plastid genome\n-------------------------------\n\nThe assembly and annotation metrics for the plastid and mitochondrial genomes\nare summarized in Table 2. The plastid genome was assembled into a single\ncircular contig of 123,266 bp containing 114 identified genes: 74 protein coding\n(mRNA) genes, 36 transfer RNA (tRNA) genes and 4 ribosomal RNA (rRNA) genes,\nshown in Figure 1.\n\n<table>\n<caption>Table 2: Sequencing, assembly and annotation metrics of the white spruce organellar genomes. The number of distinct genes are shown in parentheses.</caption>\n<thead>\n<tr class=\"header\">\n<th align=\"left\">Metric</th>\n<th align=\"left\">Plastid</th>\n<th align=\"left\">Mitochondrion</th>\n</tr>\n</thead>\n<tbody>\n<tr class=\"odd\">\n<td align=\"left\">Number of lanes</td>\n<td align=\"left\">1 MiSeq lane</td>\n<td align=\"left\">1 HiSeq lane</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\">Number of read pairs</td>\n<td align=\"left\">4.9 million</td>\n<td align=\"left\">133 million</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\">Read length</td>\n<td align=\"left\">300 bp</td>\n<td align=\"left\">150 bp</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\">Number of merged reads</td>\n<td align=\"left\">3.0 million</td>\n<td align=\"left\">1.4 million</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\">Median merged read length</td>\n<td align=\"left\">492 bp</td>\n<td align=\"left\">465 bp</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\">Number of assembled reads</td>\n<td align=\"left\">21 thousand</td>\n<td align=\"left\">377 thousand</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\">Proportion of organellar reads</td>\n<td align=\"left\">1/140 or 0.7%</td>\n<td align=\"left\">1/350 or 0.3%</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\">Depth of coverage</td>\n<td align=\"left\">80x</td>\n<td align=\"left\">30x</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\">Assembled genome size</td>\n<td align=\"left\">123,266 bp</td>\n<td align=\"left\">5.94 Mbp</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\">Number of contigs</td>\n<td align=\"left\">1 contig</td>\n<td align=\"left\">130 contigs</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\">Contig N50</td>\n<td align=\"left\">123 kbp</td>\n<td align=\"left\">102 kbp</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\">Number of scaffolds</td>\n<td align=\"left\">1 scaffold</td>\n<td align=\"left\">36 scaffolds</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\">Scaffold N50</td>\n<td align=\"left\">123 kbp</td>\n<td align=\"left\">369 kbp</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\">Largest scaffold</td>\n<td align=\"left\">123 kbp</td>\n<td align=\"left\">1222 kbp</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\">GC content</td>\n<td align=\"left\">38.8%</td>\n<td align=\"left\">44.7%</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\">Number of genes without ORFs</td>\n<td align=\"left\">114 (108)</td>\n<td align=\"left\">143 (74)</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\">Protein coding genes (mRNA)</td>\n<td align=\"left\">74 (72)</td>\n<td align=\"left\">106 (51)</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\">Ribosomal RNA genes (rRNA)</td>\n<td align=\"left\">4 (4)</td>\n<td align=\"left\">8 (3)</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\">Transfer RNA genes (tRNA)</td>\n<td align=\"left\">36 (32)</td>\n<td align=\"left\">29 (20)</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\">Open reading frames (ORF) <span class=\"math inline\"> >= </span> 300 bp</td>\n<td align=\"left\">NA</td>\n<td align=\"left\">1065</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\">Coding genes containing introns</td>\n<td align=\"left\">8</td>\n<td align=\"left\">5</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\">Introns in coding genes</td>\n<td align=\"left\">9</td>\n<td align=\"left\">7</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\">tRNA genes containing introns</td>\n<td align=\"left\">6</td>\n<td align=\"left\">0</td>\n</tr>\n</tbody>\n</table>\n\nAll protein-coding genes are single copy, except *psbI* and *ycf12*, which have\ntwo copies each. All tRNA genes are single copy, except *trnH-GUG*, *trnI-CAU*,\n*trnS-GCU* and *trnT-GGU*, which have two copies each. All rRNA genes are single\ncopy.\n\nThe protein-coding genes *atpF*, *petB*, *petD*, *rpl2*, *rpl16*, *rpoC1* and\n*rps12* each contain one intron, and *ycf3* contains two introns. The tRNA genes\n*trnA-UGC*, *trnG-GCC*, *trnI-GAU*, *trnK-UUU*, *trnL-UAA* and *trnV-UAC* each\ncontain one intron. Of the 15 introns, 11 are determined to be group II introns\nby RNAweasel (Lang et al. 2007).\n\nThe first and smallest exons of the genes *petB*, *petD* and *rpl16* are 6, 8\nand 9 bp respectively. These genes likely belong to polycistronic transcripts\n(Barkan 1988) of their respective protein complexes, but the short size of their\ninitial exons make them difficult to annotate all the same. The initial exons of\nthese genes were added to their annotations manually.\n\nThe gene *rps12* of a plastid genome is typically trans-spliced (Hildebrand et\nal. 1988), which makes it difficult to annotate using MAKER. It is composed of\nthree exons and one cis-spliced intron. It required manually editing the gene\nannotation to incorporate trans-splicing in the gene model.\n\nEach copy of the inverted repeat (IR) is 445 bp in size, much smaller than most\nplants, but typical of *Pinaceae* (Lin et al. 2010). Unlike most inverted\nrepeats, which are typically identical, the two copies differ by a single base.\nThe IR contains a single gene, the tRNA *trnI-CAU*.\n\nAll 114 genes of the Norway spruce plastid genome (Nystedt et al. 2013) are\npresent in the white spruce plastid genome in perfect synteny. Alignment of the\nwhite spruce genome to the Norway spruce genome using BWA-MEM (Li 2013) reveal\nno large-scale structural rearrangements. Alignments of the white spruce plastid\ngenome cover 99.7% of the Norway spruce plastid genome, and the sequence\nidentity in aligned regions is 99.2%.\n\n![Figure 1: The complete plastid genome of white spruce, annotated using MAKER\nand plotted using OrganellarGenomeDRAW (Lohse et al.\n2007).](figure/plastid-annotation.png)\n\nThe white spruce mitochondrial genome\n-------------------------------------\n\nThe mitochondrial genome was assembled into 38 scaffolds (132 contigs) with a\nscaffold N50 of 369 kbp (contig N50 of 102 kbp). The largest scaffold is 1222\nkbp (Table 2). The scaffolds were aligned to the NCBI nucleotide (nt) database\nusing BLAST. Of the 38 scaffolds, 26 scaffolds align to mitochondrial genomes, 3\nsmall scaffolds (&lt;10 kbp) align to *Picea glauca* mRNA clones and BAC\nsequences, 7 small scaffolds (&lt;10 kbp) had no significant hits, and 2 small\nscaffolds (&lt;5 kbp) align to cloning vectors. These last two scaffolds were\nremoved from the assembly.\n\nThe mitochondrial genome contains 106 protein coding (mRNA) genes, 29 transfer\nRNA (tRNA) genes and 8 ribosomal RNA (rRNA) genes. The 106 protein-coding genes\n(51 distinct genes) compose 75 kbp (1.3%) of the genome. The 29 tRNA genes are\nfound in 20 distinct species for 15 amino acids. The relative order of the genes\non the scaffolds and gene size is shown in Figure 2. The size of each gene\nfamily is shown in Figure 3. The precise position of each gene on its scaffold\nis shown in supplementary Figure S4.\n\nAll tRNA genes are single copy, except *trnD-GUC* which has 3 copies, *trnM-CAU*\nwhich has 7 copies, and *trnY-GUA* which has 2 copies. The rRNA gene *rrn5* has\n4 copies, *rrn18* has 3 copies, and *rrn26* has 1 copy.\n\nA large number of open reading frames are identified: 6265 of at least 90 bp,\ncomposing 1.4 Mbp, and 1065 of at least 300 bp, composing 413 kbp. These open\nreading frames do not have sufficient sequence similarity to the genes of the\n*Viridiplantae* mitochondria used for protein homology evidence to be annotated\nby either MAKER or Prokka.\n\nA total of 7 introns are found in 5 distinct protein-coding genes. The\nprotein-coding genes *nad2*, *nad5*, and *nad7* each contain one intron, and\n*nad4* and *rps3* each contain two introns. All introns are determined to be\ngroup II introns by RNAweasel (Lang et al. 2007).\n\nRepeats compose 390 kbp (6.6%) of the mitochondrial genome. Simple repeats and\nLTR Copia, ERV1 and Gypsy are the most common repeats, shown in Figure 4.\n\nAll 39 protein coding genes and 3 rRNA genes of the *Cycas taitungensis*\nmitochondrion are seen in white spruce. Of the 22 tRNA genes of *Cycas\ntaitungensis*, 13 are found in white spruce, and 8 tRNA genes are seen in white\nspruce that are not seen in *Cycas taitungensis*.\n\n![Figure 2: The relative order of the genes on the scaffolds, and the size of\neach gene. Each box is proportional to the size of the gene including introns,\nexcept that genes smaller than 200 bp are shown as 200 bp. The space between\ngenes is not to scale. An asterisk indicates that the gene name is truncated.\nOnly scaffolds that have annotated genes are shown.](figure/mt-gene-order.png)\n\n![Figure 3: The gene content of the white spruce mitochondrial genome, grouped\nby gene family. Each box is proportional to the size of the gene including\nintrons. The colour of each gene is unique within its gene\nfamily.](figure/mt-genes.png)\n\n![Figure 4: The repetitive sequence content of the white spruce mitochondrial\ngenome, annotated using RepeatMasker and RepeatModeler.](figure/mt-repeats.png)\n\nThe transcriptome of the white spruce mitochondrial genome\n----------------------------------------------------------\n\nThe transcript abundance of the mitochondrial coding genes with known function\nis shown in Figure 5. The transcript abundance of the mitochondrial coding genes\nincluding open read frames is shown in Figure 6. Of the samples analyzed, the\ntranscriptomes of megagametophyte and embryo have the highest abundance of\ncoding mitochondrial genes and cluster together.\n\nOf the 106 coding genes with known function, 60 are expressed in at least one of\nthe mature tissues, 29 are expressed in one of the developing tissues but not in\na mature tissue, and 17 are not found to be expressed. Of the 6265 ORFs at least\n90 bp, 427 (7%) are expressed in at least one of the mature tissues, 2809 (45%)\nare expressed in one of the developing tissues but not in a mature tissue, and\n3029 (48%) are not found to be expressed. A gene with an abundance of at least\nten transcripts per million as quantified by Salmon is considered to be\nexpressed. These results are shown in Table 3.\n\n<table>\n<caption>Table 3: Number of expressed protein-coding genes and open reading frames tabulated by developmental stage.</caption>\n<thead>\n<tr class=\"header\">\n<th align=\"left\"></th>\n<th align=\"right\">Both</th>\n<th align=\"right\">Mature only</th>\n<th align=\"right\">Developing only</th>\n<th align=\"right\">Neither</th>\n<th align=\"right\">Sum</th>\n</tr>\n</thead>\n<tbody>\n<tr class=\"odd\">\n<td align=\"left\">CDS</td>\n<td align=\"right\">60</td>\n<td align=\"right\">0</td>\n<td align=\"right\">29</td>\n<td align=\"right\">17</td>\n<td align=\"right\">106</td>\n</tr>\n<tr class=\"even\">\n<td align=\"left\">ORF</td>\n<td align=\"right\">411</td>\n<td align=\"right\">16</td>\n<td align=\"right\">2809</td>\n<td align=\"right\">3029</td>\n<td align=\"right\">6265</td>\n</tr>\n<tr class=\"odd\">\n<td align=\"left\">Sum</td>\n<td align=\"right\">471</td>\n<td align=\"right\">16</td>\n<td align=\"right\">2838</td>\n<td align=\"right\">3046</td>\n<td align=\"right\">6371</td>\n</tr>\n</tbody>\n</table>\n\nPossible C-to-U RNA editing, positions where the genome sequence shows C but the\nRNA-seq reads shows T, is observed in 68 of 106 coding genes shown in\nsupplementary Table S5, with the most highly edited gene, *nad3*, seeing 9 edits\nper 100 bp. It can be difficult to distinguish RNA editing events from genomic\nSNV and miscalled variants caused by misaligned reads. We note however that 91%\n(1601 of 1751) of the variants called from the RNA-seq data are C-to-T variants\nshown in supplementary Table S6, which indicates that a large fraction of these\nvariants are due to C-to-U RNA editing. C-to-U RNA editing can create new start\nand stop codons, but it is not able to destroy existing start and stop codons.\nEditing of the ACG codon to AUG to create a cryptic start codon is frequently\nseen in organellar genomes (Neckermann et al. 1994). Four genes have cryptic ACG\nstart codons and corroborating C-to-U RNA editing evidence in the RNA-seq data:\n*mttB*, *nad1*, *rps3* and *rps4*.\n\n![Figure 5: A heatmap of the transcript abundance of mitochondrial protein\ncoding genes. Each column is a tissue sample. Each row is a gene. Each cell\nrepresents the transcript abundance of one gene in one sample. The colour scale\nis log<sub>10</sub>(TPM), where TPM is transcripts per million as measured by\nSalmon.](figure/mt-cds-heatmap.png)\n\n![Figure 6: A heatmap of the transcript abundance of mitochondrial protein\ncoding genes, including open reading frames. Each column is a tissue sample.\nEach row is a gene. Each cell represents the transcript abundance of one gene in\none sample. The colour scale is log<sub>10</sub>(TPM), where TPM is transcripts\nper million as measured by Salmon.](figure/mt-cds-orf-heatmap.png)\n\nConclusion\n==========\n\nOne lane of MiSeq sequencing of whole genome DNA is sufficient to assemble the\n123 kbp plastid genome, and one lane of HiSeq sequencing of whole genome DNA is\nsufficient to assemble the 5.9 Mbp mitochondrial genome of white spruce.\nAdditional Illumina and PacBio sequencing is used to improved scaffold\ncontiguity and to close scaffold gaps, after which the plastid genome is\nassembled in a single contig and the largest mitochondrial scaffold is 1.2 Mbp.\n\nThe white spruce plastid genome shows no structural rearrangements when compared\nwith Norway spruce, and all genes of the Norway spruce (*Picea abies*) plastid\nare present in the white spruce plastid. All genes of the prince sago palm\n(*Cycas taitungensis*) mitochondrion are present in the white spruce\nmitochondrion.\n\nThe protein coding gene content of the mitochondrial genome is quite sparse,\nwith 106 protein coding genes in 5.9 Mbp, in comparison to the plastid genome,\nwith 74 protein coding genes in 123 kbp. Nearly 7% of the mitochondrial genome\nis composed of repeats, and roughly 1% is composed of coding genes. A\nsignificant portion, over 90%, of the unusually large size of the white spruce\nmitochondrial genome is yet unexplained.\n\nAcknowledgements\n================\n\nThis work was supported by Genome Canada, Genome British Columbia and Genome\nQuebec as part of the SMarTForests Project (www.smartforests.ca). We thank\nCarson Holt for his help with the MAKER analysis and Martin Krzywinski for his\nhelp with Figure 2.\n\nReferences\n==========\n\nAizawa M, Kim Z-S, Yoshimaru H. 2012. Phylogeography of the korean pine (pinus\nkoraiensis) in northeast asia: Inferences from organelle gene sequences. Journal\nof plant research. 125:713-723.\n\nAltschul SF, Gish W, Miller W, Myers EW, Lipman DJ. 1990. Basic local alignment\nsearch tool. Journal of molecular biology. 215:403-410.\n\nAlverson AJ et al. 2010. Insights into the evolution of mitochondrial genome\nsize from complete sequences of citrullus lanatus and cucurbita pepo\n(cucurbitaceae). Molecular biology and evolution. 27:1436-1448.\n\nBarkan A. 1988. Proteins encoded by a complex chloroplast transcription unit are\neach translated from both monocistronic and polycistronic mRNAs. The EMBO\njournal. 7:2637.\n\nBenson DA et al. 2014. GenBank. Nucleic Acids Research. 43:D30-D35.\n[doi: 10.1093/nar/gku1216](http://doi.org/10.1093/nar/gku1216).\n\nBirol I et al. 2013. Assembling the 20 gb white spruce (picea glauca) genome\nfrom whole-genome shotgun sequencing data. Bioinformatics. btt178.\n\nBock DG, Kane NC, Ebert DP, Rieseberg LH. 2014. Genome skimming reveals the\norigin of the jerusalem artichoke tuber crop species: Neither from jerusalem nor\nan artichoke. New Phytologist. 201:1021-1030.\n\nCampbell MS et al. 2014. MAKER-p: A tool kit for the rapid creation, management,\nand quality control of plant genome annotations. Plant physiology. 164:513-524.\n\nChaw S-M et al. 2008. The mitochondrial genome of the gymnosperm cycas\ntaitungensis contains a novel family of short interspersed elements, bpu\nsequences, and abundant rNA editing sites. Molecular biology and evolution.\n25:603-615.\n\nChen J et al. 2011. Substoichiometrically different mitotypes coexist in\nmitochondrial genomes of brassica napus l. PLoS One. 6:e17662.\n\nDu FK et al. 2011. Direction and extent of organelle dNA introgression between\ntwo spruce species in the qinghai-tibetan plateau. New Phytologist.\n192:1024-1033.\n\nFajardo D et al. 2014. The american cranberry mitochondrial genome reveals the\npresence of selenocysteine (tRNA-sec and sECIS) insertion machinery in land\nplants. Gene. 536:336-343.\n\nGerardi S, JARAMILLO-CORREA JP, Beaulieu J, Bousquet J. 2010. From glacial\nrefugia to modern populations: New assemblages of organelle genomes generated by\ndifferential cytoplasmic gene flow in transcontinental black spruce. Molecular\necology. 19:5265-5280.\n\nGordon D, Green P. 2013. Consed: A graphical editor for next-generation\nsequencing. Bioinformatics. 29:2936-2937.\n[doi: 10.1093/bioinformatics/btt515](http://doi.org/10.1093/bioinformatics/btt515).\n\nGreen P. 1999. Documentation for phrap and cross-match. University of\nWashington, Seattle. <http://www.phrap.org/phredphrapconsed.html>.\n\nGremme G, Steinbiss S, Kurtz S. 2013. GenomeTools: A comprehensive software\nlibrary for efficient processing of structured genome annotations. Computational\nBiology and Bioinformatics, IEEE/ACM Transactions on. 10:645-656.\n\nGrewe F et al. 2014. Comparative analysis of 11 brassicales mitochondrial\ngenomes and the mitochondrial transcriptome of&lt; i&gt; brassica\noleracea&lt;/i&gt;. Mitochondrion.\n\nGuo W et al. 2014. Predominant and substoichiometric isomers of the plastid\ngenome coexist within juniperus plants and have shifted multiple times during\ncupressophyte evolution. Genome biology and evolution. 6:580-590.\n\nGurevich A, Saveliev V, Vyahhi N, Tesler G. 2013. QUAST: Quality assessment tool\nfor genome assemblies. Bioinformatics. 29:1072-1075.\n\nHildebrand M, Hallick RB, Passavant CW, Bourque DP. 1988. Trans-splicing in\nchloroplasts: The rps 12 loci of nicotiana tabacum. Proceedings of the National\nAcademy of Sciences. 85:372-376.\n\nHyatt D et al. 2010. Prodigal: Prokaryotic gene recognition and translation\ninitiation site identification. BMC Bioinformatics. 11:119.\n[doi: 10.1186/1471-2105-11-119](http://doi.org/10.1186/1471-2105-11-119).\n\nJardon-Barbolla L, Delgado-Valerio P, Geada-Lopez G, Vazquez-Lobo A, Pinero D.\n2011. Phylogeography of pinus subsection australes in the caribbean basin.\nAnnals of botany. 107:229-241.\n\nJeong Y-M et al. 2014. The complete mitochondrial genome of cultivated radish\nwK10039 (raphanus sativus l.). Mitochondrial DNA. 1-2.\n\nJo YD, Choi Y, Kim D-H, Kim B-D, Kang B-C. 2014. Extensive structural variations\nbetween mitochondrial genomes of cMS and normal peppers (capsicum annuum l.)\nrevealed by complete nucleotide sequencing. BMC genomics. 15:561.\n\nKent WJ. 2002. BLAT--the bLAST-like alignment tool. Genome research. 12:656-664.\n\nKeren I et al. 2009. AtnMat2, a nuclear-encoded maturase required for splicing\nof group-iI introns in arabidopsis mitochondria. Rna. 15:2299-2311.\n\nKim DH, Kang JG, Kim B-D. 2007. Isolation and characterization of the\ncytoplasmic male sterility-associated orf456 gene of chili pepper (capsicum\nannuum l.). Plant molecular biology. 63:519-532.\n\nKurtz S et al. 2004. Versatile and open software for comparing large genomes.\nGenome biology. 5:R12.\n\nLagesen K et al. 2007. RNAmmer: Consistent and rapid annotation of ribosomal rNA\ngenes. Nucleic acids research. 35:3100-3108.\n\nLang BF, Laforest M-J, Burger G. 2007. Mitochondrial introns: A critical view.\nTrends in Genetics. 23:119-125.\n[doi: 10.1016/j.tig.2007.01.006](http://doi.org/10.1016/j.tig.2007.01.006).\n\nLaslett D, Canback B. 2004. ARAGORN, a program to detect tRNA genes and tmRNA\ngenes in nucleotide sequences. Nucleic Acids Research. 32:11-16.\n\nLi H. 2013. Aligning sequence reads, clone sequences and assembly contigs with\nbWA-mEM. arXiv preprint arXiv:1303.3997.\n\nLin C-P, Huang J-P, Wu C-S, Hsu C-Y, Chaw S-M. 2010. Comparative chloroplast\ngenomics reveals the evolution of pinaceae genera and subfamilies. Genome\nbiology and evolution. 2:504-517.\n\nLohse M, Drechsel O, Bock R. 2007. OrganellarGenomeDRAW (oGDRAW): A tool for the\neasy generation of high-quality custom graphical maps of plastid and\nmitochondrial genomes. Current genetics. 52:267-274.\n\nLowe TM, Eddy SR. 1997. TRNAscan-sE: A program for improved detection of\ntransfer rNA genes in genomic sequence. Nucleic acids research. 25:0955-964.\n\nLuo R et al. 2012. SOAPdenovo2: An empirically improved memory-efficient\nshort-read de novo assembler. Gigascience. 1:18.\n\nMcKenna A et al. 2010. The genome analysis toolkit: A mapReduce framework for\nanalyzing next-generation dNA sequencing data. Genome research. 20:1297-1303.\n[doi: 10.1101/gr.107524.110](http://doi.org/10.1101/gr.107524.110).\n\nNascimento Vieira L do et al. 2014. An improved protocol for intact chloroplasts\nand cpDNA isolation in conifers. PloS one. 9:e84792.\n\nNascimento Vieira L do et al. 2014. The complete chloroplast genome sequence of\npodocarpus lambertii: Genome structure, evolutionary aspects, gene content and\nsSR detection. PloS one. 9:e90618.\n\nNeckermann K, Zeltz P, Igloi GL, Kossel H, Maier RM. 1994. The role of RNA\nediting in conservation of start codons in chloroplast genomes. Gene.\n146:177-182.\n[doi: 10.1016/0378-1119(94)90290-9](http://doi.org/10.1016/0378-1119(94)90290-9).\n\nNystedt B et al. 2013. The norway spruce genome sequence and conifer genome\nevolution. Nature. 497:579-584.\n\nPark S et al. 2014. Complete sequences of organelle genomes from the medicinal\nplant rhazya stricta (apocynaceae) and contrasting patterns of mitochondrial\ngenome evolution across asterids. BMC genomics. 15:405.\n\nPatro R, Mount SM, Kingsford C. 2014. Sailfish enables alignment-free isoform\nquantification from rNA-seq reads using lightweight algorithms. Nature\nbiotechnology. 32:462-464.\n[doi: 10.1038/nbt.2862](http://doi.org/10.1038/nbt.2862).\n\nQuinlan AR, Hall IM. 2010. BEDTools: A flexible suite of utilities for comparing\ngenomic features. Bioinformatics. 26:841-842.\n[doi: 10.1093/bioinformatics/btq033](http://doi.org/10.1093/bioinformatics/btq033).\n\nRice DW et al. 2013. Horizontal transfer of entire genomes via mitochondrial\nfusion in the angiosperm amborella. Science. 342:1468-1473.\n\nSeemann T. 2014. Prokka: Rapid prokaryotic genome annotation. Bioinformatics.\nbtu153.\n\nSimpson JT et al. 2009. ABySS: A parallel assembler for short read sequence\ndata. Genome research. 19:1117-1123.\n\nSloan DB et al. 2012. Rapid evolution of enormous, multichromosomal genomes in\nflowering plant mitochondria with exceptionally high mutation rates. PLoS\nbiology. 10:e1001241.\n\nSmit A, Hubley R, Green P. 1996. RepeatMasker open-3.0.\n<http://www.repeatmasker.org>.\n\nVandervalk BP et al. 2014. Konnector: Connecting paired-end reads using a bloom\nfilter de bruijn graph. In: 2014 IEEE international conference on bioinformatics\nand biomedicine (BIBM). Institute of Electrical & Electronics Engineers (IEEE).\n[doi: 10.1109/bibm.2014.6999126](http://doi.org/10.1109/bibm.2014.6999126).\n\nWang Y et al. 2014. Complete mitochondrial genome of eruca sativa mill.(Garden\nrocket). PloS one. 9:e105748.\n\nWarren RL et al. 2015. Improved white spruce (picea glauca) genome assemblies\nand annotation of large gene families of conifer terpenoid and phenolic defense\nmetabolism. The Plant Journal.\n[doi: 10.1111/tpj.12886](http://doi.org/10.1111/tpj.12886).\n\nWarren RL, Vandervalk BP, Jones SJ, Birol I. 2015. LINKS: Scaffolding genome\nassemblies with kilobase-long nanopore reads. bioRxiv. 016519.\n[doi: 10.1101/016519](http://doi.org/10.1101/016519).\n\nWhittle C-A, Johnston MO. 2002. Male-driven evolution of mitochondrial and\nchloroplastidial dNA sequences in plants. Molecular biology and evolution.\n19:938-949.\n\nWu C-S, Wang Y-N, Liu S-M, Chaw S-M. 2007. Chloroplast genome (cpDNA) of cycas\ntaitungensis and 56 cp protein-coding genes of gnetum parvifolium: Insights into\ncpDNA evolution and phylogeny of extant seed plants. Molecular biology and\nevolution. 24:1366-1379.\n\nWyman SK, Jansen RK, Boore JL. 2004. Automatic annotation of organellar genomes\nwith dOGMA. Bioinformatics. 20:3252-3255.\n\nZerbino DR, Birney E. 2008. Velvet: Algorithms for de novo short read assembly\nusing de bruijn graphs. Genome research. 18:821-829.\n\nZhang Y et al. 2014. The complete chloroplast genome sequence of taxus chinensis\nvar. mairei (taxaceae): Loss of an inverted repeat region and comparative\nanalysis with related species. Gene. 540:201-209.\n", 
  "id": 16298516
}