{
  "README": "##################################################################################################\n  GO-WARP: a Time Warp simulator written in Go\t\t\t\thttp://pads.cs.unibo.it\n  \n  as described in \"Time Warp on the Go\" http://arxiv.org/abs/1206.2772\n  Proc. of 3nd ICST/CREATE-NET Workshop on DIstributed SImulation and Online gaming (DISIO 2012).\n  In conjunction with SIMUTools 2012. Desenzano, Italy, March 2012. ISBN: 978-1-936968-47-3\n\n  Copyright 2014, Gabriele D'Angelo, Moreno Marzolla, Pietro Ansaloni\n  Computer Science Department, University of Bologna, Italy\n  \n##################################################################################################\n\n  This tree contains:\n    -\ta Go-based implementation of the Time Warp synchronization algorithm for Parallel And\n\tDistributed Simulation (PADS),\n    -\ta Go-based implementation of the PHOLD synthetic benchmark for optimistic simulation.\n    \n  More information can be found in the paper \"Time Warp on the Go\" http://arxiv.org/abs/1206.2772\n  and on the project website: http://pads.cs.unibo.it\n    \n##################################################################################################\n\n  >>>>>>>>>>>>>>> WARNINGS\n  \n  1) The provided source code is alpha quality with insufficient comments\n\tand documentation.\n  \n  2) The Go language version used for developing GO-WARP is the 2010-07-14.\n\n  >>>>>>>>>>>>>>> USAGE\n\n  0) Install the appropriate Go compiler and set the related environment variables.\n  \n  1) Compile GO-WARP using \"make\".\n\n  2) If all has gone OK then you can use the \"test-scalability.sh\" and \"test-main.sh\" \n\tscripts for running the PHOLD benchmark in different configurations.\n\n  >>>>>>>>>>>>>>> ACKNOWLEDGMENTS\n  \n  All this would have not been possible without the (hard) work of Pietro Ansaloni,\n  that is the original author of this source code.\n  His BSc thesis (in Italian) can be found at:\n\thttp://amslaurea.unibo.it/1594/1/Ansaloni_Pietro_tesi.pdf\n  \n  >>>>>>>>>>>>>>> FAQs\n  \n  Q) Do you plan to port GO-WARP to a more recent version of Go (e.g. >= 1)?\n  A) We hope so but a lot of work is necessary for this porting.\n\n", 
  "read_at": 1462547004, 
  "description": "a Time Warp simulator written in Go", 
  "id": 16412958
}