{
  "read_at": 1462543201, 
  "description": "SONG (Second Order Non-Gaussianity) is a Boltzmann code that computes many observables related to the Cosmic Microwave Background and to the cosmological perturbations at second order in perturbation theory.", 
  "README.md": "## DESCRIPTION\n\nSONG computes the non-linear evolution of the Universe in order to predict cosmological observables such as the bispectrum of the Cosmic Microwave Background (CMB).\n\nMore precisely, SONG (Second Order Non-Gaussianity) is a second-order Boltzmann code, as it solves the Einstein and Boltzmann equations up to second order in the cosmological perturbations; the physics, mathematics and numerics of SONG are described extensively in my publicly available [PhD thesis][10], especially in Chapters 5 and 6.\n\nThe reason for writing SONG was not to provide a more accurate version of the already existing first-order Boltzmann codes, such as [CAMB][1] or [CLASS][2]. Rather, SONG is a tool that, given a cosmological model, provides predictions for \"new\" observables or probes that do not exist at first order, such as\n\n* the intrinsic bispectrum of the CMB ([[3]] and [[4]]),\n* the angular power spectrum of the spectral distortions [[5]],\n* the power spectrum of the magnetic fields generated around and after recombination [[11]],\n* the angular power spectrum of the B-mode polarisation [[6]],\n* the Fourier bispectrum of the cold dark matter density fluctuations.\n\nSONG's structure is based on that of [CLASS][1], a linear Boltzmann code introduced in 2013 [[9]]. In particular, SONG inherits the philosophy of CLASS, that is to provide an easy-to-use interface built on a modular and flexible internal structure. Special care is taken to avoid the use of hard-coded numerical values, or \"magic numbers\"; the physical and numerical parameters are controlled through two separate input files by the user, who needs to set only those parameters of their interest, the others taking default values.\n\nIn writing SONG we have followed the principle of encapsulation, so that if you want to modify or add a feature to SONG, you have to edit the code in few localised portions. When in doubt, you can resort to the internal documentation, which comprises more than 10,000 lines of comments.\n\n\n## MAIN FEATURES OF SONG\n\nHere is a summary of the most relevant properties of SONG:\n\n* SONG is an open-source project written in C using only freely distributed libraries.\n* It is fast: it takes about an hour on a modern laptop to compute the intrinsic bispectrum at 10% precision.\n* It employs an ad-hoc differential evolver designed for stiff systems [[9]].\n* It fully includes CMB polarisation at second order.\n* It implements the tight coupling approximation for faster computation.\n* It implements a Fisher matrix module to quantify the observability of any intrinsic or primordial bispectrum.\n* It uses novel algorithms for Bessel convolution, bispectrum integration and 3D interpolation.\n* It implements the concept of beta-moments, whereby the non-realitivistic and relativistic species are treated in a unified way in terms of the moments of the distribution function.\n* It inherits from CLASS a modular and flexible structure.\n* It is OpenMP parallelised.\n* Its source code is extensively documented with more than 10,000 lines of comments.\n\n## DOCUMENTATION\nSONG's source code is extensively documented with more than 10,000 lines of comments. The physical and numerical steps are explained in the source (.c) files, while the employed variables are documented in the header (.h) files.  We are also working on a series of tutorials which I plan to release early in 2016.\n\nThe physics, mathematics and numerics of SONG are described extensively in my PhD thesis [[10]], especially in Chapters 5 and 6. For any doubt or enquiry, please email me at <guido.pettinari@gmail.com>.\n\n\n## GETTING STARTED\nFirst, download SONG. You can do so either from the project's page <https://github.com/coccoinomane/song/releases> or from the command line with:\n\n    git clone --recursive https://github.com/coccoinomane/song.git song.git\n\nThe `--recursive` flag is important because it allows to download both SONG and CLASS in one command. To compile and make a test run of SONG, enter SONG's directory and execute the following commands from your terminal:\n\n    make song\n    ./song ini/intrinsic.ini pre/quick_song_run.pre\n\nThe first command compiles the code using the instructions contained in the file `makefile`. This can be customised to match the configuration of your system. The main variables are the location of the C compiler (gcc by default) and of the OpenMP library (if you want parallelisation); SONG does not rely on any other external library.\n\nThe second command executes a test run of SONG using the input files `ini/intrinsic.ini` and `pre/quick_song_run.pre`. These are text-only files with a list of \"key = value\" settings; SONG will read their content and set its internal parameters accordingly.\n\nTo make a SONG run that will produce an actual physical result, try with\n\n    ./song ini/intrinsic.ini pre/sn_pol_10percent_lmax2000.pre\n    \nSONG will output to file and to screen the Fisher matrix and signal-to-noise of the intrinsic bispectrum, with a moderate angular resolution, and a precision of about 10% for both temperature and polarisation; the calculation will take about 40 minutes on an 8-core machine.\n\nFeel free to experiment with the parameter files! For example, if you delete `eBisp` from `ini/intrinsic.ini`, SONG will neglect E-polarisation and run much faster. For a guide on what each parameter does, please refer to the (*not yet*) documented file `explanatory.ini` or to the documented `ini/intrinsic.ini`. Use these files as templates for creating your custom input files!\n\n\n## PARALLEL COMPUTING\n\nSONG is a parallel code, via the OpenMP standard. Therefore, it can use all the cores in a single node, but it cannot span multiple nodes.\n\nSet the number of cores you want to use on the command line via the environment variable `OMP_NUM_THREADS`. For example, if you run SONG on a laptop with 8 cores on a bash shell, you might want to execute `export OMP_NUM_THREADS=8` before running SONG.\n\nApple Os X default compiler, `clang`, does not natively support OpenMP. I suggest using the GNU `gcc` compiler, which can be downloaded from [Macports], [Homebrew] or [HPC].\n\n\n## DIRECTORY STRUCTURE\nThe directory structure of SONG is important to learn how the code works:\n\n* The 'source' directory contains the main source files in C. Each file corresponds to a module in SONG.\n\n* The 'tools' directory contains accessory source files in C with purely numerical functions or utility functions.\n\n* The 'main' directory contains the main source files, i.e. the executable files, including song.c.\n\n* The 'python' directory contains Python scripts to inspect some of SONG outputs (credits to Thomas Tram).\n\n* The 'include' directory contains the declaration files (.h) for all the C files in the 'source', 'main' and 'tools' directories.\n\n* The 'test' directory contains executable programs to test the outputs of SONG.\n\n* The 'scripts' directory contains bash and gnuplot scripts to run SONG iteratively and to plot its results.\n\n* The 'ini' and 'pre' directories contain, respectively, parameter and precision files that can be fed to SONG.\n\n* The 'output' folder, initially empty, will contain the products of SONG computations, usually in the form of text files.\n\n\n## CONTRIBUTE!\nPlease feel free to contribute to the development of SONG! You can do so via the Github project page: <https://github.com/coccoinomane/song.git>. Fork the repository, make your modifications and send a pull request.\n\nThe [master branch] has the latest stable SONG release, while the [develop branch] contains the more advanced (and potentially buggy) development version.\n\nIf you are not familiar with Git and Github, please consider sending me the proposed modifications via email at <guido.pettinari@gmail.com>. Otherwise, there are very good [Github tutorials] available.\n\nIf you do not have a feature in mind, but nonetheless want to contribute to SONG, you are very welcome to do so! Just have fun addressing the many TODO comments in the code :-)\n\n\n## CONTACT\nFeel free to send an email to Guido Pettinari <guido.pettinari@gmail.com> or Christian Fidler <christian.fidler@port.ac.uk> for any enquiry or suggestion. We realise that bispectra and second-order perturbation theory may be a bit confusing, so we are happy to help.\n\n\n## CITATIONS\nWriting SONG took more than four years. If you found SONG useful, please acknowledge our effort and that of our collaborators by citing one or more of the following references. If in doubt, please use the first reference.\n\n* G. W. Pettinari, C. Fidler, R. Crittenden, K. Koyama, and D. Wands. \"The intrinsic bispectrum of the cosmic microwave background\". J. Cosmology Astropart. Phys., 04(2013)003, doi: 10.1088/1475-7516/2013/04/003 [[3]]\n```\n@article{pettinari:2013a,\n       author = {{Pettinari}, G.~W. and {Fidler}, C. and {Crittenden}, R. and {Koyama}, K. and {Wands}, D.},\n        title = \"{The intrinsic bispectrum of the cosmic microwave background}\",\n      journal = {J. Cosmology Astropart. Phys.},\n         year = 2013,\n        month = apr,\n       volume = 4,\n          eid = {003},\n        pages = {3},\n          doi = {10.1088/1475-7516/2013/04/003},\n       adsurl = {http://adsabs.harvard.edu/abs/2013JCAP...04..003P},\narchivePrefix = \"arXiv\",\n       eprint = {1302.0832}\n}\n```\n\n* G. W. Pettinari, \"The intrinsic bispectrum of the cosmic microwave background [PhD Thesis]\". Springer Theses Series, Volume XXIII, 2015 [[10]]\n```\n@book{pettinari:2015a,\n\t   Author = {Pettinari, G.~W.},\n\tPublisher = {Springer International Publishing},\n\t   Series = {Springer Theses},\n\t    Title = {The Intrinsic Bispectrum of the Cosmic Microwave Background},\n\t      Url = {http://www.springer.com/gp/book/9783319218816},\n\t     Year = {2015},\n          doi = {10.1088/1475-7516/2013/04/003},\n         Isbn = {9783319218823},\narchivePrefix = \"arXiv\",\n       eprint = {1405.2280}\n}\n```\n\n* G. W. Pettinari, C. Fidler, R. Crittenden, K. Koyama, A. Lewis & D. Wands. \"Impact of polarization on the intrinsic cosmic microwave background bispectrum\". Phys. Rev. D., 90, 103010, doi: 10.1103/PhysRevD.90.103010 [[4]]\n```\n@article{pettinari:2014a,\n\t   author = {Pettinari, G.~W. and Fidler, C. and Crittenden, R. and Koyama, K. and Lewis, A and Wands, D.},\n\t    issue = {10},\n\t  journal = {Phys. Rev. D},\n\t    month = {Nov},\n\t numpages = {6},\n\t    pages = {103010},\n\tpublisher = {American Physical Society},\n\t    title = {Impact of polarization on the intrinsic cosmic microwave background bispectrum},\n\t      url = {http://link.aps.org/doi/10.1103/PhysRevD.90.103010},\n\t   volume = {90},\n\t     year = {2014},\narchivePrefix = \"arXiv\",\n       eprint = {1406.2981},\n          doi = {10.1103/PhysRevD.90.103010}\n}\n```\n\n\n[1]: http://camb.info/ \"The CAMB Boltzmann code\"\n[2]: http://class-code.net/ \"The CLASS Boltzmann code\"\n[3]: http://arxiv.org/abs/1302.0832 \"The intrinsic bispectrum of the Cosmic Microwave Background\"\n[4]: http://arxiv.org/abs/1406.2981 \"Impact of polarisation on the intrinsic CMB bispectrum\"\n[5]: http://arxiv.org/abs/1312.4448 \"Spectral distortions in the cosmic microwave background polarization\"\n[6]: http://arxiv.org/abs/1401.3296 \"The intrinsic B-mode polarisation of the Cosmic Microwave Background\"\n[7]: http://www2.iap.fr/users/pitrou/cmbquick.htm \"The CMBquick 2nd-order Boltzmann code\"\n[8]: http://arxiv.org/abs/1212.3573 \"The CMB bispectrum from recombination\"\n[9]: http://arxiv.org/abs/1104.2933 \"The Cosmic Linear Anisotropy Solving System (CLASS)\"\n[10]: http://arxiv.org/abs/1405.2280 \"The intrinsic bispectrum of the Cosmic Microwave Background [PhD thesis]\"\n[11]: http://arxiv.org/abs/1511.07801 \"A precise numerical estimation of the magnetic field generated around recombination\"\n[Macports]: https://www.macports.org\n[Homebrew]: http://brew.sh\n[HPC]: http://hpc.sourceforge.net\n[Github tutorials]: https://help.github.com/articles/good-resources-for-learning-git-and-github/ \"Good Resources for Learning Git and GitHub\"\n[Github page]: https://github.com/coccoinomane/song.git\n[master branch]: https://github.com/coccoinomane/song/tree/master\n[develop branch]: https://github.com/coccoinomane/song/tree/develop\n", 
  "id": 16516796
}