{
  "read_at": 1462543183, 
  "description": "Main code repository for the PLUMED-GUI plugin for VMD", 
  "README.md": "Plumed-GUI\n==========\n\nToni Giorgino  \nConsiglio Nazionale delle Ricerche (IN-CNR)\n\n\n\nA Plumed collective variable analysis tool for VMD\n------------\n\nThe PLUMED-GUI collective variable analysis tool is a plugin for the Visual Molecular Dynamics (VMD) software that provides access to the extensive set of collective variables (CV) defined in the PLUMED. It allows you to:\n\n- analyze the currently loaded trajectory by evaluating and plotting arbitrary CVs\n- use VMD's atom selection keywords to define atom groups and ready-made templates for common CVs\n- export the CV definition file for use in MD simulations\n- prepare reference files for RMSD, path-variable, native contacts, etc.\n \nThe code is hosted on GitHub at\n[tonigi/vmd_plumed](https://github.com/tonigi/vmd_plumed).\n\n\n\n\nInstallation\n------------\n\nFirst, you need PLUMED 1.3's *driver* and/or PLUMED 2's *plumed*\nexecutables: see [INSTALL-PLUMED-FIRST.md](doc/INSTALL-PLUMED-FIRST.md).\n\nSecond, you may want to update PLUMED-GUI to its latest version,\nrather than using the one distributed with VMD. See instructions\nin [INSTALL.md](doc/INSTALL.md).\n\n\n\n\nDocumentation\n-------------\n\nPlease find\n\n- A short manual and quickstart in the [doc/README.md](doc/README.md) file\n- An extensive description in (please read and cite) \n  * Toni Giorgino, _Plumed-GUI: an environment for the interactive development of molecular dynamics analysis and biasing scripts_ (2014) Computer Physics Communications, Volume 185, Issue 3, March 2014, Pages 1109-1114, [doi:10.1016/j.cpc.2013.11.019](http://dx.doi.org/10.1016/j.cpc.2013.11.019), or [arXiv:1312.3190](http://arxiv.org/abs/1312.3190)  \n- Information on the PLUMED engine at http://www.plumed.org \n\n\n\nCitation\n--------\n\nYou are kindly requested to cite the following paper in any\npublication resulting from the use of Plumed-GUI (in addition to other\npossibly relevant Plumed citations):\n\n- Toni Giorgino, _Plumed-GUI: an environment for the interactive\n  development of molecular dynamics analysis and biasing scripts_\n  (2014) Computer Physics Communications,\n  [doi:10.1016/j.cpc.2013.11.019](http://dx.doi.org/10.1016/j.cpc.2013.11.019)\n  or http://arxiv.org/abs/1312.3190 .\n\n\n\n\n\n", 
  "id": 16612053
}