{
  "README": "JTSQR: Hadoop MapReduce Tall-and-Skinny QR Factorization written in Java\nVersion 1.0\nDistributed in 2014/02/07\n===\n\n### Hsiu-Cheng Yu, Che-Rung Lee\n\n\n# Introduction\n----------------\nThe function provided by this package is the computation of QR factorizations for Tall-and-Skinny matrices (TSQR) using MapReduce.  \nA 'Tall-and-Skinny matrix' has the property that its number of rows is much bigger than its number of columns. \nThe TSQR function can be used to solve many problems, such as stochastic SVD (SSVD).\n\nIn this implementation, we provide three functions:\n\n * TSQR: Compute Q and R matrices of a given tall-and-skinny matrix.\n * Q^T*B: Apply the Q factor to a matrix B.\n * SSVD: Compute the stochastic SVD. This is an application of TSQR. \n\nThis code is written in Java and uses JLAPACK and JBLAS library for matrix computation.\n\n# Environment Setup\n--------\nThis code is for Linux systems.  It is built based on several packages. Make sure those packages are properly installed before using this package.\n\n * Hadoop 1.x version (available on http://hadoop.apache.org/)\n * matrix-toolkits-java (available on https://github.com/fommil/matrix-toolkits-java)\n * JLAPACK, JBLAS and F2JUTLI (available on http://www.netlib.org/java/f2j/)\n\n# Compiling \n--------------\nThere are five paths need to setup in Makefile: \"HADOOP_HOME\", \"MTJ\", \"JLAPACK\", \"JBLAS\" and \"JUTIL\".\n\n - HADOOP_HOME\n   Path where Hadoop is installed.\n - MTJ \n  Path where matrix-toolkits-java is installed.\n - JLAPACK\n  Path where is lapack.jar package\n - JBLAS\n  Path where is blas.jar package\n - JUTIL\n  Path where is f2jutil.jar package\n  \nThe Makefile have two commands.\n (1) $ make\n     Compiling and packaging all class files into a JAR file\n (2) $ make clean\n     Remove JAR file and directory of Class file\n\n\n# Usage Example and Command Line Arguments\n----------------------------------------------------\n\n $(MTJ)\n  Path of matrix-toolkits-java package\n $(JLAPACK)\n  Path where is lapack.jar package\n $(JBLAS)\n  Path where is blas.jar package\n $(JUTIL)\n  Path where is f2jutil.jar package\n $(HADOOP_HOME)\n  Path where Hadoop is installed\n $(TSQR_PACKAGE)\n  Path where TSQR package is installed\n  \n## Upload our example\n $ hadoop fs -mkdir tsqr\n $ hadoop fs -copyFromLocal testdata/100x5\n\nIn the input file of example, one line means one row in a matrix, and numbers are separated by a space. \nIf you want to use other matrices for this code, the format of matrices must follow above rules.\n\n## Example: Run TSQR\n### Do QR Factorization only\n ${HADOOP_HOME}/bin/hadoop jar ${TSQR_PACKAGE}/TSQR.jar nthu.scopelab.tsqr.TSQRunner \\\n -libjars '$(MTJ),$(JLAPACK),$(JBLAS),$(JUTIL)' \\\n -input mat/100x5 \\\n -output tsqrOutput \\\n -subRowSize 10 \\\n -reduceSchedule 4,1 \\\n -mis 64 \\\n -type 0\n \n\n### Compute Q^T*A\n ${HADOOP_HOME}/bin/hadoop jar ${TSQR_PACKAGE}/TSQR.jar nthu.scopelab.tsqr.TSQRunner \\\n -libjars '$(MTJ),$(JLAPACK),$(JBLAS),$(JUTIL)' \\\n -input mat/100x5 \\\n -output tsqrOutput \\\n -inputB mat/100x5 \\\n -outputQ true \\\n -subRowSize 10 \\\n -reduceSchedule 4,1 \\\n -mis 64 \\\n -type 1\n\n#### Arguments for Run TSQR\nThe argument has star mark * means that it must be given a value by user and other arguments without star mark have default value.\n\n -libjar *\n  Path of imported libraries.\n -input *\n  Input file, including its directory.\n -inputB *\n  The \"inputB\" argument is necessary if the \"type\" argument set to 1. \n  The matrix used to compute Q^T*B. Notice that the number of rows of B matrix must equal to that of A matrix(the original matrix).\n -output *\n  Output directory\n -outputQ (default: false)\n  This argument only used in compute Q^T*B. If it is true, QMultiplyJob outputs the Q matrix to a file.  False outputs R matrix only.\n -subRowSize (default: equal to number of columns)\n  It is the number of rows of each submatrix. These submatrices are split from input matrix. \"subRowSize\" must be bigger than the number of columns, and smaller than the number of rows of the original matrix.\n -reduceSchedule (default: 1) \n  This argument is used in QRFirstJob (refer JTSQR_Introduction.pdf). The input can be a sequence of numbers, which are separated by commas.  The ith number in the sequence represents the number of Reducers in the ith MapReduce task.\n  Finally, last number need to set to one in order to calculate the final R.\n  For example, 4,1 means that it has two MapReduce and first MapReduce has four Reducers and second has one reducer.\n -mis (default: 64)\n  Max Input Split size: the maximum size of each input data.  For example, mis=64 means the maximum size of each split file is 64MB. \n -type *\n  0 means that do QR factorization only and 1 is to compute Q^T*B\n\n## Example: Run SSVD\n### Run SSVD\n ${HADOOP_HOME}/bin/hadoop jar ${TSQR_PACKAGE}/TSQR.jar nthu.scopelab.tsqr.ssvd.SSVDRunner \\\n -libjars '$(MTJ),$(JLAPACK),$(JBLAS),$(JUTIL)' \\\n -input mat/100kx500 \\\n -output tsqrOutput \\\n -subRowSize 4000 \\\n -reduceSchedule 4,1 \\\n -mis 64 \\\n -rank 10 \\\n -reduceTasks 8\n\n#### Arguments for Run SSVD\n - input, output, ....\n  The same as they are in the TSQR example\n - rank *\n  \"rank\" is Stochastic number that would simply m*n matrix to m*k matrix. (k is smaller than n)\n - reduceTasks *\n  Number of Reduce tasks of BtJob, UJob and VJob\n\n## Example: Turn the matrix from Hadoop sequencefile into text file and then print out \n ${HADOOP_HOME}/bin/hadoop jar ${TSQR_PACKAGE}/TSQR.jar nthu.scopelab.tsqr.rs.readSFMat \\\n -libjars '$(MTJ),$(JLAPACK),$(JBLAS),$(JUTIL)' \\\n -input tsqrOutput/part-00000\n\n# Tuning Suggestion of Arguments\n--------------------------------\nIf you want improve performance for JTSQR by tuning argument. We have some tips for following three arguments.\n\n-subRowSize\nThis argument does not affect performance of application in this package, but it has a point need to know. \nIf the argument is too large which cause the data size of sub matrix is bigger than Map task input split size, \nthat will dramatically reduce the performance. In order to avoid above situation, it would automatically reduce \nthe \"subRowSize\" in JTSQR if that value is too large.\n\n-mis\nIn most cases, reducing the \"mis\" would lightly improve the performance. That means that you increase the number \nof Map tasks. If you lunch too many Map tasks (too many JVM processes) that cause memory requirement exceed the free \nmemory of machine and then the Hadoop file system corrupted. In order to avoid above situation, it would automatically \ncheck the value of \"mis\" in JTSQR.\n\n-reduceSchedule\nThe default value of this argument was zero (0). If you encounter the out of memory problem of JVM or performance bottleneck\nthat caused by bigger data, you could reference section 3.3 of document\"JTSQR_Introduction\" to tune this argument.\n\n# Overview\n--------\n * javac/nthu/scopelab/tsqr/TSQRunner.java - driver code for TSQR\n * javac/nthu/scopelab/tsqr/SequencefileMatrixMaker.java - driver code for MapReduce code, which turns the matrix from text file to Hadoop sequencefile \n * javac/nthu/scopelab/tsqr/ssvd/SSVDRunner.java - driver code for SSVD\n\n\n# References\n--------------\n * Direct QR factorizations for tall-and-skinny matrices in MapReduce architectures [[pdf](http://arxiv.org/abs/1301.1071)]\n * Tall and skinny QR factorizations in MapReduce architectures [[pdf](http://www.cs.purdue.edu/homes/dgleich/publications/Constantine%202011%20-%20TSQR.pdf)]\n * [MAHOUT-376] Implement Map-reduce version of stochastic SVD [https://issues.apache.org/jira/browse/MAHOUT-376]\n\nContact\n--------\n * For any questions, suggestions, and bug reports, email Hsiu-Cheng Yu by s411051@gmail.com please.\n * This code can be reached at: https://github.com/NovanHsiu/JTSQR\n", 
  "read_at": 1462543252, 
  "description": "Hadoop MapReduce Tall-and-Skinny QR Factorization written in Java", 
  "id": 16614541
}