{
  "read_at": 1462543230, 
  "description": "Fit models of DNA evolution to a collection of two-taxon trees", 
  "README.md": "# `fit-star`\n\nThis package fits various models of DNA evolution to a collection of two-taxon trees, each using data from a single pairwise alignment.\n\nIn contrast to standard phylogenetic inference programs, `fit-star` allows the root state of each 2-tree to be fixed to the reference sequence within the pairwise alignment.\nAdditionally, it assumes that each sequence evolved independently from the known start state - along a star-like phylogeny.\n\nThis is unusual.\nFor inferring full phylogenies [RAxML](http://www.exelixis-lab.org/), [PhyML](http://www.atgc-montpellier.fr/phyml/), or [FastTree](http://www.microbesonline.org/fasttree/) will be more useful.\n\nAn application to B cell receptor sequences is described in [our preprint on arXiv](http://arxiv.org/abs/1403.3066).\n\n# Requirements\n\n* libprotobuf-2.4.1-dev\n* [beagle-2.1](https://code.google.com/p/beagle-lib/)\n* [bpp-core-dev 2.1.0](http://biopp.univ-montp2.fr/)\n* [bpp-phyl-dev 2.1.0](http://biopp.univ-montp2.fr/)\n* [bpp-seq-dev 2.1.0](http://biopp.univ-montp2.fr/)\n* libz-dev\n* eigen (included)\n* nlopt (included)\n* samtools (included)\n* boost (included)\n\n# Programs\n\nFunctionality is separated into two programs:\n\n## `build-mutation-matrices`\n\n`build-mutation-matrices` transforms each aligned sequence in a BAM file to a 4x4 matrix containing counts of each nucleotide substitution.\n\nIf multiple alignments are available for a single sequence, and the sequences are sorted by name, each alignment can form a partition to be fit by `fit-star`.\n\n## `fit-star`\n\n`fit-star` fits various evolutionary models (TN93, HKY85, GTR) to the pairwise substitution matrices generated by `build-mutation-matrices`.\n\nBoth model parameters and branch lengths are optimized.\n\nOptimized parameter values and branch lengths are output as JSON.\n\n`fit-star` is multithreaded using OpenMP, and by default uses all the cores available on your machine.\nTo reduce the number of cores used, set the environment variable `OMP_NUM_THREADS`.\n\n# Compiling\n\nAssuming all required dependencies are present, just run `make`.\n\nBinaries will be placed in `build/src/`.\n\n# Testing\n\nAssuming all required dependencies are present, just run `make test`.\n", 
  "id": 17092198
}