{
  "read_at": 1462553646, 
  "description": "Neutrino telescope likelihood tools ", 
  "README.md": "nulike\n======\n\nNeutrino telescope likelihood tools\n\n\nAbout\n--\n\nAuthor: Pat Scott (p.scott@imperial.ac.uk)  \nAdditional numerical routines contributed by Chris Savage (chris@savage.name)\n\nNulike is software for including full event-level information in\nlikelihood calculations for neutrino telescope searches for dark matter\nannihilation.\n\nFull details can be found in the papers:  \n  1. Scott, Savage, Edsjo & IceCube Collaboration 2012, JCAP 11:057, [arXiv:1207.0810](http://arxiv.org/abs/1207.0810)\n  2. IceCube Collaboration 2016, JCAP xx:xxx, [arXiv:1601.00653](http://arxiv.org/abs/1601.00653)\n  \nIf you use nulike for preparing a paper, please cite both of these.  If you use the 79-string IceCube likelihoods, don't forget to also cite the original IC79 WIMP paper:\n  3. IceCube Collaboration 2013, PRL 110:131302, [arXiv:1212.4097](http://arxiv.org/abs/1212.4097)\n\n\nCompilation\n--\n\nTo compile nulike as a static library, edit [makefile] and do\n\n  make\n\nTo compile nulike as a shared library, instead do\n\n  make libnulike.so\n\nThese libraries can then be linked against whatever driver program you\nwant to use to provide the neutrino flux at Earth from your favourite\ndark matter model.  I recommend DarkSUSY 5.1.3 (www.darksusy.org) or\nlater, but in principle anything that computes a neutrino flux is OK\n(just make sure it is threadsafe if you want to run nulike\nmulti-threaded).\n\n\nTesting\n--\n\nTo compile the nulike test programs, you must first install DarkSUSY and\nenter the path to its library in [makefile].  Then, depending on which\ndemo you want to run, you can do\n\n  make nulike_test  \n  make nulike_test_wimp  \n  make nulike_test_mssm25\n\nPlease refer to the source code of these examples for descriptions of\noptions, etc.  If the output from nulike_test_wimp seems to match the\ncontents of [tests/nulike_test_wimp.diffme], then things are working\nproperly.\n\n\nGenerating partial likelihoods\n--\n\nTo (re-)compute partial likelihoods for later reuse in fast likelihood\ncalculations, you must first install nusigma (found from the WIMPSim\npage at http://copsosx03.fysik.su.se/wimpsim/code.html) and enter the\npath to its library in [makefile].  Then,\n\n  make nulike_prep\n\nand\n\n  ./nulike_prep\n\nto get full usage instructions.\n\n\n\nLicense\n--\nCopyright (c) 2015, Patrick Scott and Christopher Savage\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n", 
  "id": 17513779
}