{
  "read_at": 1462553676, 
  "description": "Standalone algorithmic engine for solving profile-based optimal matchings", 
  "README.md": "Matchmaker\n==========\n\nStandalone algorithmic engine for solving various profile based optimal matchings (namely, greedy maximum, rank maximal and\nserial dictatorship matchings) in the Capacitated House Allocation problem (CHAT) and Hospital-Residents problem (HRT).\n\nThis work was first started in 2008 as a personal project in my first job that I did out of office in order to help HR at \nan investment bank with their indigenous version of the problem of assigning hundreds of new graduate employees to their \njob roles. It helped them tremendously that an elegant algorithmic solution could be applied to their problem to help them \noptimize the outcome of what has historically been an extremely painful and manual process. What once took them weeks and\nmonths to work out now had a solution at their fingertips in the matter of seconds! The seeds of the algorithms \nwere sown from my PhD, so it was an extremely rewarding experience for me to see something that I worked hard on bear fruit\nin the real world. My employers were also generous to me for helping them solve a long-standing headache.\n\nI have tried to make various improvements to the engine, taking it from one work place to another. It is still an ongoing \npersonal effort to refine and improve the engine for the simple reason that I enjoy it. For confidential reasons relating \nto the nature of my previous jobs, I am only able to share this code online now. \n\nFeel free to peruse the following for expositions of the underlying algorithms in the engine.\n\nhttp://theses.gla.ac.uk/301/\n\nhttp://arxiv.org/abs/1403.0751\n\nIn particular, the latter is a recently submitted research paper that contains the latest findings that built on my original work in my thesis. It is one of my current pastime to extend the engine to include these latest results. I warmly welcome anyone who is interested in collaborating with me.\n", 
  "id": 17536053
}