{
  "read_at": 1462553679, 
  "description": "Ornstein-Uhlenbeck example for LibBi with exactly observed state.", 
  "README.md": "LibBi package: FederalFundsRate\n===============================\n\nSynopsis\n--------\n\n    ./init.sh\n\nThis simulates a number of parameter sets from the prior for testing. GNU\nOctave is required. Running it is optional, as a number of parameter sets are\nalready included.\n\n    ./run.sh\n    \nThis runs a particle filter as well as samples from the posterior distribution\nusing a Federal Funds Rate data set.\n\n    ./test.sh\n\nThis runs tests on the bootstrap and bridge particle filters on the simulated\nparameter sets. Alternatively, these tests may be run as an array job on a\ncluster:\n\n    qsub -t 0-15 qsub_test_bridge.sh\n    qsub -t 0-15 qsub_test_bootstrap.sh\n\nFinally, results may be plot with:\n\n    octave --path oct/ --eval \"plot_and_print\"\n\nGNU Octave and OctBi are required.\n\nNote that, as of version 1.1.0 of LibBi, running any of these gives the\nwarnings:\n\n    Warning (line 29): 'obs' variables should not appear on the right side of actions in the 'transition' block.\n    Warning (line 42): 'obs' variables should not appear on the right side of actions in the 'lookahead_transition' block.\n\nThis is normal.\n\n   \nDescription\n-----------\n\nThis package includes an Ornstein--Uhlenbeck model that is observed\ndirectly. The task is to simulate diffusion bridges between the observed\nvalues. The form of the model is: $$dx=(\\theta_{1}-\\theta_{2}x)\\,\ndt+\\theta_{3}\\, dW,$$ with parameters $\\theta_1$, $\\theta_2$ and $\\theta_3$ to\nbe estimated. It was used as a test case in Del Moral & Murray (2014). The\npackage may be used to reproduce the results in that paper.\n\nA U.S. Federal Funds Rate data set is included. The data set contains 25 years\nof data at a monthly time interval, beginning January 1989 and ending December\n2013. The observation for January 1989 defines the initial value of the system\nand is hardcoded in the model file. The remaining observations, beginning\nFebruary 1989, are in the file `data/obs.nc`. The data set was obtained from\nhttp://www.federalreserve.gov/releases/h15/data.htm on 7 April 2014.\n\nReferences\n----------\n\nDel Moral, P. & Murray, L. M. Sequential Monte Carlo with Highly Informative\nObservations, 2014. [\\[arXiv\\]](http://arxiv.org/abs/1405.4081)\n", 
  "id": 17588061
}