{
  "read_at": 1462553651, 
  "description": "Fitting relations between galaxy mass and proxies for galaxy mass.", 
  "README.md": "Galaxy Mass Proxy Fitting\n=========================\n\nThis code implements a \"regression\" on galaxy mass from observations\nof mass and a mass proxy.  Using the regression posterior, subsequent\nobservations of the proxy can be converted to a posterior estimate of\nthe associated mass and its uncertainty.\n\nPreliminaries\n-------------\n\nTo use the code, you will need to install \n\n* [emcee](http://dan.iel.fm/emcee/current/), Dan Foreman-Mackey's\n  excellent MCMC sampler.  The sampler is used to draw from the\n  posterior of the regression model.\n\n* [plotutils](https://github.com/farr/plotutils), a collection of\n  routines to support managing emcee runs and the plotting of results.\n\nBoth of these libraries require [numpy](http://www.numpy.org/), and\nplotutils requires [scipy](http://www.scipy.org/) and\n[matplotlib](http://matplotlib.org/), too.\n\nBasic Mode of Operation\n-----------------------\n\nFirst, one calibrates a mass-proxy relationship using \n\n       calibrate.py --data observational-data.dat --outdir output-directory\n\nThe file of observational data should be a text (or gzipped/bzipped\ntext) file with columns.  The first line is a header line, and should\ncontain at least the headers <code>mass</code>, <code>proxy</code>,\n<code>dm</code>, and <code>dp</code> giving the measured mass and\nproxy values, together with the (relative) observational uncertainties\nin these quantities.  Various output files will be placed in the\nindicated directory that will permit subsequent estimation of masses.\nYou may want to examine the \"fit\" displayed in <code>fit.pdf</code>,\nwhich shows the data, the average \"regression\" line, and 10 draws from\nthe regression posterior.\n\nAlternately, the package comes with several pre-calibrated mass-proxy\nrelationships, as described in\n[arXiv:XXXX.XXXX](http://arxiv.org/abs/XXXX.XXXX); these can be found\nin subdirectories of the <code>data</code> directory.\n\nOnce one has a directory of calbration results, observations of the\nproxy only can be turned into mass estimates using \n\n      estimate.py --caldir calibration-directory --proxyfile proxy-data.dat --output mass-output.dat.bz2\n\nThe proxy data should be a text (or gzipped/bzipped text) file with\ncolumns.  The first line is a header line, and should contain at least\nthe colums <code>proxy</code> and <code>dp</code> giving the observed\nproxy values and (relative) uncertainties.  The results will be placed\nin the output file (which will always be compressed with bzip2); each\nline of that file contains draws from the posterior on the true mass\nfor each corresponding proxy measurement.  \n\nThe Model\n---------\n\nThe model used for the regression is described in detail in\n[arXiv:XXXX.XXXX](http://arxiv.org/abs/XXXX.XXXX), and implemented in\nthe extensively-commented <code>posterior.py</code>.  The model\nassumes that the true masses and proxies are drawn from a correlated,\nmultivariate log-normal distribution; additionally, observed values\nare assumed to distribute log-normally about the true values with\nwidth equal to the quoted observational uncertainty.  The model fits\nfor the mean and covariance matrix of the log-normal, and then\ncombines the posterior on these parameters with subsequent\nobservations of proxy values to draw posterior estimates of masses.\n\nThe code in <code>plots.py</code> permits to generate plots\nillustrating various aspects of the fit.\n\nThe code in <code>paper_test.py</code> implements the synthetic data\nset and tests described in\n[arXiv:XXXX.XXXX](http://arxiv.org/abs/XXXX.XXXX).\n\nLicense\n-------\n\nThis code is released under the [MIT\nLicense](http://opensource.org/licenses/MIT).  See the file LICENSE\nfor details.", 
  "id": 17650288
}