{
  "read_at": 1462553674, 
  "description": "Energy spectrum estimation of turbulence signals by compressive sampling (compressed sensing)", 
  "README.md": "SpESO\n============\n\nSpectrum Estimation by Sparse Optimization (SpESO). MATLAB code for energy spectrum estimation of turbulence by compressive sampling (compressed sensing). The core of the method is Quasi-Oracle Multilevel Orthogonal Matching Pursuit (QOMOMP), which is a multilevel variation of OMP using a priori information about the signal.\n\n\nAbout\n----------------------\n\nWritten by Gudmundur F. Adalsteinsson (2013-2014). This code is intended as a supplement to a journal article ([arXiv:1404.5653](http://arxiv.org/abs/1404.5653)) and a thesis ([Paper 8916](http://digitalcommons.mcmaster.ca/opendissertations/8916)) to promote reproducible research in computational science.\n\nCopyright (c) 2014 Gudmundur Adalsteinsson (MIT License). See file LICENSE for license and warranty details.\n\nInstallation and requirements\n----------------------\n\nTo use, it is simplest to change the current directory to the folder SpESO. The main files can then be executed directly (a path command temporarily adds the functions folder to the current path). The execution time might be about an hour for SpESO. Once complete, the plotting scripts can be used to visualize the saved results (which are in .mat files).\n\nRequires a wavelet package (MATLAB's Wavelet Toolbox, WaveLab) but can also be used with the supplied CDF 9/7 transform. Package type is set with the DWTTYPE parameter.\n\n\nReproducible Research\n----------------------\n\nThe classical branches of science are deductive and empirical science. In the last few decades, a third branch has emerged: computational science.\n\n\"Scientific Computation is emerging as absolutely central to the scientific method. Unfortunately,\nit is error-prone and currently immature: traditional scientific publication is\nincapable of finding and rooting out errors in scientific computation; this must be recognized\nas a crisis. Reproducible computational research, in which the full computational environment\nthat produces a result is published along with the article, is an important recent\ndevelopment, and a necessary response to this crisis.\" [15 Years of Reproducible Research in\nComputational Harmonic Analysis](http://statweb.stanford.edu/~donoho/Reports/2008/15YrsReproResch-20080426.pdf)\n", 
  "id": 18085739
}