{
  "read_at": 1462553683, 
  "description": "Particle Metropolis-Hastings using gradient and Hessian information", 
  "README.md": "pmh-stco2015\n====\n\nParticle Metropolis-Hastings using gradient and Hessian information\n\nThis code was downloaded from < https://github.com/compops/pmh-stco2015 > or from < http://liu.johandahlin.com/ > and contains the code used to produce the results in the papers\n\n* J. Dahlin, F. Lindsten and T. B. Schon, *Particle Metropolis-Hastings using gradient and Hessian information*. Statistics and Computing, Volume 25, Issue 1, pp 81-92, Springer, 2015.\n\n* J. Dahlin, F. Lindsten and T. B. Schon, *Second-order particle MCMC for Bayesian parameter inference*. Proceedings of the 18th World Congress of the International Federation of Automatic Control (IFAC), Cape Town, South Africa, August 2014. (accepted for publication)\n\n* J. Dahlin, F. Lindsten and T. B. Schon, *Particle Metropolis Hastings using Langevin Dynamics*. Proceedings of the 38th International Conference on Acoustics, Speech, and Signal Processing (ICASSP), Vancouver, Canada, May 2013.\n\nThe papers are available as a preprint from < http://arxiv.org/abs/1311.0686 > and < http://liu.johandahlin.com/ >.\n\nRequirements\n--------------\nThe program is written in Python 2.7 and makes use of NumPy 1.7.1, SciPy 0.12.0, Matplotlib 1.2.1, Pandas. Please have these packages installed, on Ubuntu they can be installed using \"sudo pip install --upgrade *package-name* \".\n\nIncluded files\n--------------\n**runmeLGSSfapf.py**\nGenerates a plot similar to Figure 3 in *Particle Metropolis-Hastings using gradient and Hessian information* using the fully-adapted particle filter and the fixed-lag smoother for estimating the negative Hessian. \n\n**runmeLGSSbpf.py**\nGenerates a plot similar to Figure 1 in *Second-order particle MCMC for Bayesian parameter inference* using the bootstrap particle filter and the filter smoother for estimating the negative Hessian. \n\n**runmeHWSVbpf.py**\nGenerates a plot similiar to Figure 2 in *Second-order particle MCMC for Bayesian parameter inference* using the filter smoother for estimating the negative Hessian and the bootstrap particle filter.\n\nSupporting files\n--------------\n**pmh.py**\nDefines the general class for the particle MH algorithm and helper functions for this.\n\n**smc.py**\nDefines the general class for sequential Monte Carlo algorithm.\n\n**classes.py**\nDefines the different system models and generates the data.\n\n**helpers.py**\nDefines different helpers for the other functions.\n", 
  "id": 18289436
}