{
  "read_at": 1462550626, 
  "description": "[3DUNDERWORLD-SLS] High-accuracy Structured-Light Scanner. ", 
  "README.md": "3DUNDERWORLD-Structured-Light-Scanner\n=====================================\n\n[3DUNDERWORLD-SLS] High-accuracy Structured-Light Scanner\n\nThe primary objective of this project is the development of an innovative hardware and software solution for the rapid scanning and 3D reconstruction of objects. The system will address the complexities and problems associated with the data acquisition, processing and reconstruction of objects situated underwater. The development of such a system will enhance the techniques available to underwater archaeologists and exploration groups in general, since it will significantly accelerate the documentation and mapping process.\n\nDeveloped by: Kyriakos Herakleous, Charalambos Poullis (http://www.poullis.org). Immersive and Creative Technologies Lab (http://www.theICTlab.org), Cyprus University of Technology\n\nPart of the 3DUNDERWORLD project: http://www.3dunderworld.org\n\n*IMPORTANT: To use this software, YOU MUST CITE the following in any resulting publication:*\n\n@article{herakleous20143dunderworld,\n  title={3DUNDERWORLD-SLS: An Open-Source Structured-Light Scanning System for Rapid Geometry Acquisition},\n  author={Herakleous, Kyriakos and Poullis, Charalambos},\n  journal={arXiv preprint arXiv:1406.6595},\n  year={2014}\n}\n\n@article{poullis2013framework,\n  title={A Framework for Automatic Modeling from Point Cloud Data},\n  author={Poullis, Charalambos},\n  journal={Pattern Analysis and Machine Intelligence, IEEE Transactions on},\n  volume={35},\n  number={11},\n  pages={2563--2575},\n  year={2013},\n  publisher={IEEE}\n}\n\n@inproceedings{poullis2009automatic,\n  title={Automatic reconstruction of cities from remote sensor data},\n  author={Poullis, Charalambos and You, Suya},\n  booktitle={Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on},\n  pages={2775--2782},\n  year={2009},\n  organization={IEEE}\n}\n", 
  "id": 18800881
}