{
  "read_at": 1462550815, 
  "description": null, 
  "README.md": "This prototypical application was developed under the \"Audiominer\" project which dealt with researching new methods of identifying, characterizing and isolating \"sound objects\".\nHere's a general description :\nhttp://www.ofai.at/research/impml/projects/audiominer.html\n\nIt features some basic possibilities of a specific Constant-Q type time-frequency representation developped by the NUHAG and the OFAI (http://arxiv.org/pdf/1210.0084v1.pdf).\nThe CQ-NSGT algorithm overcomes the lack of invertibility of classical constant-Q transform implementations.\nThis transform can be used with linear frequency scales, logarithmic ones and perceptually informed Mel scales; relevant for musical applications. These have the nice property to enable pitch shifts - musical transpositions - by introducing an offset on the frequency scale while preserving overtone structures.\n\nThe simple cross-platform interface uses the Python NSGT package (http://grrrr.org/data/dev/nsgt/) to translate, cut and isolate regions in a time-frequency representation of audio signals. It enables to save the modifications and compare the resulting signal with the original one. \n\nExport is possible in .wav or .aiff, 24 bits.\n\n![Alt text](./interface.png?raw=true)\n\n#### Paint Mode\n\nThis mode allows to delete or isolate regions of the spectrogram by painting an overlying mask. To do so the user has at its disposal a tool brush defined by its size, shape, opacity and hardness. By default, this brush is circular but the XY_ration enables to be more accurate on either the time or frequency dimension. The painting can be constrained to one of the two axis by maintaining the 'x' or 'y' key pressed.\nThe 'Switch Mask' function permits to isolate a deleted region or delete an isolated region. The user can visualize the original or modified spectrogram and the mask in itself. The latter can be saved as a .npz file and loaded later if the signal and the CQ-NSGT parameters remain the same.\n\n#### Shift Mode\n\nThis Shift Mode enables to move the spectrogram according to the time and frequency dimensions. One of the main properties of the CQ-NSGT is that logarithmic and Mel scales can be used, allowing musical transposition by vertically shifting the time-frequency representation.\nAs previously, those modifications can be limited to either one of the two axis.\n\n## Dependencies\n\nPython 2.7\n\npyaudio\n\nPyQt4\n\nnumpy\n\nscikits.audiolab\n\nnsgt (http://grrrr.org/data/dev/nsgt/)\n\nOpenGL\n\n\n######CC BY-NC-SA 3.0\n", 
  "id": 19078194
}