{
  "read_at": 1462550811, 
  "description": "code for ICIP paper on correcting camera shake by sparse approximation", 
  "README.md": "Correcting Camera Shake by Incremental Sparse Approximation\n=================================================\n\nThis package contains a MATLAB implementation of the method described in [1] and results from this method. The code was developed by modifying the L1/L2 blind deconvolution method [2] and employs the SPG solver `minConf_SPG`, available at [3].\n\n(c) Paul Shearer, 2012. Permission to use, copy, and modify this code is given for academic research purposes only. Commercial use without permission is prohibited.\n\nStartup Notes\n-------------\n\n- To add the package's subfolders to your path, use the startup_cam script. \n- To avoid clashes between this package's functions and existing functions on your MATLAB path, it may be helpful to remove your working directory from the path before starting.\n\nKey Scripts\n-----------\n\n- `./test_blind_deconv`: deconvolves an image provided as a matlab array or as a file (e.g. mukta.jpg), or an image from the Levin test set.\n- `./decon_levin_testset`: reproduces the results of [1] on Levin et al's test set of 32 test images.\n- `./show_levin_results`: shows the MSE results of our run on Levin's data\n- `./benchmark_results_slideshow`: slideshow comparing the three methods in the paper on all 32 test images from the Levin set.\n\nCode flow for `test_blind_deconv`\n--------------------------------\n\n    [kernel estimation]\n    >> ms_blind_deconv\n       >> ss_blind_deconv\n         - update x using projected gradients\n         - update k using minConf_SPG\n       - upsample PSF and image and repeat ss_blind_deconv\n    [nonblind deconvolution with estimated kernel]\n\nData (in `./data`):\n-----------------\n    im*ker* : Levin's test set (4 images, 8 kernels)\n    isep*   : results on Levin test set, our algorithm\n    diagfe* : results on Levin test set, Levin et al's marginalization algorithm\n    babacan_results.mat : results on Levin test set, Babacan et al's variational Bayes algorithm \n\n\nReferences\n----------\n[1] Paul Shearer, Anna C. Gilbert, Alfred O. Hero III. Correcting Camera Shake by Incremental Sparse Approximation. [arXiv link, 2013]\n\n[2] D. Krishnan, T. Tay, and R. Fergus, \"Blind deconvolution using a normalized sparsity measure,\" in IEEE Conference on Computer Vision and Pattern Recognition, 2011, pp. 233-240.\n\n[3] Mark Schmidt, http://www.di.ens.fr/~mschmidt/Software/minConf.html", 
  "id": 19210072
}