{
  "read_at": 1462546629, 
  "description": "The code takes as an input a time series vector of calcium observationsand produces samples from the posterior distribution of the underlying spike in continuous time.", 
  "README.md": "[![Join the chat at https://gitter.im/epnev/ca_source_extraction](https://badges.gitter.im/Join%20Chat.svg)](https://gitter.im/epnev/ca_source_extraction?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=badge)\n\nMCMC spike inference in continuous time\n==========================\n\nThe code takes as an input a time series vector of calcium observations\nand produces samples from the posterior distribution of the underlying\nspike in continuous time. The code also samples the model parameters\n(baseline, spike amplitude, initial calcium concentration, firing rate,\nnoise variance) and also iteratively re-estimates the discrete time\nconstant of the model. More info can be found at\n\nPnevmatikakis, E., Merel, J., Pakman, A. &amp; Paninski, L. (2014).\nBayesian spike inference from calcium imaging data. Asilomar Conf. on\nSignals, Systems, and Computers. http://arxiv.org/abs/1311.6864\n\nFor initializing the MCMC sampler, the algorithm uses the constrained deconvolution method maintained separately in https://github.com/epnev/constrained-foopsi\n\n### Note\n\nThis code is still in beta mode. For questions join the chat room (see the button above) or open an issue.\n\n### Contributors\n\nEftychios A. Pnevmatikakis, Simons Foundation\n\nJohn Merel, Columbia University\n\nLicense\n=======\n\nThis program is free software; you can redistribute it and/or\nmodify it under the terms of the GNU General Public License\nas published by the Free Software Foundation; either version 2\nof the License, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program.  If not, see <http://www.gnu.org/licenses/>.\n", 
  "id": 19474537
}