{
  "read_at": 1462546552, 
  "description": "Pose Aligned Networks for Deep Attribute Modeling matlab code used for the publication here: http://arxiv.org/abs/1311.5591", 
  "README.md": "PANDA code\n=============\nPANDA (Pose-Aligned Networks for Deep Attibute) is an attribute classification system using deep neural nets. This work is created by Ning Zhang, Manohar Paluri, Marc'Aurelio Ranzato, Trevor Darrell and Lubomir Bourdev.\n\n### Citing this work\nIf you are using this code for your research, please cite the following paper:\n\n    @inproceedings{ZhangCVPR14,\n        Author = {Zhang, Ning and Paluri, Manohar and Rantazo, Marc'Aurelio and Darrell, Trevor and Bourdev, Lubomir},\n        Title = {PANDA: Pose Aligned Networks for Deep Attribute Modeling},\n        Booktitle = {Conference on Computer Vision and Pattern Recognition (CVPR)},\n        Year = {2014}\n    }\n\n### Prerequisites\n0. **Caffe**\n  - Download caffe from Ning Zhang's caffe fork https://github.com/n-zhang/caffe\n  - Put caffe directory inside pose-aligned-deep-networks/\n\n0. **Poselet Detection (only if you need to run on your own data)** \n\nWe provide cached poselet detections for Berkeley Attribute Dataset used in the papaer. If you want to use your own data, you have to \n  - Download poselet detection code from http://www.cs.berkeley.edu/~lbourdev/poselets/\n  - Run poselet detection on your images. The code returns poselet activations clustered into person hypotheses\n  - Match the hypotheses to your ground truths, taking into account the overlap and score. See Section 5 of [1] for details.\n  - Substract 1 from poselet_id inside phits to make them compatible to the PANDA version.\n\n0. **MATLAB**\n  - The software is tested on MATLAB R2012b and R2012a versions.\n\n### Usage\n  - run.m is the main function to reproduce the results on Berkeley Attribute Dataset in the paper. The dataset can be downloaded from http://www.cs.berkeley.edu/~lbourdev/poselets/.\n  - All the cached features can be found at http://www.eecs.berkeley.edu/~nzhang/codes/panda_caches.tgz.\n\n### License\nThis software is under BSD License, please refer to LICENSE file. We also provide an additional patent grant. \n\n### Bug report\nIf you have any issues running the codes, please report issues on github page. If you want to contribute to the codes, please follow the instructions in CONTRIBUTING.md. If you have any questions about the paper, please contact Ning Zhang (nzhang@eecs.berkeley.edu).\n\n[1] Lubomir Bourdev and Jitendra Malik. Poselets: Body Part Detectors Trained Using 3D Human Pose Annotations. In ICCV 2009.\n \n", 
  "id": 19517172
}