{
  "read_at": 1462546699, 
  "description": "N-Way shape blender plugin (with weight controller plugin) for Maya", 
  "README.md": "N-Way Blender and Weight Controller plugins for Maya\r\n/**\r\n * @brief N-Way Blender and Weight Controller plugins for Maya\r\n * @section LICENSE The MIT License\r\n * @section requirements:  Eigen 3:  http://eigen.tuxfamily.org/\r\n * @section Autodesk Maya: http://www.autodesk.com/products/autodesk-maya/overview\r\n * @section (included) AffineLib: https://github.com/shizuo-kaji/AffineLib\r\n * @version 0.20\r\n * @date  18/Jul/2015\r\n * @author Shizuo KAJI\r\n */\r\n\r\nTwo or more shapes are being blended according to the user specified weights.\r\nWeights can be specified numerically or using the included Weight Controller plugin\r\nbased on the generalised barycentric weight.\r\n\r\nFor the detail of the algorithm, refer to the paper\r\n* \"Tetrisation of triangular meshes and its application in shape blending\" by S. Kaji.\r\nhttp://arxiv.org/abs/1601.04816\r\n\r\nHow to compile:\r\n* For Mac users, look at the included Xcode project file ( or Makefile )\r\n* For Windows users, look at the included Visual Studio project file.\r\nPlease refer to Autodesk's web page for detail.\r\n\r\nHow to use:\r\n1. Place the plugin files in \"MAYA_PLUG_IN_PATH\" (*.mll for windows, *.bundle for mac)\r\n2. Place the UI python script files in \"MAYA_SCRIPT_PATH\" (ui_*.py)\r\n3. Open Script editor in Maya and type in the following Python command:\r\n\r\n    import ui_nwayBlender as ui\r\n    ui.UI_NwayBlender()\r\n    import ui_weightController\r\n    ui_weightController.UI_WeightController()\r\n\r\n\r\nFirst, create an N-Way blender deformer\r\nby selecting (shift+click) target shapes and clicking \"create\" in the UI menu.\r\nThe last shape will be deformed.\r\nOptionally, create a weight controller node by selecting control points\r\nand clicking \"create\" in the UI.\r\nThen, connect output of the controller to the input of N-Way blender by clicking \"Out2Nway.\"\r\nNow the target shape is deformed by moving the controller object around.\r\nLook at the included jpg and video files for details.\r\n\r\nTo visualise ARAP energy, go to \"Display\" => \"Polygon\" => \"Custom Polygon Display\"\r\nand tick \"color\" and select type \"emission.\"\r\n\r\nLIMITATION:\r\nThe ARAP version works only on \"clean\" meshes.\r\nFirst apply \"Cleanup\" from \"Mesh\" menu\r\nto remove zero area faces and zero length edges.\r\n\r\n", 
  "id": 19746770
}