{
  "read_at": 1462546751, 
  "description": "Pyflation is a Python package for calculating cosmological perturbations during inflationary expansion of the universe.", 
  "README.txt": "*********\nPyflation\n*********\n\nIntroduction\n============\n\nPyflation is a Python package for calculating cosmological perturbations during\ninflationary expansion of the universe. \n\nPyflation was created by Ian Huston (http://www.ianhuston.net) while at \nQueen Mary, University of London (http://www.qmul.ac.uk).\n\nOnce installed the modules in the pyflation package can be used to run \nsimulations of different scalar field models of the early universe.\n\nThe main classes are contained in the cosmomodels module and include \nsimulations of background fields and first order and second order perturbations.\nThe sourceterm package contains modules required for the computation of the \nterm required for the evolution of second order perturbations.\nThe analysis package contains routines to calculate the first order \nFirst and Second order perturbations can be calculated for single field models \nbut only first order perturbations can be evolved for multi-field models.\n\nAlongside the Python package, the bin directory contains Python scripts which \ncan run first and second order simulations.\nA helper script called \"pyflation_qsubstart.py\" sets up a full second order run (including \nbackground, first order and source calculations)\nto be used on queueing system which contains the \"qsub\" executable (e.g. a Rocks \ncluster).\n\nInstallation of the code is described in the INSTALL.txt file. The pyflation\npackage can be installed as a normal Python package to the site-packages \ndirectory or each run of the code can be self-contained with code, results and \nlogs all contained in a run directory.\n\nThe \"pyflation_newrun.py\" script creates a new run directory and populates it with the \ncode and sub-directories which are required.\nIn particular the file \"provenence.log\" in the \"applogs\" directory contains \ninformation about the version of the code and system libraries at the time of \nthe creation of the run.\n\nMore information about Pyflation is available at the website \nhttp://pyflation.ianhuston.net. Online documentation is available at \nhttp://pyflation.ianhuston.net/docs. \n\nFor copyright and license information please see the LICENSE.txt file. For \ninstallation information see the INSTALL.txt file. For usage information see \nthe USAGE.txt file.\n\nRelevant Publications\n=====================\n\nPyflation has been used to generate results for peer-reviewed publications \nincluding\n\n* Ian Huston, Adam Christopherson, Calculating Non-adiabatic Pressure \n  Perturbations during Multi-field Inflation, \n  Physical Review D85, 063507 (2012), http://arXiv.org/abs/1111.6919\n* Ian Huston, Karim A. Malik, Second Order Perturbations During Inflation \n  Beyond Slow-roll, \n  Journal of Cosmology and Astroparticle Physics 10(2011)029, \n  http://arXiv.org/abs/1103.0912\n* Ian Huston, Karim A. Malik, Numerical calculation of second order perturbations, \n  Journal of Cosmology and Astroparticle Physics 09(2009)019, \n  http://arXiv.org/abs/0907.2917\n  \nAs a courtesy please cite one or more of these\npapers in any publication which uses Pyflation.\n\nAcknowledgements\n================\n\nThis author of this software is supported by the Science & Technology Facilities \nCouncil under grants ST/G002150/1 and ST/J001546/1.\n\nThank you to Adam Christopherson, Karim Malik, David Mulryne and Jason Furtney \nfor their discussions and contributions.\n\n\n", 
  "id": 20131362
}