{
  "read_at": 1462546765, 
  "description": "Code accompanying the paper Frank van der Meulen, Moritz Schauer: Bayesian estimation of discretely observed multi-dimensional diffusion processes using guided proposals ", 
  "README.md": "BayesEstDiffusion.jl\n====================\n\nThis repository contains code accompanying the paper\n\nFrank van der Meulen, Moritz Schauer: Bayesian estimation of  discretely observed  multi-dimensional diffusion processes using guided proposals, http://arxiv.org/abs/1406.4704\n\nAbstract: Estimation of parameters of a diffusion based on discrete time observations poses a difficult problem due to the lack of a closed form expression for the likelihood. From a Bayesian\ncomputational perspective it can be casted as a missing data problem where the diffusion bridges in between discrete-time observations are missing. Next, the computational problem can\nbe dealt with using a Markov-chain Monte-Carlo method known as  data-augmentation.\n\nHowever, if unknown parameters appear in the diffusion coefficient, direct implementation of data-augmentation results in a Markov chain that is reducible. Furthermore,\ndata-augmentation requires  efficient sampling of diffusion bridges, which can be difficult, especially in the multidimensional case.\n\nWe present a general framework to deal with with these problems that does not rely on discretisation.  The construction generalises previous approaches and sheds light on the\nassumptions necessary to make these approaches work. We illustrate our methods  using guided proposals for sampling diffusion bridges. These are Markov processes obtained by adding a\nguiding term to the drift of the diffusion.  In a number of examples we give  general guidelines on the construction of these proposals. We introduce a time changing and scaling of\nthe guided proposal process for stable numerical implementation. Two numerical  examples demonstrate the performance of our methods.\n\n\nSDE.jl\n======\nCode to simulate multivariate diffusion and diffusion bridges. \n\nSDE.jl - contains the module SDE.jl\nmisc.jl - contains some helper functions.\ntest - directory with test for SDE.jl\n\n\nInno.jl\n=======\nImplementation of the innovation scheme for the 1-dimensional example, example 6.1.\n                             \nProkarNC.jl \n===========\nImplementation of the innovation scheme for the prokaryotic auto regulation network 6.2 \nusing algorithm 1.\n\nProkarC.jl\n==========\nImplementation of the innovation scheme for the prokaryotic auto regulation network 6.2 \nusing algorithm 2.\n\n\nAddional files\n==============\nLICENSE\nREADME.md\n\nautoreg50fo.csv - observation for the autoregulation network\n\n\nSeveral programs for plotting the pictures\nplotatan.R\nplotparC.R\nplotpar.jl\nplotparNC.R\nplotparobs.jl\n\nsummary* - create a summary of all simulations\n\n\n\n", 
  "id": 20255512
}