{
  "read_at": 1462547397, 
  "description": "A tool to automatically complete the BibTex entries in Jabref using websites such as ACM and DBLP", 
  "README.md": "## INFORMATION\n\nThis is a early development status. Also it works as a proof of concept, there are non \nfunctioning buttons, and it does not find all papers, even if they are listed on the sites.\n\n## What it is:\n\nAutocomplete is a plugin for JabRef, which trys to autocomplete the entrys in your database using information provided by ACM, SpringerLink, IEEE, DBLP, CiteSeer and others.\nAt the moment these sites are implementet:\n- ACM\n- SpringerLink\n- IEEE\n- DBLP\n- CiteSeer\n- ScienceDirect\n\n## Install\n\nDownload the [JabRefAutocomplete.jar](https://github.com/gumulka/JabRefAutocomplete/blob/master/JabRefAutocomplete.jar?raw=true) Go to Plugins -> Manage Plugins. Click Install plugin, and choose the jar file. Now restart JabRef and you are done.\n\n## Use\n\nSelect one or more BibTex entrys where you wish to have more information and click the autocomplete button.\n\nAt the moment it works best, if you have a DOI spezified, otherwise it needs the title of the paper.\nIf authors are filled out, the results can get better.\n\nIf you rightclick on the plugin button, you get a settings window, where you can specify some \nadditional settings, like which library to use and if field should be automatically filled out \nif new information are available. The tool does not overwrite your entrys without your \npermission.\n\nIt would be appreciatet if you enable \"Send Debug information to developer\" to help me improve \nthe search.\n\n## Links\n\nTo use this plugin, you need: \n- [JabRef](http://jabref.sourceforge.net/)\n\nAutocomplete uses this great library:\n- [JSoup](http://jsoup.org/)\n\n\n## Contribute\nI only know about the websites, where papers are published I read. So if there are some sites, you think should be included in this tool, feel free to [mail](mailto:jabrefautocomplete@gummu.de) me with a link to an example paper on this site.\n\nPlanned:\n- arXiv.org\n- oxfordjournals.org\n", 
  "id": 20703153
}