{
  "read_at": 1462547427, 
  "README.org": "#+OPTIONS: H:2 ':nil *:t -:t ::t <:t  \\n:nil ^:t arch:headline author:t c:nil creator:comment d:nil date:t e:t email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:not-in-toc tasks:nil tex:t timestamp:t toc:nil todo:nil |:t\n#+TITLE: Jeremy Barbay's webpage\n#+AUTHOR: Jeremy Barbay\n#+EMAIL: jeremy.barbay@dcc.uchile.cl\n#+KEYWORDS: Adaptive Algorithms, Compressed Data Structures, Pedagogy\n#+LANGUAGE: en\n#+SELECT_TAGS: export\n#+EXCLUDE_TAGS: noexport\n#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t html-scripts:t html-style:t html5-fancy:t tex:t \n#+HTML_DOCTYPE: xhtml-strict\n#+HTML_LINK_HOME: index.html\n#+HTML_LINK_UP: \n#+HTML_HEAD:\n#+HTML_HEAD_EXTRA: \n#+HTML_CONTAINER: div\n#+HTML_MATHJAX:\n#+INFOJS_OPT:\n#+LATEX_HEADER:\n#+LATEX_CLASS: article\n#+LATEX_CLASS_OPTIONS:\n#+LATEX_HEADER: \\usepackage{fullpage}\n#+LATEX_HEADER_EXTRA:\n\n[[file:jeremyWithCarricatureOnGlass.jpg]]\n\n* Contact <<Contact>>\n\n  I am assistant professor in the [[Http://dcc.uchile.cl/][Department of Computer Science (DCC)]] of the [[http://www.fcfm.cl/][Faculty of Physical and Mathematical Sciences]] of the  [[http://www.uchile.cl/][University of Chile]] in Santiago, Chile. \n\n  - Physical Mail address:\n    #+BEGIN_SRC text\n      Jeremy Barbay   (a la atencion de Francia Ormena)\n      Oficina 303, tercer Piso\n      Departamento de Ciencias de la Computacion, Universidad de Chile\n      Beauchef 851,\n      C.P. 8370459 Santiago, Chile\n    #+END_SRC\n  - Phone coordinates: (GMT-3 Oct-Feb, GMT-4 Mar-Sep)\n    - Secretary ([[mailto:francia@dcc.uchile.cl][Francia Ormena]]): 56-2-2978-4365\n      - She can redirect you to my office in case of emergency.\n      - If there is no emergency, I prefer you to email me.\n    - Communication ([[mailto:comunicaciones@dcc.uchile.cl][Ana Martinez]]): 56-2-2978 0657\n    - Direccion ([[mailto:magna@dcc.uchile.cl][Magna Bornand]]): 56-2-2978-0652\n    - Fax: 56-2-2689-5531\n  - email:  mailto:jbarbay@dcc.uchile.cl\n  - web:    http://www.dcc.uchile.cl/~jbarbay\n\n* Research <<Research>>\n\nIn the field of Theoretical Computer Science, I am interested in refining the worst case analysis over instances of fixed size n by adding more parameters to it, in order to intuitively measure the \"difficulty\" of the instance. The main motivation of this technique is that the gap between practical cases (real world) and the worst case (over instances of same size as practical ones) becomes potentially larger on *massive data*: refining the analysis by adding more parameters to it allows to reduce this gap back to reasonable values, by better understanding the particularities of practical instances. Albeit a theoretician by formation, I do implement and evaluate experimentally some of my theoretical results, either in collaboration with students or by myself.\n\nThis concept applies both to the analysis of the computational cost of algorithms (leading to *Adaptive Algorithms* and Parameterized Complexity) and of the space usage of data structures (leading to *Compressed Data Structures* and *Compressed Indices*), and is pushed to its extreme with the concept of *Instance Optimality*, a property insuring the asymptotical optimality of an algorithmic construct over each single instance. Whereas the concepts of adaptive algorithms, parameterized complexity and compressed data structure were defined well before me, I was able to clarify their relations and introduced new useful concepts.\n\nSee my (partial) [[file:research.notes][research notes]] for more details.\n\n* Publications <<Publications>>\n\nNot completely correlated with [[http://scholar.google.cl/citations?user=x7L1W0rvHwsC][Google Scholar]]'s selection, I believe that my *five most impacting publications* are the following:\n\n  1. In the article \"/Efficient Fully Compressed Sequence Representations/\" [[file:publications.notes::ALGO2014][ALGO2014]], in collaboration with Francisco Claude, Travis Gagie, Gonzalo Navarro and Yakov Nekrich, we introduced the first Compressed Index achieving space within o(n H_k) + O(n) instead of merely within o(n \\lg \\sigma): previous indices were using space within o(n \\lg \\sigma) which was sometime dominating the n H_k bits used to encoded the compressed data.\n\n  2. In the article \"/On Compressing Permutations And Adaptive Sorting/\" [[file:publications.notes::TCS2013][TCS2013]], in collaboration with Gonzalo Navarro, we connected formally the concepts of compression (of permutations) and adaptive algorithms (for sorting) in the comparison model, by showing that for various adaptive sorting algorithm (in the comparison model), there is a compressed data structure for permutations which supports the operators applying this permutation and its inverse in less time than required to decomporess the permutation.\n\n  3. In the article \"/Compact Binary Relation Representations With Rich Functionality/\" [[file:publications.notes::IC2013][IC2013]], in collaboration with Francisco Claude and Gonzalo Navarro, we unified the various Compressed Data Structures for Binary Relations previously known in a single common theoretical interface, and explored in practice various implementation alternatives.\n\n  4. In the article \"/Succinct Indexes For Strings And Binary Relations/\" [[file:publications.notes::TALG2011][TALG2011]], in collaboration with Meng He, Ian J. Munro, and Srinivasa Rao, we introduced formally the concept of *Succinct Indexes*: some succinct data structures previously introduced were indexes without claiming it, nor the advantages of indexes such as their modularity (two succinct indexes supporting distinct operators can be combined into a single succinct index which supports the union of their operator sets, which is not necessarily true of two succinct data structures) or their applications to generate compressed data structures.\n\n  5. In the article  \"/Instance Optimal Geometric Algorithms/\" [[file:publications.notes::FOCS2009][FOCS2009]], in collaboration with Peyman Afshani and Timothy Chan, we gave the first applications of (input order oblivious) *Instance Optimality* to *Computational Geometry*, a fundamental result which generalize to many other problems in computational geometry. (The concept of Instance Optimality had been previously introduced by Fagin et al. on queries to databases.)\n\n\nSee my [[file:publications.notes][publications]] page for the rest of my publications in reversed chronological order: you can press \"C\" on it to see the publications sorted by categories (e.g. Chapters, Journals and Conferences), research area (e.g. Computational Geometry, Evolution Theory, etc...) or type of work (Theory or Simulations).\n\nSee [[http://scholar.google.cl/citations?user=x7L1W0rvHwsC][Google Scholar]] for some statistics on my publications, [[http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/b/Barbay:J=eacute=r=eacute=my.html][dblp]] for some other lists of my publications and [[http://arxiv.org/find/all/1/all:+AND+jeremy+barbay/0/1/0/all/0/1][Arxiv]] for some drafts.\n\n\n* Courses <<Courses>>\n\nEver since my doctorate I have been creating new teaching material and tools, and researching new educational techniques.  The reaction from students to such innovations is sometime confrontational (e.g. because it does not follow the pattern to which they are accustomed, and requires more independent work than usual) but most often enthusiastic (e.g. about the increased creativity and interactivity). The course designs of which I am the most proud are the following:\n\n1. The undergraduate research course \"*Fine Analysis* of Algorithms and Data Structures\" (translated from \"Analisis Fino de Algoritmos y Estructuras de Datos\"), composed of two phases where each student reads 8 research articles superficially; studies, presents and summarizes one small set of articles; and either works on a mini research theme or develops some mini graphical pedagogical material, and evaluates and criticizes the work of other students. It mostly features advanced variants of algorithms well known to undergraduate, in order to force them to refine their understanding of material already studied (e.g. Sequential and Binary Search refined into Doubling Search, Unary and Binary codes refined into Gamma and Delta Codes, Merge Sort refined into \"adaptive Merge Sort\", etc...). Students say in the anonymous teaching evaluation that this course is more work than other courses, but that they still liked it a lot.\n\n2. The module *Alice* of the second year undergraduate course [[http://taller-proyecto.dcc.uchile.cl:8091/modulo.html][EI2001 Taller de Proyectos]], where students design and program pedagogical 3d animations (five over the course of one semester) using the software Alice from CMU, in groups of two students: the hypothesis is that \"Teaching is Learning\", and that by reflecting and getting feedback on teaching material that they learn in the previous year, the students will deepen their understanding of it, while learning useful skills from software engineering and pedagogy. Teaching evaluations are very positive.\n\n3. The course \"*Android* - Programming Mobile Devices\" was created to support students of the University of Chile participating to the *Competition of Mobile/Android development* ([[http://www.tuapp.org/][TUApp]]) which I have been co-organizing with the company [[http://www.cursor.cl][Cursor]] and professors from other universities since 2009. Aimed at Engineering students (including students not majoring in computer science), it was designed for 30 students and received 140 inscriptions, which forced me to extend it to three courses of 30 students each (summing to 120). In total, 90 students finished the course with amazing applications over the theme of \"education\".\n\nSee my [[file:courses.notes][Courses]] webpage for more detailed information, and in particular the list of calendar of courses I taught in the past.\n\n* Supervision <<Supervision>>  \n\nI like a lot working with students (even when I am not directing them), and I am thoroughly reviewing the thesis that are assigned to me as a referee (some say I am picky), which I duly annotate in various colors using [[http://en.wikipedia.org/wiki/Xournal][Xournal]] on a Tablet PC.  I am currently supervising the following students:\n\n+ Carlos Ochoa (PhD, 2013-now) \"/Adaptive Algorithms on Convex Hull, Voronoi Diagrams and Delaunay Triangulations/\" :: Carlos is working on the adaptive computation of Delaunay Triangulations, taking advantage of the order of the input (I proved in the past [FOCS2009] that adaptive computation independent of the input order was impossible in 2 or 3 dimensions); on the implied compressed data structure for this triangulation; and on engineering another adaptive algorithm for merging Delaunay triangulations  (cosupervision with [[http://www.decom-uv.cl/pperez/?p=175][Pablo Perez-Lantero]]).\n\n+ Javiel Rojas (PhD, 2013-now) \"/Adaptive Algorithms for computing Klee's measure in High Dimension/\" :: Javiel is working on the adaptive computation of the Klee's measure of a set of rectangles in high dimensions. He is focusing first on engineering algorithms which take advantage of the degeneracy of the input, something which was not done before in computational geometry, and then on finer measures of adaptivity (cosupervision with [[http://www.decom-uv.cl/pperez/?p=175][Pablo Perez-Lantero]]).\n\nI like to work with students on topics where I bring the techniques (typically, adaptive analysis or compressed data structures) and they (or a co-advisor) bring the problems from a field I am not familiar with. I pay students to make them accountable. I require students who wish to work with me to write their own proposal after we find an intersection between our interests: the idea is that this is *their* project, and that *they* must be the ones convinced that it can be done, so that they are more motivated to resolve problems on the paths to success than if the success is based on my own conviction that the project is doable.  During the project, we meet weekly to assess the progress made and re-evaluate the objectives of the project if necessary.  I require the students to start their report at the begining of the internship and to submit updates in pdf regularly during the project.\n\nFor more details, see my [[file:Supervision/supervisedStudents.notes][past supervisions]] and my [[file:supervision.notes][supervision]] page for informations and tutorials for current and future supervised students.\n\n\n* Funding <<Funding>>\n\nI combine several source of fundings, which cover various research topics and activities.\n\n- I direct the project [[file:funding.notes::FONDECYT2012][Fondecyt Regular 1120054 \"Compressed Data Structures and Compressability Measures\"]], funded by [[http://www.conicyt.cl/][Conicyt]]. This finances my research on compressed data structures, by paying for my equipment, my travels and my students.\n  \n- I participate in the project [[file:funding.notes::AGCO][Millenium Nucleus ICM/FIC P10-024F]], funded by [[http://www.conicyt.cl/][Conicyt]]. This is a group project on the processing of network data, and massive data sets in particular. It finances our seminars, summer and winter schools, and some outreach activites in which I participate.\n\n- I dispose of a [[file:funding.notes::FII][Fundo de Incentivo a la Investigacion (FII)]] from the [[http://dcc.uchile.cl/][Department of Computer Science (DCC)]].  I use it to pay undergraduate students, furniture and exploratory research not covered by the other projects.\n\n- I manage a [[file:funding.notes::FVI][Fundo de Visitas a la Investigacion (FVI)]] from the [[Http://dcc.uchile.cl/][Department of Computer Science (DCC)]], which subventions the visit of one international guest per year. The conditions to be eligible are that the guest should stay at least 20 work days, have a doctorate, and give a presentation about his work while visiting. The money is generally enough to pay either for an international trip to Chile or from the hotel: I sometime manage to pay the other half from another project, or the visitor is paying his half. Those restrictions sometimes make it harder to find candidates, so [[mailto:jbarbay@dcc.uchile.cl][contact me]] if you are interested in such a visit!\n\nSee my [[file:funding.notes][Funding]] page for more details, and in particular for a list of publications acknowledging each source of funding.\n\n* Service <<Service>>\n\nI fulfill services mostly in the community of Theoretical Computer Science and in the university where I work, but I also participate in other communities related to pedagogy, cryptography and databases:\n- in the community of *Theoretical Computer Science*, I mostly serve as\n  - Organizer of [[file:services.notes::Events][Events]] such as Workshops and Summer/Winter schools,\n  - Speaker at [[file:services.notes::Schools][Summer/Winter Schools]]  for graduate students and researchers,\n  - Member of [[file:services.notes::PC][Program Committees]],\n  - Referee for [[file:services.notes::Journals][journals]] and [[file:services.notes::Conferences][conferences]]; while\n- in the universities where I worked, I help in *outreach activities* such as\n  - animating the stand at the annual fair for high-school students, showing pedagogical game developped by my students, or\n  - teaching courses at a summer school for high school teachers;\n- in the field of *Pedagogy* I\n  - co-organized some events ([[http://ale2011.ing.uchile.cl/][ALE2011]], Mecesup 2011), and\n  - served as a [[file:services.notes::Conferences][referee]] for research articles, engineering thesis; and\n- in the fields of *DataBases*, *Cryptography*, *Human Computer Interaction*, and *Mechanism Design* I served as a [[file:services.notes::Conferences][referee]] for research articles, Phd, master and engineering's thesis.\n\nSee my [[file:services.notes][Services]] page for more detailed information.\n\n* Experience <<Experience>>\n\nI hold the following diploma and positions:\n|    Period | Title                              | Institution                    | Country |\n|-----------+------------------------------------+--------------------------------+---------|\n|  2008-now | Assistant Professor                | Universidad de Chile           | Chile   |\n| 2004-2008 | Assistant Professor                | University of Waterloo         | Canada  |\n| 2002-2004 | PostDoctoral Fellow                | University of British Columbia | Canada  |\n| 1998-2002 | Ph.D. in Computer Science          | Universite d'Orsay             | France  |\n| 1997-1998 | M.Sc. (D.E.A.) in Computer Science | Universite d'Orsay             | France  |\n|      1997 | B.Sc. (Maitrise) in Mathematics    | Universite de Rouen            | France  |\n\n* Vita <<Vita>>\n\nI was born in France, in June 1976. I received a Bachelor of Science degree in Mathematics in 1997 in Rouen, a Master degree in 1998 and a Philosophy Doctorate in 2002, both in Computer Science at the [[https://www.lri.fr/][Laboratoire de Recherche en Informatique]] of the [[http://www.u-psud.fr/][University of Orsay]], under the supervision of [[http://www.di.ens.fr/ClaireMathieu.html][Claire Mathieu]].  I was a posdoctoral fellow at the [[https://www.cs.ubc.ca/][department of Computer Science]] of the [[https://www.ubc.ca/][University of British Columbia]] until 2004 and an assistant professor at the [[https://cs.uwaterloo.ca/][Cheriton School of Computer Science]] of the [[https://uwaterloo.ca/][University of Waterloo]] until 2008. I am now an assistant professor at the [[http://dcc.uchile.cl/][department of Computer Science]] of the [[http://www.uchile.cl/][University of Chile]] in Santiago, Chile. So far I have lived in France, United States, Canada and Chile.\n\nMy main [[file:research.notes][research]] is about the analysis of algorithms and data-structures on finer classes of instances than those merely defined by their size, which yields the concepts of *adaptive (analysis of) algorithms*, instance optimality, output sensitive and parameterized complexity, compressed data structures and indexes, and of formal measures of compressibility.  My work has contributed to clarify the relations between those topics and has introduced a few useful concepts, such as the direct relation between permutation compression and adaptive sorting ([[file:publications.notes::*2013,%20TCS,%20\"/On%20Compressing%20Permutations%20and%20Adaptive%20Sorting/\",%20J%C3%A9r%C3%A9my%20Barbay,%20Gonzalo%20Navarro][TCS2013]]); the first Compressed Index achieving space within o(n H_k) + O(n) instead of merely within o(n \\lg \\sigma) ([[file:publications.notes::*2014,%20ALGO,%20\"/Efficient%20Fully%20Compressed%20Sequence%20Representations/\",%20J%C3%A9r%C3%A9my%20Barbay,%20Francisco%20Claude,%20Travis%20Gagie,%20Gonzalo%20Navarro,%20Yakov%20Nekrich][ALGO2014]]); *Succinct Indexes* ([[file:publications.notes::*2011,%20TALG,%20\"/Succinct%20indexes%20for%20strings,%20binary%20relations%20and%20multilabeled%20trees/\",%20J%C3%A9r%C3%A9my%20Barbay,%20Meng%20He,%20J.%20Ian%20Munro,%20Srinivasa%20Rao%20Satti][TALG2011]]); and (input order oblivious) *Instance Optimality* in *Computational Geometry* ([[file:publications.notes::*2009,%20FOCS,%20\"/Instance-Optimal%20Geometric%20Algorithms/\",%20Peyman%20Afshani,%20J%C3%A9r%C3%A9my%20Barbay,%20Timothy%20M.%20Chan][FOCS2009]]).  Albeit a theoretician by formation, I did implement and experimentally evaluate some of my theoretical results, either in collaboration with students or on my own ([[publications.notes::JEA2009][JEA2009]],[[publications.notes::WEA2006][WEA2006]]).\n\nI love to help people to learn.\nI have [[file:Supervision/supervisedStudents.notes::Direction][directed]] various undergraduate and graduate students, in both theoretical and practical projects, and supervised various initiatives (creation of learner-centered courses, flipped classrooms, organization of programming competitions) in the various institutions where I have worked. \nI experiment with new pedagogical techniques as part of my teaching (e.g. organisation of [[http://www.tuapp.org/][yearly android programming contests]], creation of programming [[http://taller-proyecto.dcc.uchile.cl][Project Oriented]] courses, usage of concept questions in more traditional courses, course where university students teach [[http://www.institutodelasordera.cl][deaf high-school students]]) and designs tools to help instructors to share and evaluate collectively teaching material over time (e.g. database of solved problems, designed in 2006 at the University of Waterloo, still in use in 2012), and between institutions (https://github.com/jyby/repositorium/).\n\nI love to learn.  \nI speak native French, I am fluent in English and in Spanish, and I have studied (at the beginner's levels) various other languages for fun, such as Russian, Romanian and Farsi. \nI practice sport, regularly learning new ones (e.g. running, biking, swimming, roller blading, stilts, unicycling, juggling and occasionally blowing fire).  \nI learned computer programming on my own (in [[http://en.wikipedia.org/wiki/GFA_BASIC][GFA Basic]] on [[http://en.wikipedia.org/wiki/Atari_ST][Atari ST]]) in 1990 at the age of 14: my first project was a \"Tron\" game with scrolling windows for four players in text mode. My second project was a program to enter the house expenses, sum them up and print the whole in a achivable form. My last project on this machine was a maze generator and game for the kindergarten where my mother taught: it was used in class for some 6 years after conception. I learned the [[http://en.wikipedia.org/wiki/The_C_Programming_Language][C Programming Language]] from Kernighan and Ritchie's book in 1993 when I got to the University: my first programming course was two years later, in [[http://en.wikipedia.org/wiki/Turbo_Pascal][Turbo Pascal]]: I then read a book about it and did my project in [[http://en.wikipedia.org/wiki/Pascal_(programming_language)#Object_Pascal.2C_Turbo_Pascal][Object Turbo Pascal]]. I learned [[http://en.wikipedia.org/wiki/C%2B%2B][C++]] during my master in 1997 (programming Genetic Algorithms). I learned and taught [[http://en.wikipedia.org/wiki/Caml][CAML]], [[http://en.wikipedia.org/wiki/OCAML][OCAML]], [[http://en.wikipedia.org/wiki/Java][Java]], [[http://en.wikipedia.org/wiki/Test_driven_development][test-driven development]] as a Teaching Assistant from 1998 to 2002, and learned shell script, [[http://en.wikipedia.org/wiki/HTML][HTML]] and [[http://en.wikipedia.org/wiki/Php][PHP]] on my own. I learned [[http://en.wikipedia.org/wiki/Perl][Perl]] during my postdoctoral fellowship at UBC in 2003. I learned [[http://en.wikipedia.org/wiki/Python_(programming_language)][Python]] in 2006 as an assistant professor at the university of Waterloo, and programmed a simulator of intersection algorithms in C++. I learned (and partially taught) [[http://en.wikipedia.org/wiki/Agile_development][agile development]] between 2010 and 2012 from my students in Software Engineering. I am learning [[http://en.wikipedia.org/wiki/Elisp][ELISP]] on my own in 2013 and 2014.\n\nI love to create.\nI play and compose music (e.g. clarinette, xaphoon, bandoneon, piano,... ).\nI make some craft (drawing, etching glasses, copper and wood).\nI make some good (and artistic) cooking, with a preference for desserts.\nI love to travel and to take pictures of the people I see there, more than the places themselves.\n\nI was kicked out of kindergarten into primary school one year before the normal time because of lack of space, and kept the pace ever since, being usually one to three years younger than my classmates: I was the second youngest alumni to get a PhD from the [[http://www.u-psud.fr][University of Orsay]].\n", 
  "description": "Website", 
  "id": 20844021
}