{
  "README": "Universidad Nacional Aut\\'{o}noma de M\\'{e}xico (UNAM) Thesis style for LaTeX\nby Julio A. Freyre-Gonz\\'{a}lez (Current Maintainer)\nv2.02 (05/apr/2013)\n\nThis style provides a customizable format to typeset theses according to the Universidad Nacional Autonoma de Mexico guidelines. This is provided with support to be also used in Scientific Workplace (SWP) 3.x.\n\nThis material is subject to the LaTeX Project Public License. See License file and the latest version of this license in\n  http://www.latex-project.org/lppl.txt\nfor more details.\n\nFiles description\nBase:\n  UNAMThesis.sty -> LaTeX style package\n  UNAMThesis.bst -> Bibliographic style\n  Escudo-UNAM.eps -> UNAM Logo line art (vector graphic) used by latex/dvips\n  Escudo-UNAM.pdf -> UNAM Logo line art (vector graphic) used by PdfLaTeX\n  Escudo-IBT.eps -> IBT Logo line art (vector graphic) used by latex/dvips\n  Escudo-IBT.pdf -> IBT Logo line art (vector graphic) used by pdfLaTeX\n  UNAMThesis.tex -> Sample standard TeX file\n  UNAMThesis.pdf -> Sample standard TeX file rendered\n  testBib.bib -> Sample bibliography\nFor SWP 3.x:\n  UNAMThesis.cst -> Style file for SWP 3.x\n  Thesis - Universidad Nacional Autonoma de Mexico.shl -> Shell file for SWP 3.x\n  UNAMThesisSWP.tex -> Sample TeX file for SWP\n\n\nPackage usage\nEscudo-UNAM and Escudo-IBT must reside in your main document directory if you want to use this logos. The style looks for these files to draw the logos on the cover page. You may customize the logos using the \\logounam{path_file} and \\logoinstitute{path_file} commands in the preamble to define the files location and name.\n\nThe \\university{university name} command allows you to customize the university name, which defaults to 'Universidad Nacional Aut\\'{o}noma de M\\'{e}xico'.\n\nIn addition, \\institute{institute name}, \\rcenter{research center name}, \\faculty{faculty name}, or \\school{school name} commands allow to set the institution name that will grant the degree. The rationale for using different commands is to autoselect the correct gender for the definite article (see the second page in UNAMThesis.pdf). However, these are optional commands, in case you omit the institution name, the gender of the definite article in the title page is set by default to female ('la') to match with the gender of the word 'universidad'. You may customize it by using \\@instituteartm to set to male gender the definite article ('el') or \\@instituteartf to set it to female ('la'). The \\department{department or program name} is optional.\n\nThe style implements environments for dedication, acknowledgements, foreword, resumen and abstract. Besides, there are command versions for all these environments (except abstract because it is already implemented in SWP) named: \\makededication{...}, \\makeacknowledgements{...}, \\makeforeword{...} and \\makeresumen{...}. These command versions are useful to interface with SWP due to some bizarre restrictions in the software; so, if you are using standard LaTeX (without SWP) please use the enviroments.\n\nIn addition, this style implements an environment (quotenat) for opening quotes (quotations commonly used at the beginning of a chapter).\n\nThe UNAMThesis bibliographic style enables the use of author-year schemes using the natbib package. Citation to e-print archives (e.g. arXiv) is possible using the eprint BibTeX field.\n\n\nInstallation for SWP\nIn order to use the UNAM Thesis style with SWP 3.x you must to install the following files as indicated:\n0) For this directions, it is assumed that SWP is installed in \"C:\\swp35\\\". If it is not true, user may modify this directions replacing \"C:\\swp35\\\" by the instalation path for SWP.\n1) Copy \"Thesis - Universidad Nacional Autonoma de Mexico.shl\" to \"C:\\swp35\\Shells\\Other Documents\\SW\"\n2) Copy \"UNAMThesis.cst\" to \"C:\\swp35\\Styles\\[Special]\"\n3) Copy \"UNAMThesis.sty\" to \"C:\\swp35\\TCITeX\\TeX\\LaTeX\\contrib\"\n4) If you want to use the UNAM Thesis BibTeX bibliographic style:\n4.1) Copy \"UNAMThesis.bst\" to \"C:\\swp35\\TCITeX\\bibtex\\bst\"\n4.2) Copy your BibTeX database to \"C:\\swp35\\TCITeX\\bibtex\\bib\"\n\n\nEnjoy!\n\nPlease send your error and bug reports or suggestions for new features to the emails below.\n\nJulio A. Freyre-Gonzalez, PhD\nProfessor in Regulatory Systems Biology\nCenter for Genomic Sciences, UNAM\nAv. Universidad S/N, Col. Chamilpa, 62210\nCuernavaca, Morelos, Mexico\njfreyre@ccg.unam.mx\njfreyreg@gmail.com\nhttp://unam.academia.edu/JulioAugustoFreyreGonzalez\nhttp://www.researcherid.com/rid/B-8231-2008\n\n", 
  "read_at": 1462547421, 
  "description": "Tesis de maestria acerca de la espectroscopia por efecto Kerr en líquidos", 
  "id": 20998274
}