{
  "read_at": 1462547407, 
  "description": "Material para el curso \"Visualización de datos con D3.js\"", 
  "README.md": "# Introduccion a D3\n\nMaterial para el curso _Visualizacion de datos con D3.js_, dictado en Julio de 2014 por [Masega](www.masega.co) en conjunto con [Poderomedia Academy](www.poderomedia.org).\n\n[Descargar los ejemplos](https://github.com/masegalab/curso-d3-basico/blob/master/dist/curso-d3.zip?raw=true)\n\n## Uso\n\nEl material para el curso esta compilado y listo para usar. Para usar la version compilada, bajar y descomprimir el archivo curso-d3.zip y abrir el archivo `index.html`. Para los ejemplos que necesitan datos externos (archivos JSON o CSV), se require usar un servidor web estatico para servir los archivos. Usando Python, se puede crear un servidor facilmente usando la linea de comandos (desde el directorio con el codigo):\n\n    $ python -m SimpleHTTPServer\n\ny luego abrir la siguiente URL en el browser: [http://localhost:8000](http://localhost:8000).\n\nLas secciones del curso contienen bloques de codigo y el resultado de ejecutar el codigo. Los bloques de codigo son ejecutables y editables, se pueden modificar y ejecutar. Algunos bloques de codigo dependen de bloques precedentes y tienen que ser editados en orden.\n\n![Screenshot](assets/img/screenshot-ejemplo.png)\n\nPara entender mejor los ejemplos, se puede examinar la estructura de las paginas usando las [Developer Tools](https://developer.chrome.com/devtools/index) del browser.\n\n## Compilar\n\nPara compilar el contenido del curso, se necesita Node, Grunt, Bower y Jekyll. Asumiendo que estos programas estan instalados, los comandos necesarios para instalar las dependencias y compilar el contenido son:\n\n    $ npm install    # Instala los paquetes de Node necesarios\n    $ bower install  # Instala las dependencias front-end\n    $ grunt less     # Compila los estilos\n    $ jekyll build --config _static.yml\n\nEsto generara el directorio `curso-d3`, que tiene el contenido para ser usado de forma estatica.\n\n## Datasets\n\n- [Dolphin Social Network](http://infochimps.org/datasets/dolphin-social-network)\n   An undirected social network of frequent associations between 62 dolphins in a community living off Doubtful Sound, New Zealand. Additional information on the network can be found in:\n\n    - D. Lusseau, The emergent properties of a dolphin social network,\n    Proc. R. Soc. London B (suppl.) 270, S186-S188 (2003).\n\n    - D. Lusseau, Evidence for social role in a dolphin social network,\n    Preprint q-bio/0607048 (http://arxiv.org/abs/q-bio.PE/0607048)\n\n", 
  "id": 21168709
}