{
  "read_at": 1462547384, 
  "description": "The code required to path-reverse a graph to find the density decomposition and density signature of a graph. Also the code required to generate random graphs using the density signature.", 
  "README.md": "Density-Signature\n=================\n\nHere you will find the code required to path-reverse a graph to find its density decomposition and density decomposition. Also you will find the code required to generate random graphs using the density decomposition.\n\nContact: tmigler@gmail.com\n\nInformation about the algorithms can be found here: http://arxiv.org/abs/1405.1001\n\n## What is included:\nThe code  is written in Python, using the igraph library. \ndensity_signature.py includes the functions to find the density decomposition and density distribution. models.py includes the functions to generate random graphs using the density distribution.\nInput graphs should be in .gml format. I have included two .gml files. One is an undirected social network of frequent associations between 62 dolphins in a community living off Doubtful Sound, New Zealand. The other is a network of coauthorships between scientists posting preprints on the Condensed Matter E-Print Archive between Jan 1, 1995 and December 31, 1999. These networks are made available by Mark Newman here: http://www-personal.umich.edu/~mejn/netdata/\n\n\n## Usage:\nHere is an example involving the coauthorship network.\n\n\\>\\>\\> graph = Graph.Read_GML(\"/Desktop/phys.gml\")\n\n\\>\\>\\> hgraph = PathReversal(graph)            \n\n16726\n\n\\>\\>\\> boxes = DensityDecomposition(hgraph)\n\nGraph is directed\n\nGraph is boxed\n\nVertex degrees match box numbers\n\n\\>\\>\\> boxes[0]\n\n[462, 2869, 3832, 3568, 2499, 1589, 1018, 362, 221, 278, 28]\n\n\\>\\>\\> modelgraph = RDDmodel(boxes[0])\n\n(28, 10)\n\n(278, 9)\n\n(221, 8)\n\n(362, 7)\n\n(1018, 6)\n\n(1589, 5)\n\n(2499, 4)\n\n(3568, 3)\n\n(3832, 2)\n\n(2869, 1)\n\n16726\n\nNo paths reversed\n\n\\>\\>\\> modelgraph2 = HSWmodel(boxes[0],.5)\n\n(278, 9)\n\n(221, 8)\n\n(362, 7)\n\n(1018, 6)\n\n(1589, 5)\n\n(2499, 4)\n\n(3568, 3)\n\n(3832, 2)\n\n(2869, 1)\n\n>>> \n\nFor reference, the PathReversal took 6 minutes and the RDDmodel took 4.\n", 
  "id": 21218310
}