{
  "README": "############################# BEGIN FRONTMATTER ################################ \n#                                                                              # \n#   TEA - calculates Thermochemical Equilibrium Abundances of chemical species #\n#                                                                              #\n#   TEA is part of the PhD dissertation work of Dr. Jasmina                    #\n#   Blecic, who developed it with coding assistance from                       #\n#   undergraduate M. Oliver Bowman and under the advice of                     #\n#   Prof. Joseph Harrington at the University of Central Florida,              #\n#   Orlando, Florida, USA.                                                     #\n#                                                                              #\n#   Copyright (c) 2014-2016 University of Central Florida                        #\n#                                                                              #\n#   This program is reproducible-research software: you can                    #\n#   redistribute it and/or modify it under the terms of the                    #\n#   Reproducible Research Software License as published by                     #\n#   Prof. Joseph Harrington at the University of Central Florida,              #\n#   either version 0.3 of the License, or (at your option) any later           #\n#   version.                                                                   #\n#                                                                              #\n#   This program is distributed in the hope that it will be useful,            #\n#   but WITHOUT ANY WARRANTY; without even the implied warranty of             #\n#   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the              #\n#   Reproducible Research Software License for more details.                   #\n#                                                                              #\n#   You should have received a copy of the Reproducible Research               #\n#   Software License along with this program.  If not, see                     #\n#   <http://planets.ucf.edu/resources/reproducible/>.  The license's           #\n#   preamble explains the situation, concepts, and reasons surrounding         #\n#   reproducible research, and answers some common questions.                  #\n#                                                                              #\n#   This project was started with the support of the NASA Earth and            #\n#   Space Science Fellowship Program, grant NNX12AL83H, held by                #\n#   Jasmina Blecic, Principal Investigator Joseph Harrington, and the          #\n#   NASA Science Mission Directorate's Planetary Atmospheres Program,          #\n#   grant NNX12AI69G.                                                          #\n#                                                                              #\n#   See the file ACKNOWLEDGING in the top-level TEA directory for              #\n#   instructions on how to acknowledge TEA in publications.                    #\n#                                                                              #\n#   We welcome your feedback, but do not guarantee support.                    #\n#   Many questions are answered in the TEA forums:                             #\n#                                                                              #\n#   https://physics.ucf.edu/mailman/listinfo/tea-user                          #\n#   https://physics.ucf.edu/mailman/listinfo/tea-devel                         #\n#                                                                              #\n#   Visit our Github site:                                                     #\n#                                                                              #\n#   https://github.com/dzesmin/TEA/                                            #\n#                                                                              #\n#   Reach us directly at:                                                      #\n#                                                                              #\n#   Jasmina Blecic <jasmina@physics.ucf.edu>                                   #\n#   Joseph Harrington <jh@physics.ucf.edu>                                     #\n#                                                                              #\n############################## END FRONTMATTER #################################\n\n\nThe Start Guide with basic instructions on how to install and run TEA\nis: doc/start_guide.txt\n\nFor more detailed instructions read the TEA User Manual: doc/TEA-UserManual.pdf\nFor code description read: doc/TEA-CodeDescription.pdf\n\nThe TEA Theory paper is published in The Astrophysical Journal Supplement Series\nand also available here: doc/TEA-TheoryPaper.pdf \n\nThe compendium for this paper can be find on zenodo.org, entitled \nRRC-BlecicEtal-2016-ApJS-TEA, http://dx.doi.org/10.5281/zenodo.50378.\n \nThe compendium for the arXiv version 1 of this paper, \nhttp://arxiv.org/abs/1505.06392, can be find\nhere: https://github.com/dzesmin/RRC-BlecicEtal-2015a-ApJS-TEA\n\nCompletely executed TEA examples can be find in a separate repository: \nhttps://github.com/dzesmin/TEA-Examples\n\nThe reproducible-reserach license and how to acknowledge TEA files are placed \nin the root directory: RR-LICENSE-0.3.txt, ACKNOWLEDGING-TEA\n\n", 
  "read_at": 1462547235, 
  "description": "Thermochemical Equilibrium Abundances (TEA), a code to calculate gaseous molecular abundances under thermochemical equilibrium conditions", 
  "id": 21224860
}