{
  "README.markdown": "# Why this project?\n\nBecause the patent system is waaay out of whack. I actually got the idea after listening to the recent [This American Life][1] report on Intellectual Ventures. A quote from programmer Stephan Brunner about software patents struck me especially: \n\n> \"I worked on a whole bunch of patents in my career over the years and I have to say that every single patent is nothing but crap.\" Brunner says software patents on his own work don't even make sense to him. \"I can't tell you for the hell of it what they're actually supposed to do. The company said we have to do a patent on this. ... Personally, when I look at them, I'm not proud at all. It's just like mungo mumbo jumbo that nobody understands and makes no sense from an engineering standpoint whatsoever.\" \n\nI remembered having a great time with a site called [arXiv vs. snarXiv][2], in which you try to guess which is a real paper title (from the physics [arXiv][3]) and which is generated from a context-free gramar. So loads of credit goes to [David Simmons-Duffin][4] for this [idea][5] and some code to do the text generation with context-free grammar. (Hit up the [link][6] for details.)\n\nThere are many who have written eloquently on this subject, and I will not try to match them! But below are a few links about the problem. They were assembled by a search of recent [Hacker News][7] posts in my RSS feed reader. \n\n  * [When patents attack!][1], an excellent investigative report that aired recently on [This American Life][8], over at NPR.\n  * [Patents against prosperity][9]\n  * [The Supreme Court Should Invalidate Software Patents][10]\n  * [The cost of patent trolls][11]\n  * [The failed experiment of software patents][12]\n  * The [Electronic Fronteer Foundation][13] has some good resources\n\nWhere does the name come from, you might ask? It's a bit of a play on words suggested by my philosophy of science professor (Brian Keeley, from Pitzer). The USPTO is the US Patent Office, and the greek root [ptosis][14] means \"falling\" or \"fall.\" Repartitioning the word USPTOSIS yields a (perhaps stretched) social commentary on our current patent system.\n\nI'm still in the process of adding features to this site, like statistics and (fake) patent abstracts and improving the context-free grammar for maximum lulz. But feel free to shoot me an email at npisenti@gmail.com if you have comments or suggestions, or find me on [twitter][15]! You can find the code on github: [https://github.com/npisenti/usptosis][16]\n\n   [1]: http://n.pr/q840zv\n   [2]: http://bitly.com/owoUxo\n   [3]: http://bitly.com/pSVduX\n   [4]: http://davidsd.org/about/\n   [5]: http://bitly.com/osrX50\n   [6]: http://davidsd.org/2010/03/the-snarxiv/\n   [7]: http://news.ycombinator.com/\n   [8]: http://www.thisamericanlife.org/\n   [9]: http://econ.st/nGmwj1\n   [10]: http://onforb.es/oGwHje\n   [11]: http://reut.rs/qTjPt5\n   [12]: http://bit.ly/oP2cWa\n   [13]: http://bit.ly/qJIV8Q\n   [14]: http://www.etymonline.com/index.php?term=ptosis\n   [15]: https://twitter.com/npisenti\n   [16]: https://github.com/npisenti/usptosis\n\n\n", 
  "read_at": 1462547064, 
  "description": "", 
  "id": 2131101
}