{
  "read_at": 1462550980, 
  "description": "Paper: inexact GMRES with fast multipole method and low-p relaxation", 
  "README.md": "inexact-gmres\n=============\nRepository of the source files for our manuscript, submitted for peer review. Includes all the LaTeX source and image files, as well as Python plotting scripts to produce the images.\n\n**Paper Title:**\n\n*\"Inexact Krylov iterations and relaxation strategies with fast-multipole boundary element method\"*\n\n**Tingyu Wang**[1],\n**Simon K. Layton**[2]\nand **Lorena A. Barba**[1]\n\n[1] Department of Mechanical and Aerospace Engineering, The George Washington University, Washington DC, 20052\n[2] Department of Mechanical Engineering, Boston University, Boston, MA 02215; currently at Nvidia, Corp., Santa Clara, CA\n\n[arxiv:1506.05957](http://arxiv.org/abs/1506.05957)\n\n**Abstract**\n\nBoundary element methods produce dense linear systems that can be accelerated via multipole expansions. Solved with Krylov methods, this implies computing the matrix-vector products within each iteration with some error, at an accuracy controlled by the order of the expansion, *p*. We take advantage of a unique property of Krylov iterations that allow lower accuracy of the matrix-vector products as convergence proceeds, and propose a relaxation strategy based on progressively decreasing *p*. \n In extensive numerical tests of the relaxed Krylov iterations, we obtained speed-ups of between 2.1x and 3.3x for Laplace problems and between 1.7x and 4.0x for Stokes problems. We include an application to Stokes flow around red blood cells, computing with up to 64 cells and problem size up to 131k boundary elements and nearly 400k unknowns. The study was done with an in-house multi-threaded C++ code, on a hexa-core CPU. The code is available on its version-control repository, [https://github.com/barbagroup/fmm-bem-relaxed](https://github.com/barbagroup/fmm-bem-relaxed).\n\nCorresponding author: Lorena A. Barba [labarba@gwu.edu](mailto:labarba@gwu.edu)\n\nThis work was partially supported by the National Science Foundation under award ACI-1149784.\n", 
  "id": 21439328
}