{
  "README": "voids.py\n\nv0.01: Implemented.\n\nComputes the size of every channel in a pack of spheres, as defined in\nthe paper:\n\n\"Structure characterization of hard sphere packings in amorphous and\ncrystalline states\"\n    Vitaliy Ogarko, Nicolas Rivas, Stefan Luding\n    http://arxiv.org/abs/1405.5032\n\nFor each particle, all three particle combinations of neighbors is\nconsidered, defining neighboring triangles. For each neighboring\ntriangle we compute its internal apollonius circle. This circle is\nhighly related to the free volume of the particle as, when normalized by\nthe central particle's radius, a value less than one indicates a channel\nthrough which the particle can't go through.\n\nFor more information about the analysis, please refer to the paper.\n\nINSTALLATION\n\n    Not needed, as it is a script.\n    Python 2.7 is needed.\n    python-tk package is needed. In Ubuntu:\n\tsudo apt-get install python-tk\n\nUSAGE\n\n    ./voids.py 'input_file_name' 'output_file_name' --periodic\n\n    'input_file_name':\n        Particles' number, positions and radii in the file 'input'.\n        First line of input should be the number of particles.\n        The rest of the lines should be the data for every\n        particle, in the form 'x y z r', with r the radius of the\n        particle and x, y and z its coordinates.\n\n        Example:\n\n        6\n        0.260179625853 0.583565147482 0.142286768849 0.0320041717773\n        0.164713950323 0.7764730607 0.27015467405 0.0320041717773\n        0.357592198576 0.75252722197 0.0642448910503 0.0320041717773\n        0.250547945298 0.253359791735 0.254628654942 0.0320041717773\n        0.712575326809 0.343368869233 0.948802280038 0.0320041717773\n        0.518625358274 0.645391370379 0.721315845511 0.0320041717773\n\n        A sample input file 'input' is included for reference and for\n        testing purposes.\n\n    'output_file_name'\n        Filename of the output data.\n        Each line contains, first, the particle index of the center\n        particle of the corresponding triangle, then the position of the\n        channel projected in the triangle's plane, and finally the\n        radius of the channel.\n\n    --periodic\n        If the system has periodic boundary conditions. Only full\n        periodic boundaries (in every direction) are supported for now.\n", 
  "read_at": 1462550987, 
  "description": "Structure characterization of hard sphere packings using voids.", 
  "id": 21465896
}