{
  "read_at": 1462551016, 
  "description": "Openscihub platform design.", 
  "README.md": "# Openscihub\n\nOpenscihub is an in-progress platform for open and constructive discussion\nand review of scientific articles that seeks to maximize engagement from the\nlayperson to the domain expert.\n\nFundamentally, the platform will manage and display PDFs (articles) and\nannotations (reviews), which can be created and submitted by *any* user.\nUser-defined communities will group users and articles and will serve several\npurposes:\n\n- identification of scientific pursuits and domain experts,\n- establishment of scientific canons, and\n- filtration of article reviews/discussions.\n\nUser reviews will be subject to voting and moderation to judge their relevance\nand quality and curb abuse.\n\nThe following is a broad overview of the openscihub implementation\nplan.\n\n- [Users](#users)\n- [Communities](#communities)\n- [Articles](#articles)\n- [Canons](#canons)\n- [Reviews](#reviews)\n  - [Scope](#scope)\n  - [Moderation](#moderation)\n\n## Users\n\nAnyone can join openscihub, but not everyone can join every community.\n\n## Communities\n\nCommunities are simply groups of openscihub users, and can be initiated by\nanyone. Communities will define their own membership prerequisites that\ndetermine the purview of the group. For example, a group of domain experts may\nrequire participation in a relevant conference or some proof of authorship of a\nrelevant publication, whereas a community interested in discussing general\nphysics concepts in the context of real articles may not have any prerequisites\nfor membership.\n\n## Articles\n\nScientific articles are the focus of openscihub and will be displayed *in full*\nso that they can be reviewed with annotations. This will require permission\nfrom the copyright holder and could pose a problem for previously published\narticles. Openscihub is probably best classified as a pre-print service.\nPartnerships with well-established pre-print archives (ahem,\n[arXiv](arxiv.org)) are desired.\n\nIt is openscihub's lofty dream to serve *every* scientific article, ready for\nopen discussion, by being such a successful project that publishers alter their\ncopyright agreements (we said lofty...).\n\n## Canons\n\nArticles can be submitted to and accepted by communities. This is little more\nthan a declaration of respect that the community has for the article; the\narticle becomes a piece of the *community canon*.\n\nCommunity canons will help seedling researchers learn the ropes without the\nsenseless manual traverse of citation graphs. They will be contributing\nbreakthroughs in record time, we guarantee it<sup>1</sup>! It's community\nmentorship!\n\n<sup>1</sup>*We do not guarantee it.*\n\n## Reviews\n\nA review is a layer of annotations and write-ups on an article. *Any* user (even\nnon-experts) may write a review of *any* article; however, the target audience of\na review is restricted by the status of the reviewer (more on this in the\n[following section](#review-scope)).\n\nDetails of the review interface are yet to be determined, but should allow for:\n\n- annotations anywhere on the PDF,\n- equation rendering, and/or\n- long, standalone write-ups, possibly uploaded PDF.\n\n\n### Scope\n\nOpenscihub should *never* stifle discussion, yet discussions should be useful\nfor all walks of users. Openscihub addresses this complexity with\n*review scope*.\n\nEvery reviewer must specify a set of communities as the *intended* audience.\nBy default, this set comprises the communities of which the reviewer is a\nmember. The reviewer can trim this set when appropriate (remove communities),\nbut can only add to it if she joins additional communities. In other words, the\ntarget audience is always a subset of the communities to which the reviewer\nbelongs.\n\nThe purpose of such a system is to help readers filter out those discussions\nthat would otherwise add to the noise.\n\nFor example, consider an article about some novel kind of holey-fiber\ntelecommunications waveguide. A science writer, Dave, is interested in the\narticle but is unfamiliar with photonic crystals and therefore composes a\nreview requesting more background information.  If Dave is a member of only the\ntwo openscihub communities, *public* and *science writers*, a reader from the\n*optoelectronics* community, Susan, can ignore Dave's review\n(and the resulting discussion of photonic crystals) by \"turning off\" the\n*public* and *science writers* target audiences. Similarly, Dave can ignore any\nesoteric discussions between Susan and other *optoelectronics* community\nmembers by turning off the *optoelectronics* target audience.\n\n### Moderation\n\nReviews will be subject to voting a la the well-established\nStackOverflow/Reddit models (single upvote or downvote per review per user) and\nmoderation by community moderators. Community moderators will have control over\nonly those reviews written by members of their community. All users are members\nof the public community and are therefore subject to super-moderation by the\nopenscihub anti-abuse task force :|.\n", 
  "id": 21585485
}