{
  "read_at": 1462551012, 
  "description": "Python implementation of fmflib", 
  "README.md": "# A Python API for the Full-Metadata Format\n\nThe Full-Metadata Format (FMF) is described in\n[http://arxiv.org/abs/0904.1299](http://arxiv.org/abs/0904.1299). This\nrepository contains the description and implementation of a python API\nfor the FMF.\n\n## License\n\nCopyright (c) 2014, Rectorate of the University of Freiburg\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright\n  notice, this list of conditions and the following disclaimer.\n* Redistributions in binary form must reproduce the above copyright\n  notice, this list of conditions and the following disclaimer in the\n  documentation and/or other materials provided with the distribution.\n* Neither the name of the Freiburg Materials Research Center,\n  University of Freiburg nor the names of its contributors may be used to\n  endorse or promote products derived from this software without specific\n  prior written permission.\n\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS\nIS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED\nTO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\nPARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER\nOR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n## Contents\n\n* ./README.md             -- this file\n* ./api.plantuml.txt      -- plantuml diagram source describing the API\n* ./acceptance_tests/     -- acceptance tests / use case tests for the API\n* ./streamlib/            -- the streamlib python package\n* ./pyfmflib/\n    * pyfmflib.cl1/       -- the pyfmflib.cl1 python package\n\n## Acceptance tests\n\nThe acceptance tests are based on py.test. After installing\n`pyfmflib.cl1` (requires `streamlib`), run them with\n\n```\npy.test acceptance_tests/\n```\n\nfrom the root of this repository. The API of `streamlib` and\n`pyfmflib.cl1` is implicitly defined through the acceptance\ntests. `api.plantuml.txt` makes these definitions explicit and is\nextracted from the acceptance tests.\n\n### Status\n\nThe compliance level 1 and streamlib API has converged but is still\nopen for minor changes that might become necessary during the\nimplementation.\n\n## The streamlib package\n\nThe streamlib package is the only non-builtin dependency of\npyfmflib.cl1. It offers an abstract API for sending and translating\npackets between sources and destinations.\n\n### Status\n\nThe basic functionality has been implemented, yet unit tests are still\nsparse.\n\n## The pyfmflib.cl1 package\n\n`pyfmflib` is a python namespace package. `pyfmflib.cl1` is the python package\nthat implements the compliance level 1 API.\n\n### Status\n\nThe skeleton defined by the acceptance tests is finished. The\nfunctionality and according unit tests are still missing.\n", 
  "id": 21900347
}