{
  "read_at": 1462550964, 
  "description": "Efficient and Robust Bayesian Inference", 
  "README.md": "**IMPORTANT** MultiNest is not my (Joao Faria) project; all copyright belongs to its rightful owners (see below).\n\n\nMultiNest\n=========\n\nEfficient and Robust Bayesian Inference\n---------------------------------------\n\n\nMultiNest is a Bayesian inference tool which calculates the evidence and explores the parameter space which may \ncontain multiple posterior modes and pronounced (curving) degeneracies in moderately high dimensions.\n \n \nMultiNest is freely available for academic use, subject to some [licence](./MultiNest_License.pdf) restrictions. \nPlease contact [Farhan Feroz](http://www.mrao.cam.ac.uk/~ff235/) for commercial licence.\n\n \nMultiNest can be downloaded from the files section of [this website](http://ccpforge.cse.rl.ac.uk/gf/project/multinest/).\n \n \n \nIf you use MultiNest, please acknowledge the following MultiNest papers:\n\n* [arXiv:0809.3437](http://xxx.lanl.gov/abs/0809.3437)\n* [arXiv:0704.3704](http://xxx.lanl.gov/abs/0704.3704)\n* [arXiv:1306.2144](http://xxx.lanl.gov/abs/1306.2144)\n \n \n\nLanguage Support\n----------------\n\nMultiNest is written in Fortran 90 but wrappers & in the case of Matlab a native language implementation, \nis available for likelihood and prior functions written in following languages:\n\n* C/C++: wrappers provided with MultiNest package\n* R: RMultiNest, wrapper for MultiNest written by Johannes Buchner.\n* Python: PyMultiNest, wrapper for MultiNest written by Johannes Buchner.\n* Matlab: MatlabMultiNest written by Matthew Pitkin & Joe Romano, is a Matlab implementation of the algorithm \n        described in arXiv:0809.3437, although it lacks a few features included in the original Fortran \n        version of MultiNest. It can be downloaded from the files section of \n        [this website](http://ccpforge.cse.rl.ac.uk/gf/project/multinest/).\n\nRead the MultiNest README file for more details.\n \n\nPlotting & Visualisation\n------------------------\n\n* [**GetDist:**](http://cosmologist.info/cosmomc/readme.html)\n  Output files produced by MultiNest are compatible with GetDist? plotting package which is part of CosmoMC.\n* [**SuperPlot:**](https://github.com/innisfree/superpy/tree/master/SuperPlot)\n  written by Andrew Fowlie, can calculate and plot posterior distributions, profile likelihoods, \n           confidence intervals, credible regions etc. from MultiNest output files.\n* [**PyMultiNest:**](https://github.com/JohannesBuchner/PyMultiNest) \n  has support for analysing the output from MultiNest & monitoring the progress.\n \n\nPackages Using MultiNest\n------------------------\n\n* BAMBI: Blind Accelerated Multimodal Bayesian Inference\n* Bayes-X is a Bayesian inference tool for the analysis of X-ray observations of clusters of galaxies\n* BXA: Bayesian X-ray analysis (nested sampling for Xspec and Sherpa)\n* Cosmo++: An Object Oriented C++ Library for Cosmology\n* ModeCode: Bayesian Parameter Estimation and Model Comparison for Inflation\n* Monte Python: Monte Carlo Code for Cosmic Linear Anisotropy Solving System (CLASS) in Python\n* pSNid III is a software package to probabilistically identify/classify supernova light curves\n* SIMTOI: SImulation and Modeling Tool for Optical Interferometry\n* SuperBayeS for fast and efficient analysis of supersymmetry theories in particle physics.\n* SuperPy: Scan the CMSSM with (Py)MultiNest and plot the results with a new plotting GUI.\n* TempoNest is a Bayesian software package for the analysis of pulsar timing data.\n", 
  "id": 21920810
}