{
  "read_at": 1462550882, 
  "description": "R scripts for the http://arxiv.org/abs/1404.5544 paper", 
  "README.md": "ChIPseqProfile\n==============\n\nR scripts for the http://arxiv.org/abs/1404.5544 paper\n\nSystems requirements\n\nTo run the scripts, you need to have access to a machine with an installation of R. To combine multiple ChIP-seq profile plots, the script uses pdflatex command, thus requiring an installation of latex. If the system does not have all required packages (BSgenome.Dmelanogaster.UCSC.dm3 from Bioconductor and xtable) you also need internet connection. Finally, you will need a machine with at least 40 GB of memory and 30 GB of HDD storage space available.\nRun the scripts\n\n1. move to the directory. For Linux or MacOS type in the terminal\n\n$ cd ChIPseqProfile\n\n2. start R and then type\n\n$ R\n\n> source(\"PerformAnalysis.R\")\n\n3. (optional) to combine multiple ChIP-seq profile plots open the terminal and call\n\n$ chmod +x GenerateProfilesPanels.sh\n\n$ ./GenerateProfilesPanels.sh\n\nNote that this only works on Linux or MacOS. For Windows systems, please go to the subdirectories listed bellow in section 5 and call pdflatex for the .tex file in each subdirectory\nThe output\n\n1. The heatmaps can be found in subdirectory\n\nimg/heatmap\n\n2. The latex tables with the optimal set of parameters can be found in subdirectory\n\ntables\n\n3. The ChIP-seq profile estimates can be found in subdirectory\n\nimg/profile\n\n4. The statistics of the genome wide analysis can be found in subdirectory\n\nimg/statistics\n\n5. (optional) The plots with multiple profile files can be found in subdirectories\n\na). the five ChIP-seq profiles at eve locus using the optimal set of parameters\n\nlatex/eve\n\nb). the Bicoid ChIP-seq profiles at all 21 loci using the optimal set of parameters\n\nlatex/BCDAccessibleRegions\n\nc). the Caudal ChIP-seq profiles at all 21 loci using the optimal set of parameters\n\nlatex/CADAccessibleRegions\n\nd). the Giant ChIP-seq profiles at all 21 loci using the optimal set of parameters\n\nlatex/GTAccessibleRegions\n\ne). the Hunchback ChIP-seq profiles at all 21 loci using the optimal set of parameters\n\nlatex/HBAccessibleRegions\n\nf). the Kruppel ChIP-seq profiles at all 21 loci using the optimal set of parameters\n\nlatex/KRAccessibleRegions\n\ng). the Hunchback ChIP-seq profiles at all 21 loci using the optimal set of parameters and JASPAR PWM motif\n\nlatex/HBAccessibleRegionsJASPAR\n\nh). the Kruppel ChIP-seq profiles at all 21 loci using the optimal set of parameters and JASPAR PWM motif\n\nlatex/KRAccessibleRegionsJASPAR\n\ni). the Bicoid profile at eve locus using different abundances\n\nlatex/BCDEveStripeEnhancer\n", 
  "id": 21948047
}