{
  "read_at": 1462550906, 
  "description": "Trillian is a project whose aim is to bridge the gap between astrophysical models and the vast amount of publicly available astronomical data.", 
  "README.md": "Trillian\n========\n#### An All-Sky, Multi-wavelength Astronomy Computational Engine\n\nTrillian is a project whose aim is to bridge the gap between astrophysical models and the vast amount of publicly available astronomical data. \n\nIts principle features include:\n\n * a distributed data scheme\n * distributed computation\n * integrated API access to disparate data\n\nA more detailed descripton of the project can be found here: [http://trillianverse.org](http://trillianverse.org).\n\nAn arXiv paper by Demitri Muna and Eric Huff that describes Trillian in more detail can be found here: [arXiv:1402.5932](http://arxiv.org/abs/1402.5932).\n\nLinks\n-----\nProject home page: [http://trillianverse.org](http://trillianverse.org)  \nMozilla ScienceLab Collaborate page: [https://mozillascience.org/projects/trillian](https://mozillascience.org/projects/trillian)  \nMailing list: [https://groups.google.com/forum/#!forum/trillianverse](https://groups.google.com/forum/#!forum/trillianverse)  \n\nDependencies\n------------\n###### Server Software\n * [PostgreSQL](http://postgresql.org)\n * [Q3C](https://code.google.com/p/q3c/)\n\n###### Python packages\n\n * [healpy](https://pypi.python.org/pypi/healpy/1.8.4)\n * [SQLAlchemy](http://sqlalchemy.org)\n * [psycopg2](https://pypi.python.org/pypi/psycopg2/2.5.4)\n\n## Division of Sky with HEALPix\n\nTrillian divides the sky using the HEALPix scheme, which defines equal area regions on a sphere. Each HEALPix region is represented on the server by a one-to-one mapping to a \"trixel\": a discrete collection of all data available for that HEALPix region. In other words, data of all wavelengths of a particular part of the sky is located in the same place. Trillian uses the \"nested\" HEALPix scheme.\n\n## Sky Coverage\n\nThe Trillian server has ~30TB of disk space, which is certainly not enough for all-sky coverage while trying to include even the most popular data sets. However, full-sky coverage is not necessary as a proof of concept. Two regions on the sky have been chosen initially: SDSS's Stripe 82 and the Kepler field, selected as they have been heavily studied and are good representative regions for both extragalactic and Galactic science. Data covering as many wavelengths as possible will be collected for these areas.\n\n## Current Development Goals\n\nThe first milestone is to provide an arbitrarily simple model to Trillian, have the framework apply that model to all objects available, and return a likelihood value for each one. Current tasks include:\n\n - Initialize the server with the coarsest resolution of HEALPix regions/trixels.\n - Define the structure of each trixel (the storage on disk representation of each HEALPix region). This will include a schema for each data set (e.g. SDSS, WISE, etc.) in a shared database on each node, indexing of image data, etc.\n - Define an API for accessing data between nodes.\n - Implement a Docker VM that can accept a user-supplied Python program to be run on nodes.\n - Define the API for the user-supplied Python code. This code will accept data in a defined format (limited on the first pass to magnitudes, spectra, and raw pixel data), and return a likelihood value that the provided data fits the model represented by the code.\n - Define a job queue system (built on Redis?) for communication between the central server and the nodes.\n\n## Support\n\n * Trillian is gratefully supported by the [Center for Cosmology and Astroparticle Physics (CCAPP)](http://ccapp.osu.edu) at Ohio State University.\n * The Trillian project was selected for Mozilla Science Lab's [Collaborate on Software for Science](http://collaborate.mozillascience.org).\n * Trillian has been used as a use case example for development of the [DAT](Collaborate on Software for Science) project.\n\n## Contact\n\nThe Trillian project is currently seeking collborators. If you are interested in contributing to this project, please contact [Demitri Muna](http://github.com/demitri).\n\n---\n\nHistorical Notes\n\n## Mozilla Science Sprint (22 July 2014)\nMuch of the open data conversation focuses on distributing data - how to make data easily available for local replication.  But, some fields have datasets that are so enormous, transferring and storing additional copies for every user is prohibitively expensive and slow.  Instead, we'd like to explore distributed *analysis* - pushing analysis scripts to the data, rather than pulling the data to us.  The experiments on CERN's LHC set a very successful precedent for this model at the largest scale; one of Trillian's early goals is to achieve this functionality with much lower infrastructural overhead.\n\nFor the sprint, we'd like to start exploring a basic Python implementation of a distributed analysis framework.  Our core goals are:\n\n - resolve which of a list of hosts are eligible to run a job, based on data availability\n - send a Python script to an eligible host for execution\n - return the analysis result to the initiating user.\n\nStretch goals include:\n\n - An exploration of security implications and procedures; how do we mitigate the risk of malicious code being executed on the analysis hosts?\n - Smart job queueing: beyond simple data availability, provide job allocation based on available processing power, connection speed, other variables.\n", 
  "id": 21959066
}