{
  "read_at": 1462550971, 
  "description": "A MATLAB function for computing the diamond norm (completely bounded induced 1-norm on linear superoperators)", 
  "README.md": "# matlab-diamond-norm\n\nThis is a MATLAB&reg; function that computes the diamond norm distance between two completely positive trace-preserving (CPTP) superoperators. The calculation is based on a simplified semidefinite program specified in [arXiv:0901.4709](http://arxiv.org/abs/0901.4709) [J. Watrous, [Theory of Computing 5, 11, pp. 217-238 (2009)](http://theoryofcomputing.org/articles/v005a011/)]. More explicitly, it is specified in page 11 of the arXiv article, or page 231 of the published article.\n\n**Note:** the function will not give the correct answer on arbitrary superoperators -- it is only valid on superoperators corresponding to the difference between two CPTP superoperators.\n\nThe input is the Choi matrix corresponding to the superoperator in question. The Choi matrix follows the convention described in [J. Watrous, [Theory of Computing 5, 11, pp. 217-238 (2009)](http://theoryofcomputing.org/articles/v005a011/)], i.e., the partial trace over the first half of the Choi matrix yields the zero matrix for a superoperator that is the difference of two CPTP maps, or the identity matrix for a CPTP map (the Jamiolkoski convention, on the other hand, would lead to a matrix proportional to the identity matrix, but with trace 1).\n\n## Installation\n\nSimply add the `src` directory to your MATLAB path.\n\n## Dependencies\n\nThis library depends on the [CVX](http://cvxr.com/cvx/) library, and will not function without it. You may find instructions on installing the CVX library [here](http://web.cvxr.com/cvx/doc/install.html).\n\nThe test function `dnormtest` also depends on [QIP.m](http://github.com/marcusps/QIP.m), but this library is not necessary to run the `dnorm` function.\n\n## Authors\n\nMarcus P. da Silva (@marcusps)\n\n## License\n\nCopyright 2014 Raytheon BBN Technologies\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n", 
  "id": 22267641
}