{
  "read_at": 1462550959, 
  "description": "A small Tornado-backed server to see and vote on astro-ph papers", 
  "README.md": "### astroph-coffee - A simple platform for astro-ph arXiv discussion\n\nThis server helps organize astro-ph discussion by providing a way for people to\nsee local papers and vote on papers they want to talk about. It has the\nfollowing components:\n\n* backend with arxiv scraping\n* article abstract and metadata storage in sqlite3\n* frontend built with tornado for viewing and voting on papers\n* an archive of previous astro-ph discussions\n* geofencing using the Maxmind GeoLite2 database to restrict voting locations\n* reserving papers for later discussion (up to a week after their appearance)\n\nEveryone gets five votes to use in total per day, with one per paper. In\naddition, everyone may reserve up to five papers for later discussion. The\nserver generally operates in two modes:\n\n1. Vote mode: this is active whenever the voting period is active (defined in\n   `src/conf/astroph.conf`). Papers are shown in their serial number order as on\n   the astro-ph list page, and users can vote on papers they'd like to see\n   talked about. Users can also reserve papers during the voting period for up\n   to seven days if they want to talk about the papers at a later discussion\n   session.\n\n   ![Voting mode image](src/static/images/voting.png?raw=true)\n\n\n2. Display mode: this is active outside the voting period. Local papers are\n   highlighted at the top of the page with their full abstracts. Papers with at\n   least one vote are shown below papers with local authors, in order of the\n   number of votes they received. Reserved papers are shown next in\n   reversed-order of their original arXiv appearance. Finally, all other papers\n   are listed below the local, voted, and reserved papers.\n\n   ![Display mode image](src/static/images/listing.png?raw=true)\n\n\nAn archive of all paper astracts is also provided in reverse chronological\norder, grouped by month and year to make it easy to see what people were\ninterested in talking about on previous days.\n\nSee the INSTALL.md file for instructions on how to install and run the\nserver. If you have questions or problems, please let me know.\n", 
  "id": 22404456
}