{
  "read_at": 1462553354, 
  "description": "Matlab codes for the symmetric Levy processes", 
  "README.md": "Matlab codes for the symmetric Levy processes\n====================\n\nThese are Matlab R2013a (8.1.0.604) codes for numerically solving the Kolmogorov forward equations for the symmetric L'evy processes. These codes were used to yield the results of the numerical experiments in my article\n\n\"A fast and accurate numerical method for the symmetric L'evy processes \n based on the Fourier transform and sinc-Gauss sampling formula\"\n(http://arxiv.org/abs/1408.0157).\n\nSee this article for the technical details of the numerical method. In particular, Steps 1, 2, and 3 below are explained in the article.  \n\nThe roles of the source files and their relationships are explained below. \n\n[Main programs for the numerical experiments in the article]\n\nExample 1 in the article\n- exA_FuncErrPlot_SymVG.m --- Program to plot the exact solutions and the errors of the numerical solutions for Example 1 (Figs. 4,5 in the article). This program uses function \"LevyPDE_SolFunc_IIone.m\" explained below. \n- exA_LevyProc_NumExp_SymVG.m --- Program to plot the maximum errors and the computational times of the numerical solutions for Example 1 (Figs. 6,7,8,9 in the article). This program also uses function \"LevyPDE_SolFunc_IIone.m\" explained below. \n\nExample 2 in the article\n- exB_FuncErrPlot_SymNIG.m --- Program to plot the exact solutions and the errors of the numerical solutions for Example 2 (Figs. 10,11 in the article). This program uses function \"LevyPDE_SolFunc_IItwo.m\" explained below. \n- exB_LevyProc_NumExp_SymNIG.m --- Program to plot the maximum errors and the computational times of the numerical solutions for Example 2 (Figs. 12,13,14,15 in the article). This program also uses function \"LevyPDE_SolFunc_IItwo.m\" explained below. \n\n[Functions]\n- LevyPDE_SolFunc_IIone.m --- Function to compute the numerical solutions using the following functions as subroutines. In this function, SG_IndefInt_sym.m is executed once. \n  - DE_NFFT.m --- Function to compute the Fourier transform in Step 1 through the DE formula for the Fourier transforms and the nonuniform FFT. The DE transform is implemented in the following file.\n    - phi.m   \n  - SG_IndefInt_sym.m --- Function to compute the indefinite integral in Step 2 through the sinc-Gauss indefinite integration formula. This function uses the fractional FFT, which is implemented in the following file.\n    - FFFT.m \n  - ContEulerFFFT.m --- Function to compute the inverse Fourier transform in Step 3 through the formula for the Fourier transform with continuous Euler transform and the fractional FFT. Thus, this function also uses the following file.\n    - FFFT.m \n- LevyPDE_SolFunc_IItwo.m --- Function to compute the numerical solutions using the same functions as LevyPDE_SolFunc_IIone.m. In this function, SG_IndefInt_sym.m is executed twice. \n", 
  "id": 22491328
}