{
  "read_at": 1462553200, 
  "description": "An implementation of demixed Principal Component Analysis (a supervised linear dimensionality reduction technique)", 
  "README.md": "demixed Principal Component Analysis (dPCA)\n===========================================\n\ndPCA is a linear dimensionality reduction technique that automatically discovers and highlights the essential features of complex population activities. The population activity is decomposed into a few demixed components that capture most of the variance in the data and that highlight the dynamic tuning of the population to various task parameters, such as stimuli, decisions, rewards, etc.\n\n> D Kobak*, W Brendel*, C Constantinidis, C Feierstein,\nA Kepecs, Z Mainen, R Romo, X-L Qi, N Uchida, C Machens<br>\n> *Demixed principal component analysis of population activity in higher cortical areas reveals independent representation of task parameters*<br>\n> http://arxiv.org/abs/1410.6031\n\nThis repository provides easy to use Python and MATLAB implementations of dPCA as well as example code.\n\n## Use dPCA\n\nSimple example code for surrogate data can be found in [**dpca_demo.ipynb**](http://nbviewer.ipython.org/github/wielandbrendel/dPCA/blob/master/python/dPCA_demo.ipynb) and **dpca_demo.m**.\n\n### Python package\n\nTo install, first make sure that numpy, cython, scipy, sklearn, itertools and numexpr are avaible. Then copy the files from the Python subfolder to a location in the Python search path.\n\nAPI of dPCA is similar to sklearn. To use dPCA, you should first import dPCA,  \n`from dpca import dPCA`  \nthen initialize it,    \n`dpca = dPCA(labels, n_components, regularizer)`    \nthen call the fitting function on your data to get the latent components Z,    \n`Z = dpca.fit_transform(X)`.\n\nThe required initialization parameters are:\n- *X* - A multidimensional array containing the trial-averaged data. E.g. X[n,t,s,d] could correspond to the mean response of the *n*-th neuron at time *t* in trials with stimulus *s* and decision *d*. The observable (e.g. neuron index) needs to come first.\n- *labels* - Optional; list of characters with which to describe the parameter axes, e.g. 'tsd' to denote time, stimulus and decision axis. All marginalizations (e.g. time-stimulus) are refered to by subsets of those characters (e.g. 'ts').\n- *n_components* - Dictionary or integer; if integer use the same number of components in each marginalization, otherwise every (key,value) pair refers to the number of components (value) in a marginalization (key).\n\nMore detailed documentation, and additional options, can be found in **dpca.py**.\n\n### MATLAB package\n\nAdd the Matlab subfolder to the Matlab search path.\n\nExample code in `dpca_demo.m` generates surrogate data and provides a walkthrough for running PCA and dPCA analysis and  plotting the results.\n\n### Support\n\nEmail wieland.brendel@bethgelab.org (Python) or dmitry.kobak@neuro.fchampalimaud.org (Matlab) with any questions.\n", 
  "id": 22749656
}