{
  "read_at": 1462553311, 
  "description": "", 
  "README.md": "# Precision cosmology with time delay lenses: high resolution imaging requirements\r\n\r\nXiao-Lei Meng, Tommaso Treu, Adriano Agnello, Matthew W. Auger, Kai Liao, Philip J. Marshall\r\n\r\nGravitational lens time delays are a powerful probe of cosmology, provided that the gravitational potential of the main deflector can be modeled with sufficient precision. Recent work has shown that this can be achieved by detailed modeling of the host galaxies of lensed quasars, which appear as \"Einstein Rings\" in high resolution images. The distortion of these arcs and counter-arcs, as measured over a large number of pixels, provides tight constraints on the difference between the gravitational potential between the quasar image positions, and thus on cosmology in combination with the measured time delay. In this paper, to be submitted to JCAP, we carry out a systematic exploration of the high resolution imaging required to exploit the thousands of lensed quasars that will be discovered by current and upcoming surveys within the next decade.\r\n\r\nThis paper have been submitted to arXiv (arXiv:1506.07640). You can read the arXiv version **[here](http://arxiv.org/abs/1506.07640)**.\r\n\r\nYou can read the most up to date version of the paper **[here](https://github.com/tommasotreu/HIGHRESOLUTIONIMAGING/blob/master/docs/paper/High_resolution_imaging_requirements.pdf)**.\r\n\r\nIf you have comments on this research, please send us your feedback **[here](https://github.com/tommasotreu/HIGHRESOLUTIONIMAGING/issues)**.\r\n\r\n\r\n### License, credit etc\r\n\r\nAll content is Copyright 2015 The Authors. If you make use of the ideas and results presented here in your own research, please cite the paper as \"Meng et al 2015, JCAP submitted\" and provide the URL of this repository: https://github.com/tommasotreu/HIGHRESOLUTIONIMAGING\r\n\r\nThe code we used to generate the simulated images and then infer the lens models is distributed here under the MIT license. This means that you can do whatever you like with it, except blame us if it doesn't work. Use of this scientific code is encouraged, but not supported, by its authors. If you do make use of this code in your own research, please cite it as\r\n([Auger et al 2011](http://adsabs.harvard.edu/abs/2011MNRAS.411L...6A)\r\n [Auger et al 2013](http://adsabs.harvard.edu/abs/2013MNRAS.436..503A)).\r\n", 
  "id": 22891701
}