{
  "README.licences": "\n     Credits for applications/libraries used in DNACloud\n\n     Manish Gupta and the DNACloud team\n\n---------------------------------------------\n\nDNACloud uses applications/libraries in the compression/decompression that are under copyright.\n\nKey:\nFFmpeg:     Free for non-profit/non-commercial use\n\nCredits and permissions, listed by author/source:\n\nIndividual Authors:\n\nOrganizations:\n\nFFmpeg:\nhttps://www.ffmpeg.org/download.html\nFFmpeg is licensed under the GNU Lesser General Public License (LGPL) version 2.1 \n(http://www.gnu.org/licenses/old-licenses/lgpl-2.1.html) or later. \nHowever, FFmpeg incorporates several optional parts and optimizations that are \ncovered by the GNU General Public License (GPL) version 2 (http://www.gnu.org/licenses/old-licenses/gpl-2.0.html) or later. \nIf those parts get used the GPL applies to all of FFmpeg.\n", 
  "read_at": 1462558495, 
  "description": "", 
  "README.md": "DNACloud README\n========================================================\n\n-This software take any computer file as input and provides you its corresponding DNA string as well as small chunks of DNA String of length 117 which can be easily synthesized.\n\n-It also decodes the original file from the DNA string or DNA list. Since this conversion process is quiet heavy it comes with a build in estimator which approximates the physical memory used by the software when converting a particular file.\n\n-This software is developed by [`Shalin Shah`](www.guptalab.org/shalinshah) at Laboratory of Natural Information Processing, DA-IICT (Gupta Lab). It has been presented as a poster at [FNANO'14](http://www.cs.duke.edu/FNANO/). \n\nYou could report bugs and feedback at :- `dnacloud@guptalab.org`                     \nTo know more you can also visit our website :- `www.guptalab.org/dnacloud`                        \nYou can also find our extended paper on [Cornell's archive](arxiv.org) :- `http://arxiv.org/pdf/1310.6992v2.pdf`        \n\n**(C) - 2013 Gupta Lab**\n\n\nBuild Instructions\n---------------------------------------------------------\n\n**a) For MAC/Linux :-** \n\n- Download the source code(as .zip) from git or clone it using following command :-\n\n        git clone https://github.com/shalinshah1993/DNACloud.git\n\n- Open terminal and move to DNACloud directory containing `dnacloud.sh` file. Try to run this shell file using following command :-\n\n        sh dnacloud.sh\n\n- If it doesn't work showing error that barcode module or wx module not found then you will have to first download python distribution of those modules.\n\n- You can either install them using pip or by downloading their .zip distributions(containing setup.py file) available.\n\n- To install pip type following command or download its distribution folder from internet and run `python setup.py instal`. Note that pip is payloaded with python if you install python using brew:- \n\n        sudo apt-get install python-pip (Linux)\n        sudo easy_install pip or brew install python (MAC OSX)\n\n- After installing pip you should install wxpython 32 bit v2.8 using following command. Make sure you are using python of 32bit or force 64bit python interpreter to run in 32 bit mode.\n\n        sudo pip install wxpython==2.8\n\n- Lastly, you need to install Whitie's pyBarcode module which is available [here](https://bitbucket.org/whitie/python-barcode \"here\") .\nTo install it simply download it as .zip and run  `sudo apt-get install python-setuptools` and `sudo python setup.py install`.\n\n**b) For Windows :-**\n\n- Download the command line tools for git hub and setup file for pip. Install them and set their path as environment variable. Once this is done you can follow the same process as above using CMD.\n\n- Hope that helps you to install DNACloud. In case any doubt please mail @ `dnacloud@guptalab.org`\n\n\nFolder Info:-\n---------------------------------------------------------\n\n .temp - Contains temporary files which can be cleaned from the software.\n \n database - This folder contains all the encoded DNA Lists and your preferences. Please do not change or delete these files.\n \n source - All the python files. `MainFrame.py` is the main GUI file.\n \n scripts - Contains scripts to convert software to `.exe` and `.app` file.\n \n help - Contains PDF files for `CREDITS` and `USER MANUAL`. You may refer the last document to understand the software.\n \n icons - Contains all the icons used in the software.\n \n", 
  "id": 23537360
}