{
  "README": "SQuIDS\n===========\n\nPrerequisites\n-------------\n\nThe following packages are required to build and use the library, and\ncan probably be obtained from your favorite package manager:\n\n* gsl (>= 1.15): http://www.gnu.org/software/gsl/\n* C++ compiler with C++11 support.\n\nSupported Platforms and Compilers\n---------------------------------\n\nThis software is designed to work in POSIX environments with\nstandard conformant C++ compilers. It should be noted that various \nC++11 features are used for efficient calculation, so a reasonably \nmodern compiler is necessary. See the list below for compilers\nknown to compile the software successfully. \n\n* GCC: Version 4.8.1 or later is known to work.\n* Clang: Version 3.3 or later is known to work. \n* ICC: Version 15.0 is known to work; version 14.0 should work \n       as well but has not been tested. \n\nIt is also necessary to have a sufficiently new standard library\nimplementation. The libstdc++ supplied with gcc 4.8 or newer, and\nlibc++ are known to work. \n\nThe software has been tested and found to work on the following\noperating systems:\n\n* Linux\n* Darwin (Mac OS X)\n* FreeBSD\n\nConfiguration\n-------------\n\nA configure script, config.sh, is provided in the root directory.\n\nThe path for the GSL libraries can be specified running:\n\n\t./config.sh --with-gsl-incdir=DIR --with-gsl-libdir=DIR\n\nif not specified pkg-config will be used to try to find\nthe your GSL installation. After successful configuration run:\n\n\tmake\n\nTo verify that the software is functioning correctly, the \nunit tests can be run with the command:\n\n\tmake test\n\nFinally, the software can be installed using the command:\n\n\tmake install\n\nBy default this will attempt to install the library within /usr/local; \nthis can be changed by using the --prefix option when running config.sh:\n\n\t./config --prefix=$HOME\n\nwill select to install the software in the current user's home directory, \nfor example. \n\nExamples\n--------\n\nThree examples programs can be found in the examples subdirectory.\n\nIn order to plot the example results you will need:\n\n* gnuplot (>4.0): http://www.gnuplot.info/\n\nDocumentation\n-------------\n\nDocumentation can be generated by running:\n\n\tmake docs\n\nand will be put in the docs subdirectory.\n\nCitation\n--------\n\nIf you want cite this work, or want to look at further description\nplease refer to\n\nA Simple Quantum Integro-Differential Solver (SQuIDS)\nCarlos A. Arguelles Delgado, Jordi Salvado, Christopher N. Weaver\narXiv:1412.3832\n\n", 
  "read_at": 1462558318, 
  "description": "", 
  "id": 23550693
}