{
  "read_at": 1462558509, 
  "description": "对SALUS的研究", 
  "README.md": "SALUS-Research\n==============\n##\tXiang Mu Jian Jie :\t\nIIIQi Lin Chuang Shi Yan (Pre-approval clinical trials)Wu Fa Que Bao Yao Wu Shang Shi Hou Bu Hui You Yan Zhong De Bu Liang Fan Ying . IVQi Lin Chuang Shi Yan (Post-approval  drug  safety  data  studies)\nZhi Zai Kao Cha Zai Yan Fan Shi Yong Tiao Jian Xia De Yao Wu De Liao Xiao He Bu Liang Fan Ying , Ping Jie Zai Pu Tong Huo Zhe Te Shu Ren Qun Zhong Shi Yong De Li Yi Yu Feng Xian Guan Xi Yi Ji Gai Jin Gei Yao Ji Liang Deng . \nDan IVQi Lin Chuang Shi Yan De Xiao Lu Yi Zhi Shi Lao Sheng Chang Tan De Wen Ti ,Zhi Yao Yuan Yin Zai Yu Xian Zai De IVQi Lin Chuang Shi Yan Shu Ju Yi Lai De Shi Zi Fa De Ge An Shang Bao ,Dan Bu Bao He Lou Bao Shi Zhu Yao Wen Ti . \t\nJi Xu Yi Chong Geng Jia You Xiao De Fang Shi ,Neng Gou Ji Shi Dui Duo Ge Shu Ju Yuan Jin Xing Jian Kong ,Jin Xing Guan Lian He Fen Xi . Yu Dian Zi Jian Kang Dang An /Dian Zi Bing Li De Zheng He Neng Gou Hen Hao De Gai Shan IVQi Lin Chuang Shi Yan De Xiao Guo ,You Yi Xie Zhen Dui Shang Yong EHR/EMRXi Tong Jie Kou De \nYuan Xing Yan Jiu ,Zhu Yao Shi Zuo Ji Yu EHR/EMRXi Tong De ADEShang Bao ,Shai Jian De Xin Hao Jian Ce Deng ,Dan Shi You Yu Qi Jie Kou Shi Zhuan Yong De ,Bu Ju Bei Ke Kuo Zhan Xing . Wei Liao Shi Xian Qian Zhan Xing De Ke Kuo Zhan De IVQi Lin Chuang Shi Yan De Yan Jiu ,Wo Men Xu Yao Neng Gou Cong Duo Ge Yi Gou EHRShu Ju Yuan Zhong \nHuo Qu Shu Ju ,Gai Xiang Mu Zhi Li Yu Ti Gong Yi Chong Biao Zhun Hua De Hu Cao Zuo Xing Kuang Jia ,Shi De Wo Men Neng Gou Jin Xing Shi Shi Yu Yi Gou EHRXi Tong Jin Xing Tong Xin ,Dui Shi Shi De Huan Zhe Shu Ju Jin Xing Wa Jue Fen Xi ,Zhu Yao Mu Biao Ru Xia :\t\n\t\n*  EHRShu Ju Jiao Huan De Hu Cao Zuo Xing Gong Neng Gui Fan \t\t\t\n*  He Li Jie Du EHRShu Ju De Hu Cao Zuo Xing Ji Zhu Jie Jue Fang An \t\t \n*  EHRShu Ju Gong Xiang De An Quan He Yin Si Kuang Jia  \t\t\n*  Ji Yu EHRXi Tong De Kai Fang Shi Mo Shi Fa Xian De Fen Xi Kuang Jia \t\t\n*  IVQi Lin Chuang Shi Yan Zhong EHRShu Ju Er Ci Li Yong Jing Dian Ying Yong Chang Jing De Shi Dian \t\t\n\n##\tYan Jiu Fang Fa :\t\nDui SALUSDe Yan Jiu ,Gong Wo Men Yan Jiu De Cai Liao Lai Yuan Shi SALUSXiang Mu De Guan Fang Wang Zhan (Fang Wen Ri Qi :2014-09-10),Shou Xian You Yi Ge Da Ti De Jie Shao ,Zhu Ti Shi Xiang Mu Jin Zhan Guo Cheng Zhong Chan Sheng De \nYi Xie Gong Zuo Zhi Pin ,Fen Wei San Lei ,Wen Dang , Kai Yuan Yuan Dai Ma He Fa Biao De Lun Wen (Zhe Li Mian Huan You Yi Pian Ti Wei \"AN EXTENSIBLE SECURITY INFRASTRUCTURE FOR THE SECONDARY USE OF ELECTRONIC HEALTH RECORDS IN CLINICAL\nRESEARCH\"De Shuo Shi Xue Wei Lun Wen ). Dui Ci San Lei Cai Liao Jin Xing Zheng Li Zong Jie ,Kan Kan You Mei You Wo Men Neng Gou Jie Jian He Yun Yong Dao \nShi Ji Gong Zuo Dang Zhong Qu De Ying Yang Cheng Fen ,Shi Wei Chu Zhong . \t\t\n\n## Yi Zheng Li Wen Dang \t\t\t\n\n[D1.1.9](doc/D1.1.9.md): \tXiang Mu Da Ti Qing Kuang ,Bao Gua Can Yu Ji Gou , Qi Zhi Ri Qi , Mu Biao Deng    \n\n[D2.2.2Xuan Chuan Ji Hua  Di Er Ban ](doc/D2.2.2.md)  \t\n\n[D2.3.2Zhi Shi Chan Quan Xie Yi  Di Er Ban ](doc/D2.3.2.md)\t\n\n[D2.4.2Yao Wu Jian Ce Zhong Yu Qi Ta Xiang Mu Yan Jiu Ji Gou Zhi Jian De He Zuo Bao Gao  Di Er Ban ](doc/D2.4.2.md)   \t\n\n[D3.2.1 survey of the state of art](doc/D3.2.1.md)   \t\n\n[D3.3.2 SALUSJia Gou De Xu Qiu Gui Fan  Di Er Ban ](doc/D3.3.2.md)\t\t\n \n## Gai Shu \t\t\n\n## Quan Bu Wen Dang \t\t\n\n[D1.1.1\tProject Web Site]()\t\t\n\n[D1.1.2\tSix Monthly Progress Report (a)]()\t\t\n\n[D1.1.3\tSix Monthly Progress Report (b)]()\t\n\n[D1.1.4\tSix Monthly Progress Report (c)]()\n\t\n\t\n[D1.1.5\tFirst Activity and Management Report]()\n\n[D1.1.6\tSecond  Activity and Management Report]()\n\n[D1.1.7\tThird  Activity and Management Report]()\n\n[D1.1.8\tFinal Report]()\n\n[D1.1.9\tProject Presentation]()\n\n[D1.1.10\tReport on the distribution of Community Financial Contribution between Beneficiaries]()\n\nTask 1.2 Quality Assurance\t\n\n[D1.2.1\tQuality Assurance Plan]()\n\n\n**Dissemination, Exploitation and Innovation Related Activities** \t\n\n\nTask 2.1 Exploitation\t\n\n[D2.1.1\tExploitation Plan (a)]()\n\n[D2.1.2\tExploitation Plan (b)]()\n\n[D2.1.3\tExploitation Plan (c)]()\n\n[D2.1.4\tBusiness Plan]()\n\nTask 2.2 Dissemination\t\n\n[D2.2.1\tDissemination Plan (a)]()\n\n[D2.2.2\tDissemination Plan (b)]()\n\n[D2.2.3\tDissemination Plan (c)]()\n\n[D2.2.4\tGuidance to Green Field Member States for secondary use of EHRs for Post Market Safety Studies]()\n\nTask 2.3 - Management of Innovation and Intellectual Property\t\n\n[D2.3.1\tIntellectual Property Rights Agreement]()\n\n[D2.3.2\tReport on Intellectual Property Management (a)]()\n\n[D2.3.3\tReport on Intellectual Property Management (b)]()\n\nTask 2.4 - Cooperation with other projects and European intuitional bodies in Drug Surveillance\t\n[D2.4.1\tReport on Collaboration with other projects and Institutional bodies in Drug surveillance (a)]()\n\n[D2.4.2\tReport on Collaboration with other projects and Institutional bodies in Drug surveillance (b)]()\n\n[D2.4.3\tReport on Collaboration with other projects and Institutional bodies in Drug surveillance (c)]()\n\n **S&T Management and SALUS System Architecture**\t\n\n\nTask 3.1 Scientific and Technical Management\t\n[D3.1.1\tSix Monthly Action Plan (a)]()\n\n[D3.1.2\tSix Monthly Action Plan (b)]()\n\n[D3.1.3\tSix Monthly Action Plan (c)]()\n\n[D3.1.4\tSix Monthly Action Plan (d)]()\n\n[D3.1.5\tSix Monthly Action Plan (e)]()\n\n[D3.1.6\tSix Monthly Action Plan (f)]()\n\n\nTask 3.2 Survey of the State of the Art Technologies and Architectures\t\n\n[D3.2.1\tSurvey of the State of the Art]()\n\n\nTask 3.3 Gathering Technical Requirements of SALUS Architecture\t\n\n[D3.3.1\tRequirement Specification of the SALUS Architecture]()\n\t\n\t\n[D3.3.2\tRevised Requirement Specification  & Conceptual Design of the  SALUS Architecture]()\n\n\nTask 3.4 Conceptual Design of SALUS Architecture\t\n\n[D3.4.1\tConceptual Design of the  SALUS Architecture]()\n\n\n**Semantic Interoperability Framework for Post Market Safety Studies\t**\n\n\nTask 4.1 - Creating the Content Models for the Functional Interoperability Profiles defined for Post Market Safety Studies\t\t\n\n[D4.1.1\tSALUS Content models for the Functional Interoperability Profiles for Post Market Safety Studies  - R1]()\n\n[D4.1.2\tSALUS Content models for the Functional Interoperability Profiles for Post Market Safety Studies  - R2]()\n\n\nTask 4.2 - Creating the Common Set of Data Elements for Post Market Safety Studies\t\n\n[D4.2.1\tSALUS Common Set of Data Elements for Post Market Safety Studies -R1]()\n\n[D4.2.2\tSALUS Common Set of Data Elements for Post Market Safety Studies -R2]()\n\n\nTask 4.3 - Building SALUS Harmonized ontology for Post Market Safety Studies\t\n\n[D4.3.1\tSALUS Harmonized Ontology for Post Market Safety Studies -R1]()\n\n[D4.3.2\tSALUS Harmonized Ontology for Post Market Safety Studies -R2]()\n\n\nTask 4.4 - Developing the Semantic Mediation Framework\t\n\n[D4.4.1\tSALUS Semantic Mediation Framework  -R1]()\n\n[D4.4.2\tSALUS Semantic Mediation Framework  -R2]()\n\n\n**Functional Interoperability Profiles and Toolkits for Exposing EHRs for secondary use in Post Market Safety Studies** \t\t\n\n\nTask 5.1 Subscription Based Interoperability Profiles and Open Source Toolsets\t\n\n[D5.1.1\tSubscription Based Interoperability Profiles and Open Source Toolsets - R1]()\n\n[D5.1.2\tSubscription Based Interoperability Profiles and Open Source Toolsets -R2]()\n\n\nTask 5.2 Query Based Interoperability Profiles and Open Source Toolsets\t\n\n[D5.2.1\tQuery Based Interoperability Profiles and Open Source Toolsets -R1]()\n\n[D5.2.2\tQuery Based Interoperability Profiles and Open Source Toolsets -R2]()\n\n\nTask 5.3 Interoperability Profiles and Open Source Toolsets for Reporting Activities for Post Market Safety Studies\t\n\n[D5.3.1\tOpen Source Toolsets for Reporting Activities for Post Market Safety Studies - R1]()\n\n[D5.3.2\tOpen Source Toolsets for Reporting Activities for Post Market Safety Studies - R2]()\n\n\nTask 5.4 Interoperability Profiles and Open Source Toolsets for Security and Privacy\t\n\n[D5.4.1\tInteroperability Profiles and Open Source Toolsets for Security and Privacy -R1]()\n\n[D5.4.2\tInteroperability Profiles and Open Source Toolsets for Security and Privacy -R2]()\n\n\n** Integrating Clinical Research with Clinical Care\t** \n\n\nTask 6.1 Enabling ADE Detection on EHRs based on temporal patterns\t\n\n[D6.1.1\tToolsets for Enabling ADE Detection on EHRs based on temporal patterns -R1]()\n\n[D6.1.2\tToolsets for Enabling ADE Detection on EHRs based on temporal patterns -R2]()\n\n\nTask 6.2 Enabling Exploratory analysis for Signal detection and signal qualification studies on EHRs based on temporal patterns\t\n\n[D6.2.1\tToolsets for enabling Signal detection on EHRs based on temporal patterns -R1]()\n\n[D6.2.2\tToolsets for Enabling Signal detection on EHRs based on temporal patterns -R2]() \n\n\nTask 6.3 Integration of SALUS Components\t\t\n\n[D6.3.1\tIntegrated SALUS Components -R1]()\t\t\n[D6.3.2\tIntegrated SALUS Components -R2]()\t\t\n\n\n**SALUS Testing and Validation Framework**  \t\n\nTask 7.1 Functional and Non-Functional Tests and End-User Validation of SALUS Components\t\n\n[D7.1.1\tFunctional and Non-functional Evaluation Criteria for SALUS Components]()\n\n[D7.1.2\tTest and Evaluation Report for SALUS Components -R1]()\t\n\n[D7.1.3\tTest and Evaluation Report for SALUS Components -R2]()\n\nTask 7.2 SALUS Pilot Application Validation\t\n\n[D7.2.1\tFunctional and Non-functional Evaluation Criteria for SALUS Pilot Application]()\n\n[D7.2.2\tValidation Report for SALUS Pilot Application]()\n\n\n**SALUS Pilot applicationss** \t\n\n\nTask 8.1 Requirements of SALUS Pilot Application\t\n\n[D8.1.1\tPilot Application Scenario and Requirement specifications of the Pilot application]()\n\n\nTask 8.2 Design of SALUS Pilot Application\t\n\n[D8.2.1\tDesign of the Implementation of the Pilot Application Scenario ]()\n\n\t\n\t\nTask 8.3 Deployment of SALUS Pilot Application\t\n\n[D8.3.1\tDeployment of the Pilot application -R1]()\n\n[D8.3.2_LISPA\tDeployment of the Pilot application -R2]()\n\n[D8.3.2_TUD\tDeployment of the Pilot application -R2]()\n\nTask 8.4 Ethical Management\t\n\n[D8.4.1\tData Protection Plan]()\n\n\n## Lun Wen \t\t\n\n### Za Zhi Shu Ji Lei \t\t\n\n*   A. Anil Sinaci, Gokce B. Laleci Erturkmen, [A federated semantic metadata registry framework for enabling interoperability across clinical research and care domains](http://www.sciencedirect.com/science/article/pii/S1532046413000750), [Journal of Biomedical Informatics](http://www.journals.elsevier.com/journal-of-biomedical-informatics/), Volume 46, Issue 5, October 2013, Pages 784-794, ISSN 1532-0464, http://dx.doi.org/10.1016/j.jbi.2013.05.009.\n*   Gokce B. Laleci, Mustafa Yuksel, Asuman Dogac, [Providing Semantic Interoperability between Clinical Care and Clinical Research Domains](http://dx.doi.org/10.1109/TITB.2012.2219552), [IEEE Transactions on Information Technology in BioMedicine](http://bme.ee.cuhk.edu.hk/TITB/), Volume: 17, Issue: 2, March 2013 (online since Sept. 2012), Page(s): 356-369.*   Pares Y, Declerck G, Hussain S, Ng R, Jaulent MC., [Building a time-saving and adaptable tool to report adverse drug events.](http://www.ncbi.nlm.nih.gov/pubmed/23920689) Stud Health Technol Inform. 2013;192:903-7.\n*   Declerck, Gunnar; Hussain, Sajjad; Daniel, Christel; Yuksel, Mustafa; Laleci Erturkmen, Gokce; Twagirumukiza, Marc; Jaulent, Marie-Christine, Bridging data models and terminologies to support adverse drug event reporting using EHR data\"  accepted to be published in Methods of Information in Medicine\n\n\n### Hui Yi Lun Wen  \t\t\n\n\n*   Tobias Krahn, Stefan Gudenkauf, Frerk Muller, H.-Jurgen Appelrath, \"Potenzial von Linked Data zur automatisierten Detektion bekannter unerwunschter Arzneimittelwirkungen (the potential of linked data to automatically detect already known ADRs)\", German Society for Medical Informatics, Biometry and Epidemiology (GMDS), Gottingen, September, 2014.\n*   Tobias Krahn, \"Computerbasierter Ansatz zum Erkennen von Medikamentennebenwirkungen\" (computer-based approach to detect drug side effects)\", Award, Research Communication Competition, LzO - Landessparkasse zu Oldenburg, June 10, 2014.\n*   Tobias Krahn, Marco Eichelberg, Stefan Gudenkauf, Gokce B. Laleci Erturkmen and H.-Jurgen Appelrath, \"Adverse Drug Event Notification System\", has been accepted to be presented in IEEE CBMS 2014, Mount Sinai, New York NY, May 27-29, 2014\n*   Christel Daniel, Anil Sinaci, David Ouagne, Eric Sadou; Gunnar Declerck, Dipak Kalra, Jean Charlet,  Kerstin Forsberg, Landen Bain, Charlie Mead, Sajjad Hussain, Gokce B. Laleci Erturkmen, Standard-based EHR-enabled applications for clinical research and patient safety: CDISC - IHE QRPH - EHR4CR &amp; SALUS collaboration, AMIA 2014 Joint Summits on Translational Science, San Francisco USA, April 2014\n*   Hong Sun, Jos De Roo, Giovanni Mels, Kristof Depraetere,Marc Twagirumukiza, Boris De Vloed, Dirk Colaert, [Assessing and Improving SKOS Mapping Quality](http://ceur-ws.org/Vol-1114/Poster_Sun.pdf), Demo Paper in [International Workshop on Semantic Web Applications and Tools for Life Sciences, SWAT4LS](http://www.swat4ls.org/workshops/edinburgh2013/), Edinburgh, December 2013\t\t\n*   Mustafa Yuksel, Suat Gonul, Gokce Banu Laleci Erturkmen, Ali Anil Sinaci, Kristof Depraetere, Jos De Roo and Tomas Bergvall, [Demonstration of the SALUS Semantic Interoperability Framework for Case Series Characterization Studies](http://ceur-ws.org/Vol-1114/Demo_Yuksel.pdf), Demo Paper in [International Workshop on Semantic Web Applications and Tools for Life Sciences, SWAT4LS](http://www.swat4ls.org/workshops/edinburgh2013/), Edinburgh, December 2013\n*   A. Anil Sinaci, Gokce B. Laleci Erturkmen, Suat Gonul, H. Alper Cinar and Atakan Kaya, [Patient History Navigation with the Use of Common Data Elements](http://ceur-ws.org/Vol-1114/Demo_Sinaci.pdf), Demo Paper in [International Workshop on Semantic Web Applications and Tools for Life Sciences, SWAT4LS](http://www.swat4ls.org/workshops/edinburgh2013/), Edinburgh, December 2013\n*   Hong Sun, Jos De Roo, Marc Twagirumukiza, Giovanni Mels, Kristof Depraetere, Boris De Vloed, Dirk Colaert, [Validation Rules for Assessing and Improving SKOS Mapping Quality](http://arxiv.org/abs/1310.4156%20), on arXiv, October 2013\n*  Tobias Krahn, David Sass, Prof. Dr. Dr. h.c. H.-Jurgen Appelrath, [Transparenz unerwunschter Arzneimittelwirkungen (transparency of ADRs](http://www.egms.de/static/en/meetings/dkvf2013/13dkvf088.shtml)), </span>[DKVF 2013 - 12. Deutscher Kongress fur Versorgungsforschung](http://dkvf2013.de/), Berlin, 23-25 October 2013.\n*   Tobias Krahn, Frerk Muller, Prof. Dr. Dr. h.c. H.-Jurgen Appelrath, Detektion unerwunschter Arzneimittelereignisse - [Transparenzsteigerung in der Versorgungsforschung (detection of ADEs - enhancing the transparency in the context of health services research)](http://www.egms.de/static/en/meetings/gmds2013/13gmds081.shtml) [GMDS 2013 - 58. Jahrestagung der Deutschen Gesellschaft fur Medizinische Informatik, Biometrie und Epidemiologie (GMDS) e.V.](http://www.gmds2013.de/) Berlin, 01-05 September 2013.\n*   Tobias Krahn, Frerk Muller, Marco Eichelberg, Andreas Hein, H.-Jurgen Appelrath, Sekundarnutzung klinischer Patientenakten - [Semi-automatische Detektion von Medikamentennebenwirkungen](http://www.e-health-2014.de/e-health-2014.pdf), in Duesberg F., (Hrsg.) e-Health 2014, Solingen (2013) Seiten: 120.\n*   Tomas Bergvall, Niklas Noren, [Real World Evidence, a substitute for pharmacovigilance reporting and safety documentation?](http://www.fip.org/abstracts?page=abstracts&amp;action=item&amp;item=9205), FIP WORLD Congress 2013, Dublin, Ireland, 31 August- 05 September, 2013.\n*   Yves Pares, Gunnar Declerck, Sajjad Hussain, Romain Ng, Marie-Christine Jaulent, [Building a time-saving and adaptable tool to report adverse drug events](http://www.ncbi.nlm.nih.gov/pubmed/23920689), [MEDINFO 2013](http://www.medinfo2013.dk/), Copenhagen, August 2013.\n*   Elif Eryilmaz, Gokce B. Laleci Erturkmen, Security and Privacy Issues for enabling the Secondary use of EHRs in Clinical Research, [MedeTel 2013 Conference](http://www.medetel.eu/index.php) - Luxemburg, April 2013.\n*   Christel Daniel, Gokce Banu Laleci Erturkmen, Ali Anil Sinaci, Brendan C Delaney, Vasa Curcin, Landen Bain, Standard-based integration profiles for clinical research and patient safety, Panel in CRI 2013,[ AMIA Clinical Research Informatics](http://www.amia.org/jointsummits2013) meeting (San Francisco, March 2013).\n*   Gunnar Declerck, Sajjad Hussain, Yves Pares, Christel Daniel, Mustafa Yuksel, Ali Anil Sinaci, Gokce Banu Laleci Erturkmen, Marie-Christine Jaulent, [Semantic-sensitive extraction of EHR data to support adverse drug event reporting](/projects/salus/docs/ICSR_Reporting_Tool_SWAT4LS_V2.pdf), [SWAT4LS Workshop](http://www.swat4ls.org/workshops/paris2012/), Paris - France, 30 November 2012.\n*   Ali Anil Sinaci, Jena based Implementation of a ISO 11179 Metadata Registry, ApacheCon EU - Sinsheim, Germany; November 2012.\n*   Gokce B. LALECI ERTURKMEN, Asuman DOGAC and Mustafa YUKSEL, [SALUS: Scalable, Standard based Interoperability Framework for Sustainable Proactive Post Market Safety Studies](/projects/salus/docs/ShortcommunicationSALUSFinalApril132012.pdf), MIE 2012, Pisa - Italy, 26-29 August 2012. [(Slides)](/projects/salus/docs/SALUS-MIE_short.pdf)\n*   Gokce B. Laleci Erturkmen, Asuman Dogac, Mustafa Yuksel, Sajjad Hussain, Gunnar Declerck, Christel Daniel, Hong Sun, Kristof Depraetere, Dirk Colaert, Jos Devlies, Tobias Krahn, Bharat Thakrar, Gerard Freriks, Tomas Bergvall, Ali Anil Sinaci, [Building the Semantic Interoperability Architecture Enabling Sustainable Proactive Post Market Safety Studies](/projects/salus/docs/SALUSSIMIPaperFinal.pdf), Accepted as a poster in [SIMI 2012 Wokshop](http://grid.ece.ntua.gr/sites/simi2012/index.html) (Semantic Interoperability in Medical Informatics), in ESCW 2012: Extended Semantic Web Conference, May 27, 2012 in Heraklion (Crete), Greece ([Poster](/projects/salus/docs/poster_SALUS_SIMI2012.pdf)).\n*   Gokce B. Laleci Erturkmen, Asuman Dogac, Mustafa Yuksel, Sajjad Hussain, Gunnar Declerck, Christel Daniel, Hong Sun, Kristof Depraetere, Dirk Colaert, Jos Devlies, Tobias Krahn, Bharat Thakrar, Gerard Freriks, Tomas Bergvall, Ali Anil Sinaci, Building the Semantic Interoperability Architecture Enabling Sustainable Proactive Post Market Safety Studies, SIMI 2012 Wokshop (Semantic Interoperability in Medical Informatics), in ESCW 2012: Extended Semantic Web Conference, May 27, 2012 in Heraklion (Crete), Greece.\n\n### Qi Ta Lei \n\n*   SALUS Infosheet: [Blog post](http://blog.salusproject.eu/?p=433), [PDF](/projects/salus/docs/SALUS_InfoSheet_Jan2014.pdf)\n*   SALUS Project article in [Uppsala Report, No 62, July 2013](/projects/salus/docs/27720-June2013.pdf)\n*   SALUS Advisory Board Meeting Presentations - January 16-17, 2013\n\n*   [SALUS Overview](/projects/salus/docs/SALUSOverviewJanuary2013v2.pdf)\n*   [SALUS Semantic Middleware](/projects/salus/docs/SALUS Semantic Middleware - January 2013.ppt)\n*   [SALUS ADE Detection and ICSR Reporting Tools](/projects/salus/docs/SALUS ADE Detection and ICSR Reporting Tool - January 2013.pptx)*   SALUS Project article in[ Uppsala Report, No 59, October 2012](/projects/salus/docs/UppsalaReportsOctober2012.pdf)\n*   SALUS Project article in [OFFIS Data Work, No 54, June 2012](/projects/salus/docs/OFFIS_datawork54_01.pdf)\n*   SALUS Project article in [Uppsala Report, No 57, April 2012](/projects/salus/docs/UppsalaReportApril2012.pdf)\n*   SALUS result \"Jena based Implementation of a ISO 11179 Meta-data Registry\" was presented in the  \"Linked Data\" track of ApacheCon EU. The presentation is available [here](http://www.slideshare.net/sinaci/jena-based-implementation-of-a-iso-11179-meta-data-registry-15066461).\n*   [SALUS ID-Card](/projects/salus/docs/SALUS-fp7factsheet.pdf), February 2012\n*   [SALUS White Paper](/projects/salus/docs/SALUSwhite_paper-Final.pdf) \n## Yuan Dai Ma \t\t\n* SemanticMDR:Ji Yu ISO/IEC 11179De  Yuan Shu Ju Zhu Ce Ku He Yuan Shu Ju Cang Ku \t\t \n* Ontmalizer:Cong XML SCHEMA(xsdWen Jian )He XMLShu Ju Dao RDF/OWLZi Dong Zhuan Huan De Gong Ju \t\t\n\n## Qi Ta \n[Zhong Ying Wen Ci Hui Dui Zhao ](term.md)\n[Yao Wu Bu Liang Fan Ying Shu Ju Ku ](doc/material/Finalrepository_2Sep2014_DLP30June2013.pdf)[Lai Yuan ](http://www.imi-protect.eu/adverseDrugReactions.shtml)", 
  "id": 23652608
}