{
  "read_at": 1462558500, 
  "description": "", 
  "README.md": "#DBG2OLC\n=======\nEfficient Assembly of Large Genomes Using Long Erroneous Reads of the Third Generation Sequencing Technologies\nhttp://arxiv.org/abs/1410.2801\n\nThe manual can be downloaded from:\n\nhttps://github.com/yechengxi/DBG2OLC/raw/master/Manual.docx\n\nTo use precompiled versions,please go to:\n\nhttps://github.com/yechengxi/DBG2OLC/tree/master/compiled\n\nTo compile, download the source code of each program into separate folders and use: \n\ng++ -O3 -o SparseAssebmler *.cpp\n\ng++ -O3 -o DBG2OLC *.cpp\n\ng++ -O3 -o Sparc *.cpp\n\n\n#Commands for Hybrid Assembly:\n\n##Step0. [Optional] Preparations:\n\nWe have provided code to help you select a subset of the reads:\n\nhttps://github.com/yechengxi/AssemblyUtility\n\nAfter compilation, you can use the following command to select a subset of reads from fasta/fastq files. Note that longest 0 is used here, if you set it to 1 it will select the longest reads.\n\n./SelectLongestReads sum 600000000 longest 0 o Illumina_50x.fastq f Illumina_500bp_2x300_R1.fastq\n\n./SelectLongestReads sum 260000000 longest 0 o Pacbio_20x.fasta f Pacbio.fasta\n\nAnd you can use the following command to evaluate an assembly.\n\n./AssemblyStatistics contigs YourAssembly.fasta\n\nThe program will generate two txt files containing essential statistics about your assembly.\n\nStep1. Use an accurate DBG-assembler to construct short but accurate contigs. Please make sure they are the raw DBG contigs without using repeat resolving techniques such as gap closing or scaffolding. Otherwise you may have poor final results due to the errors introduced by the heuristics used in short read assembly pipelines.\n\nSparseAssembler command format:\n\n./SparseAssembler GS GENOME_SIZE NodeCovTh FALSE_KMER_THRESHOLD EdgeCovTh FALSE_EDGE_THRESHOLD k KMER_SIZE g SKIP_SIZE f YOUR_FASTA_OR_FASTQ_FILE1 f YOUR_FASTA_OR_FASTQ_FILE2 f YOUR_FASTA_OR_FASTQ_FILE3_ETC\n\nA complete example on the S.cer w303 dataset:\n\nDownload the Illumina reads from\n\nftp://qb.cshl.edu/schatz/ectools/w303/Illumina_500bp_2x300_R1.fastq.gz\n\nNormally with ~50x coverage, NodeCovTh 1 EdgeCovTh 0 can produce nice results.\n\n./SparseAssembler LD 0 k 51 g 15 NodeCovTh 1 EdgeCovTh 0 GS 12000000 f ../Illumina_data/Illumina_50x.fastq\n\nIn this test run, the N50 is 29 kbp. As we have selected the beginning part of the sequencing file, which can be of lower quality, the next step may help to improve the assembly quality.\n\n##[Miscellaneous]\nFor other more complex genomes or a different coverage, the first run may not generate the best result. The previous computations can be loaded and two parameters can be fine-tuned to construct a cleaner de Bruijn/ k-mer graph:\n\n./SparseAssembler LD 1 NodeCovTh 2 EdgeCovTh 1 k 51 g 15 GS 12000000 f ../Illumina_data/Illumina_50x.fastq\n\nThe N50 is improved to 32kbp in my run.\n\nThe output Contigs.txt will be used by DBG2OLC.\n\n##Step2. Overlap and layout.\n\nFeed DBG2OLC with the contig file in fasta format from the previous step (Contigs.txt in this example). \n\nDownload the PacBio reads from:\n\nftp://qb.cshl.edu/schatz/ectools/w303/Pacbio.fasta.gz\n\nThe basic command format of DBG2OLC is:\n\n./DBG2OLC k KmerSize AdaptiveTh THRESH_VALUE1 KmerCovTh THRESH_VALUE2 MinOverlap THRESH_VALUE3 Contigs NGS_CONTIG_FILE f LONG_READS.FASTA RemoveChimera 1 \n\nIn the following example, the first 20x PacBio reads are extracted from the abovementioned file and we can assemble with:\n\n./DBG2OLC k 17 AdaptiveTh 0.0001 KmerCovTh 2 MinOverlap 20 RemoveChimera 1 Contigs Contigs.txt f ../Pacbio_data/Pacbio _20x.fasta \n\nIn our test run, the N50 is 583kbp.\n\nThere are three major parameters that affect the assembly quality:\n\nM = matched k-mers between a contig and a long read.\n\nAdaptiveTh: adaptive k-mer matching threshold. If M < AdaptiveTh* Contig_Length, this contig cannot be used as an anchor to the long read.\n\nKmerCovTh: fixed k-mer matching threshold. If M < KmerCovTh, this contig cannot be used as an anchor to the long read.\n\nMinOverlap: minimum overlap score between a pair of long reads.\nFor each pair of long reads, an overlap score is calculated by aligning the compressed reads and score with the matching k-mers.\n \n##[Miscellaneous]\n\nAt this point, the parameters may be fine-tuned to get better performance. As with SparseAssembler, LD 1 can be used to load the compressed reads/anchored reads. \n\nSuggested tuning range is provided here:\n\nFor 10x/20x PacBio data: KmerCovTh 2-5, MinOverlap 10-30, AdaptiveTh 0.001~0.01.\n\nFor 50x-100x PacBio data: KmerCovTh 2-10, MinOverlap 50-150, AdaptiveTh 0.01-0.02. \n\nSome other less flexible or less important parameters:\n\nk: k-mer size, 17 works well.\n\nContigs: the fasta contigs file from existing assembly.\n\nMinLen: minimum read length. \n\nRemoveChimera: remove chimeric reads in the dataset, suggest 1 if you have >10x coverage. \n\nFor high coverage data (100x), there are two other parameters:\n\nChimeraTh: default: 1, set to 2 if coverage is ~100x.\n\nContigTh: default: 1, set to 2 if coverage is ~100x.\n\nThese two are used in multiple alignment to remove problematic reads and false contig anchors. When we have high coverage, some more stringent conditions shall be applied as with the suggested parameters.\n\n##Step 3. Call consensus. \n\nInstall blasr and the consensus module (sparc/pbdagcon). Make sure they are in your path variable. \nThe input files for consensus are: \n\n(1) backbone_raw.fasta by DBG2OLC\n\n(2) DBG2OLC_Consensus_info.txt by DBG2OLC\n\n(3) DBG contigs (in fasta format)\n\n(4) PacBio reads (in fasta format)\n\nYou can check the N50 of (1) to see if you are satisfied, otherwise keep tuning and don!-t proceed.\n\n// this is to concatenate the contigs and the raw reads for consensus\n\ncat Contigs.txt pb_reads.fasta > ctg_pb.fasta\n\n// we need to open a lot of files to distribute the above file into lots of smaller files\n\nulimit -n unlimited\n\n//run the consensus scripts\n\nsh ./split_and_run_sparc.sh backbone_raw.fasta DBG2OLC_Consensus_info.txt ctg_pb.fasta ./consensus_dir 2 >cns_log.txt\n\n#Commands used to assemble other genomes:\n\nThe A. thaliana Ler-0 dataset:\n\n20x PacBio reads:\n\n./DBG2OLC KmerCovTh 2 AdaptiveTh 0.005 MinOverlap 20 RemoveChimera 1 Contigs Contigs.txt k 17 f ../PacBio/20x.fasta\n\n40x PacBio reads:\n\n./DBG2OLC  KmerCovTh 2 AdaptiveTh 0.01 MinOverlap 20 RemoveChimera 1 Contigs Contigs.txt k 17 f ../PacBio/40x.fasta\n\nThe H. sapiens dataset:\n\nLongest 30x PacBio reads:\n\n./DBG2OLC k 17 KmerCovTh 2 MinOverlap 20 AdaptiveTh 0.01 RemoveChimera 1 Contigs Contigs.txt f 30x.fasta >DBG2OLC_LOG.txt\n\n\n#Commands for Non-hybrid NGS Assembly:\n\n\nThe program command is slightly different for purly Illumina reads assembly.  \n\nExample command: \n./DBG2OLC LD 0 MinOverlap 70 PathCovTh 3 Contigs Contigs.txt k 31 KmerCovTh 0 f ReadsFile1.fa f ReadsFile2.fq f MoreFiles.xxx\n\nThere are four critical parameters:\n\nk: k-mer length (max size: 31).\n\nKmerCovTh: explained above, suggest 0-1.\n\nMinOverlap: explained before.\n\nPathCovTh: the minimum occurrence for a compressed read for a compressed read to be used, suggest  1-3.\n\nAssembly is reported as DBG2OLC_Consensus.fasta.\n\nThe command we used for E. coli Illumina Miseq dataset:\n\n./DBG2OLC k 31 PathCovTh 2 MinLen 50 MinOverlap 31 Contigs Contigs.txt KmerCovTh 0 f reads.fasta \n\n\n", 
  "id": 23664739
}