{
  "read_at": 1462558290, 
  "description": "Solvation model for the plane wave DFT code VASP http://vaspsol.mse.ufl.edu/", 
  "README.md": "[![vaspsol](docs/logo.jpeg)](http://vaspsol.mse.ufl.edu/)\n\nWe have implemented an implicit solvation model that describes the effect of \nelectrostatics, cavitation, and dispersion on the interaction between a solute \nand solvent into the plane-wave DFT code VASP. Our implementation provides a \ncomputationally efficient means to calculate the effects of solvation on molecules \nand crystal surfaces as well as reaction barriers. The strength of our solvation model \nimplementation is its capability to handle large periodic systems such as metal and \nsemiconductor surfaces and its interoperability with standard ultrasoft pseudopotential and \nprojector-augmented wave potential libraries.\n\nPrerequisites\n===============\n[VASP](http://www.vasp.at/) versions 5.2.12 or 5.3.3 or 5.3.5 or 5.4.1.\n\nCompiler and library requirements are the same as that of VASP ([vasp wiki] (http://cms.mpi.univie.ac.at/wiki/index.php/Installing_VASP))\n\nInstallation\n=============\n\nFor VASP versions >= 5.4.1:\n----------------------------\n\nThese versions of VASP support solvation calculations out of the box.\nThe only thing that the user needs to do is to update the solvation routines by copying \nthe **VASPsol/src/solvation.F** file to the src/ folder in the original VASP folder, **vasp.5.4.X/src/** and \nfollow the install instructions for the compilation of the original VASP.\n\n**Note:**\n\n*VASP.5.4.1 by default compiles all the three binaries: standard one(vasp_std), gamma version(vasp_gamma) and \nthe one for noncollinear calculations(vasp_ncl). Some users have reported in the past that the version 5.4.1 \ncompilation fails after updating the solvation related files. This was due to the fact that the solvation \nmodules were written and tested using the real to complex FFTs(same as vasp_std and vasp_gamma) whereas \nthe non-collinear compilation uses complex to complex FFTs. The issue has been fixed and all three binaries \nwill compile fine without any errors.*\n\nFor VASP versions = 5.2.12 or 5.3.3 or 5.3.5:\n----------------------------------------------\n\n**Note:**\n\n*VASP license prohibits us from distributing the patch files on a public platform like github.\nIf you would like to use VASPsol with VASP versions 5.2.12, 5.3.3 or 5.3.5, please contact \nDr. Richard Hennig (rhennig[at]mse.ufl.edu) or me (km468[at]cornell.edu) to obtain the required patch file.\nSorry for the inconvenience*\n\n- Apply the appropriate interface patch to the original VASP source code. There are 3 interface_patch files \navailable in the **VASPsol/patches** folder, one for each supported versions of VASP.\n```   \n    cd <VASP src directory>\n    patch -p1 < <path to the interface patch file>\n```\n- After applying the patch, copy **VASPsol/src/solvation.F** file to the VASP source directory:\n- In the original VASP Makefile, put solvation.o object file name before pot.o in that order.\n- ``` make clean ```\n- ``` make ```\n\n**Note:**\n\nThe file **VASPsol/src/solvation.F** combines all the modules defined in the files in the folder \n**VASPsol/src/modules** so as to conform with the new builtin interface for solvation in vasp(versions >= 5.4.1).\nThe files in the **VASPsol/src/modules** folder do not play any role in the installation procedure.\n\nUsage\n======\nPlease see the file USAGE.md in the docs folder for instructions and the examples folder for some sample calculations.\n\nReferences\n===========\nIf you use the VASPsol package in your research, please cite the following papers:\n\nImplicit solvation model for density-functional study of nanocrystal surfaces and reaction pathways.\n K. Mathew, R. Sundararaman, K. Letchworth-Weaver, T. A. Arias, and R. G. Hennig, J. Chem. Phys. 140, 084106 (2014), [doi:10.1063/1.4865107] (http://dx.doi.org/10.1063/1.4865107).\n\nImplicit self-consistent description of electrolyte in plane-wave density-functional theory. K. Mathew and R. G. Hennig, arXiv (2016), [arXiv:1601.03346] (http://arxiv.org/abs/1601.03346).\n\nLicense\n=========\nVASPSol is released under the terms of Apache version 2.0 license:\n\nCopyright 2013-2015 Kiran Mathew and Richard Hennig\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\nFor discussions and feedback\n=============================\nJoin our mailing list: https://groups.google.com/forum/#!forum/vaspsol\n\nContributing\n=============\nPlease contact Dr. Richard Hennig (rhennig[at]mse.ufl.edu)\n\nAuthors\n========\nKiran Mathew\n\nDr. Richard Hennig\n", 
  "id": 23792558
}