{
  "readme": "CUR Matrix Decomposition\n\nThe CUR matrix decomposition approximates an arbitrary data matrix by selecting a subset of columns and a subset of rows to form a low-rank approximation. This method overcomes a fundamental drawback of standard PCA analysis: that the principal components and the loading vectors are dense. Dense components and dense loadings suffer from\ntwo main disadvantages: a loss of sparsity and reduced interpretability. The CUR decomposition is a product of three matrices: two (C and R) are tall and skinny and preserve the sparsity of the data matrix, while the third (U) is a relatively small dense matrix. Thus the CUR approxi- mation is cheaper to work with and store. The CUR decomposition can also be easier to interpret than standard PCA because the rows and columns selected can highlight special influential combinations of the data variables. This mat not be possible with a dense approximation.\n\nThis matlab package provides following algorithms for CUR matrix decomposition:\n1) Naive uniform sampling algorithm\n2) Subspace sampling algorithm\n3) Near optimal column selection based algorithm \n4) Determinisitc unweighted column selection based algorithm\n5) Randomized unweighted column selection based algorithm\n\n./algorithms\nThis folder includes algorithms described above\n\n./algorithm_comparison_experiments\nThis folder includes several secripts to compare different algorithms on various datasets\n\nSome code and datasets are from\nhttp://users.cms.caltech.edu/~gittens/nystrombestiary/\nA. Gittens and M. W. Mahoney. Revisiting the Nystro m method for improved large-scale ma- chine learning. arXiv preprint arXiv:1303.1849, 2013.\n\nCode of Near optimal column selection based algorithm is from\nhttps://sites.google.com/site/zjuwss/\nS. Wang and Z. Zhang. Improving CUR matrix decomposition and the Nystro m approximation via adaptive sampling. Journal of Machine Learning Research, 14(1):2729-2769, 2013.", 
  "read_at": 1462558288, 
  "description": "A matlab library for CUR matrix decomposition", 
  "id": 23927637
}