{
  "read_at": 1462558279, 
  "description": "Module for opening, manipulating, and plotting mock galaxy images produced with SUNRISE", 
  "README.md": "#sunpy\n\nModule for opening, manipulating, and plotting mock galaxy images produced with SUNRISE.\nThis module has been developed to support the Illustris Image Pipeline (http://arxiv.org/abs/1411.3717).  \n\n\n## Table of Contents \n - [Data Access](#data-access)\n - [Example Usage](#example-usage)\n - [Contributors](#contributors)\n \n\n## Data Access\nThe sunpy module operates on FITS files produced by the SUNRISE radiative transfer code.\nThe module was developed with the specific intent of being used in the Illustris Image Pipeline \npublically available data set.  \nAccess to the data can be obtained through the Illustris Website (http://www.illustris-project.org/) \nby registering under the \"Galaxy Observatory\" tab.  Once this is done, users are able to search and \ndownload individual and batches of FITS files.\n\nAlternatively, the mock images can also be downloaded directly from URL's that take the following form\n```\nhttp://illustris.rc.fas.harvard.edu/data/illustris_images/subdir_543/broadband_12345.fits\n```\nIn this path there are two relevant numbers:  the subdir number (always 3 digits, in this case 543) and the galaxy number (in this case, 12345).  \nIn order for you to download a FITS file directly, you'll need to know both numbers.  \nAn ASCII file with three columns: subdir number, galaxy number, and the log of the stellar mass can be found here\n```\nhttp://illustris.rc.fas.harvard.edu/data/illustris_images_aux/directory_catalog_135.txt\n```\nOnce you have the list of corresponding subdir numbers and galaxy numbers, it is straight forward to piece together the full URL from which the content can be downloaded.  \nThis can executed in practice either through your browser, or using wget or a similar command.\n\n\n## Example Usage\nExample scripts showing how to access, open, manipulate, and plot the data can be found in this repository under the examples folder.\n\n\n\n## Contributors\n\nContributors:\n- Paul Torrey (ptorrey@mit.edu)\n- Greg Snyder (gsnyder@stsci.edu)\n\n\n\nGreg Snyder is responsible for the \"image realism\" components of this module including:\n  - PSF blurring\n  - Rebinning images to new pixel scale given input redshift and telescope angular resolution\n  - Adding of random noise\n  - Adding of background images (SDSS)\n\n\nPaul Torrey is responsible for most of the FITS file loading, manipulation, and plotting routines.\n\n\n\n\n\n\n", 
  "id": 23922721
}