{
  "read_at": 1462558463, 
  "description": "A Billiard Simulator For Test Dynamical systems", 
  "README.md": "# Billiard Ball Simulator\n\nThis program is designed to run large scale billiard ball simulations. It is capable of handling around 10,000,000 balls. It was used to investigate dynamical systems with entropy boundary conditions and perturbations. There is a strange effect that given time boundary conditions the effect of perturbations will follow the direction of entropy increase. It is hypothesized that causality is a result of entropy increase. More information on such matter can be found in my professors paper Causality is an Effect.  http://arxiv.org/abs/cond-mat/0011507\n\n## Text file example\n\nHere is what a text file containing ball information might look like\n\n```\n10000 (number of balls\n\n-1  0 (x, y position \n.4  0.0  (velocity_x, velocity_y) \n...\n\n...\n```\n\nWhen running this file using the graphics it produces this simulation\n\n\n\n![ScreenShot](https://github.com/loliverhennigh/Bill/blob/master/run_pic.png)\n\n\n## How it works\n\nThe algorithm is very simple. It just iterates through all the balls calculating there final position one at a time. \n\n## Commands\n\nHere is a list of commands\n\n```\nt = timestep of .001\n\nf = timestep of .01\n\ng = timestep of .1\n\n- = reverse direction\n\n1 = fullscreen\n\n2 = exit fullscreen\n\narrows = rotate\n\nw,a,s,d = move the image\n```\n\n\n## How to compile\n\n\nTo use this program without graphics it is very simple. A example main file called bill.cpp is provided to show all file io commands.\n\nThe graphics side is very simple as well. You will need gsl and glut (if you would like graphics). To install these on ubunto simply type\n\n```\nsudo apt-get install libgsl0-dev\n```\n\nand\n\n\n```\nsudo apt-get install freeglut3-dev\n```\n\nNext compile the program\n\n```\nmake\n```\n\nand to execute\n\n```\n./bill\n```\n\nIf glut gives you any trouble consult http://kiwwito.com/installing-opengl-glut-libraries-in-ubuntu/\n\n\n\n\n\n\n\n\n\n", 
  "id": 23976632
}