{
  "read_at": 1462558324, 
  "description": "Optimally-weighted herding is Bayesian Quadrature", 
  "README.md": "Optimally-weighted Herding is Bayesian Quadrature\n=============\n\n<img src=\"https://raw.githubusercontent.com/duvenaud/herding-paper/master/paper/figures/lovers2.png\" width=\"300\">\n\nThis repo contains the experiment source code as well as the latex source for a paper that mathematically relates two very different approaches to approximate integration.\n\nhttp://arxiv.org/pdf/1204.1664.pdf\n\nThis paper was accepted as an oral presentation at the 2012 Uncertainty in Artificial Intelligence conference.\n\n### Abstract:\n\nHerding and kernel herding are deterministic methods of choosing samples which summarise a probability distribution.  A related task is choosing samples for estimating integrals using Bayesian quadrature.  We show that the criterion minimised when selecting samples in kernel herding is equivalent to the posterior variance in Bayesian quadrature.  We then show that sequential Bayesian quadrature can be viewed as a weighted version of kernel herding which achieves performance superior to any other weighted herding method. We demonstrate empirically a rate of convergence faster than O(1/N).  Our results also imply an upper bound on the empirical error of the Bayesian quadrature estimate.\n\n### Contact the Authors:\n\n* [David Duvenaud](http://mlg.eng.cam.ac.uk/duvenaud/) (dduvenaud@seas.harvard.edu)\n* [Ferenc Huszar](http://mlg.eng.cam.ac.uk/ferenc/) (ferenc.huszar@gmail.com)\n\nRunning the code:\n-------------------------\nRunning code/demo.m automatically reproduces most of the figures in the paper,\nwith some of the settings turned down to make the demo run fast.\n\nIf you want to exactly reproduce the results found in the paper, set\n\nnum_samples = 400;\nnum_queries = 10000;\n\nThe code used was optimized for legibility and simplicity, not speed.\nThus the herding implementation is O(N^3) instead of O(N^2), and the BQ implementation is O(N^4) instead of O(N^3).\n\nFeel free to contact us if you have any questions.\n", 
  "id": 24026396
}