{
  "read_at": 1462558461, 
  "description": "Simulation for relativistic particles in electromagnetic fields", 
  "README.md": "Partikel101\n===========\n!!!!!!!IMPORTANT:\nUse the branch Units oder Penning if you would like to work with the code.!!!!!!\n\n\n\nSimulation for relativistic particles in electromagnetic fields. \nProject during internship Helmholtz Zentrum Dresden-Rossendorf www.hzdr.de\n\n\n\nLanguage: Python\nLibraries: SciPy(incl. Matplotlib etc.)\n\nIt's now finished and will not be updated. \nThe three branches: \n\nMaster: Was the first prototype without correct units, only simulates a homogenic magnetic field and\n        one electron.Note that this branch is the most useless.\n        \nunits: Simulates a resonator cavity. ~1m length and an elektron starts with a kinetic energy of 20MeV\n\nPenning: Simulates Ions in a Penning trap, the user has to configure the requiered frequency w_+ (See wikipedia or arxiv\n         for more deails) the programm will calculate the rest. \n\n\n\n\nUsage:\n\n    \n    Update the functions E_Feld and B_Feld to your wanted fields,\n    the parameters x, y, z and t are useable. The B-field's unit is Tesla,\n    the unit of the electrical field is V/m.\n    Change the values for your disered particle, whereas the first parameter\n    is the beginning location in metre, the second vector is the velocity\n    in m/s, followed by the mass in kg and it's charge in coulomb. Be aware\n    of using to small numbers due to the limited precision of the computer\n    at that small numbers for e.g. protons or electrons.\n    At last set the start- and endtime in the line starting with\n    comput.start by changing the 4th and 5th parameter (time in seconds). for\n    more precise results change the dt-steps for the integration in the line\n    above by inserting any number when creating Computer(<desired dt>),\n    standard is 10^-3 seconds.\n    The whole starting and inital conditions are in exec.py as the central \n    script to change all the possible conditions. The other classes are just\n    intended to solve the rest. \n", 
  "id": 24056199
}