{
  "read_at": 1462558257, 
  "description": "Mathematica package for algebraic calculations in elementary particle physics.", 
  "README.MD": "# FeynCalc\n\n[![license: GPLv3](https://img.shields.io/badge/license-GPLv3-brightgreen.svg)](https://github.com/FeynCalc/feyncalc/LICENSE.md)\n[![latest release](https://img.shields.io/github/release/FeynCalc/feyncalc.svg)](https://github.com/FeynCalc/feyncalc/releases)\n![compatibility](https://img.shields.io/badge/Mathematica-8.x_9.x_10.x-brightgreen.svg)\n\n\n[FeynCalc](http://www.feyncalc.org/) is a Mathematica package for symbolic evaluation of Feynman diagrams and\nalgebraic calculations in quantum field theory and elementary particle physics.\n\nVisit our [wiki](https://github.com/FeynCalc/feyncalc/wiki) to learn more about FeynCalc!\n\n# Using FeynCalc in your research\n\nDevelopment of FeynCalc costs of a lot of effort and is done on a largely voluntarily basis.\nTo support the developers and increase their academic visibility, please acknowledge our work\nwhen you use FeynCalc in your research. You can do so by citing the two FeynCalc papers:\n\n\n* V. Shtabovenko, R. Mertig and F. Orellana, \"New Developments in FeynCalc 9.0\", TUM-EFT 71/15, arXiv:1601.01167.\n\n* R. Mertig, M. Bohm, and A. Denner, \"Feyn Calc - Computer-algebraic calculation of Feynman amplitudes\",\nComput. Phys. Commun., 64, 345--359, 1991.\n\n# License\n\nFeynCalc is covered by the GNU General Public License 3.\n\nCopyright (C) 1990-2016 Rolf Mertig\nCopyright (C) 1997-2016 Frederik Orellana\nCopyright (C) 2014-2016 Vladyslav Shtabovenko\n\nFeynCalc is free software: you can redistribute it and/or modify\nit under the terms of the GNU General Public License as\npublished by the Free Software Foundation, either version 3 of\nthe License, or (at your option) any later version.\n\nFeynCalc is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with FeynCalc.  If not, see <http://www.gnu.org/licenses/>.\n", 
  "id": 24136946
}