{
  "read_at": 1462551227, 
  "description": "An Analysis Tool for High-Energy Physics", 
  "README.md": "A4 - An Analysis Tool for High-Energy Physics\n---------------------------------------------\n\nA4 is a data processing format, tool-set and library which provides fast I/O\nof structured data using the Google protocol buffer library:\nhttp://code.google.com/p/protobuf/\n\nThis is currently an experimental project, but has already been successfully\napplied to physics analysis.\n\nFor instructions on how to install A4, see INSTALL. \nMore documentation is in the [doc/](http://liba4.net/a4/blob/master/doc/) directory. \nSee also the [FAQ](http://liba4.net/a4/blob/master/doc/FAQ.md).\nAn overview of the structure and a preliminary look at the performance is available at\n[arxiv:1208.1600](http://arxiv.org/abs/1208.1600).\n\nIf you are impatient, try:\n\n    git clone https://github.com/a4/a4.git\n    cd a4\n    ./waf go\n    source install/bin/this_a4.sh\n    cd tutorial/\n\nFor a quick start install A4 and take a look at the examples\nin the tutorial directory.\n\nInspired and building on Samvel Khalatyans [RTvsPBThreads](https://github.com/ksamdev/RTvsPBThreads)\n\n\nOverview\n--------\n\n## Modular organization\n\n * a4io provides fast I/O of protobuf events to a custom file format\n * a4process contains processor classes with overridable event loops\n * a4hist contains fast and easy to use histogramming classes\n * a4store provides a way to define and fill histograms on one line in the loop\n * a4root contains conversion routines and tools from a4 to ROOT and back\n * a4plot is a container module for ROOT plotting tools\n * a4atlas contains ATLAS-specific event and metadata definitions and tools\n\n## Key features\n\n * Store protobuf messages of arbitrary types\n * Stores the description of messages, making the format self-describing\n * Transparent compression using different algorithms (zlib, gzip and snappy)\n * Store metadata messages for blocks of events\n * Binary concatenation of A4 files yields a valid A4 file with all metadata\n * Support linear no-seeking mode of operation, suitable for network streaming\n * Tries to minimize manual book-keeping\n", 
  "id": 2416428
}