{
  "read_at": 1462558440, 
  "description": "Symmetric Tensor Eigen-Rank-One Iterative Decomposition", 
  "README.md": "Symmetric Tensor Eigen-Rank-One Iterative Decomposition (STEROID) and the Permuted QR algorithm for symmetric tensors (PQRST)\n-----------------------------------------------------------------------------------------------------------------------------\n\nThe Symmetric Tensor Eigen-Rank-One Iterative Decomposition (STEROID) decomposes an arbitrary symmetric tensor A into a real linear combination of unit-norm symmetric rank-1 terms. Sparse symmetric tensors are also supported. Z-eigenpairs of A can be computed using a STEROID-based implementation of the Permuted QR algorithm for symmetric tensors (PQRST).\n\n1. Functions\n------------\n\n* [V,d,lambdas,e,tail]=steroid(A) or [V,d,lambdas,e,tail]=steroid(A,method)\n\nUse this function to compute the STEROID of a symmetric tensor A. The least-squares problem W*d=vec(A) is solved according to the given 'method' input argument.\n\n* [V,d,lambdas,e,tail]=steroids(polyA,R)\n\nUse this function to compute the STEROID of a sparse symmetric tensor A, where A is represented as a homogeneous polynomial. This method can be highly advantageous in terms of required memory and time complexity for very sparse tensors of high dimension. Instead of the full eigenvalue decomposition, only R terms corresponding with the highest eigenvalues are computed. The least-squares problem W*d=vec(A) is always solved using the W^T*W method.\n\n* [lambda,V,err,itr]=pqrst(A,tol,kmax,shifting,R)\n\nSTEROID-based implementation of the Permuted QR algorithm for Symmetric Tensors (PQRST), computes possible Z-eigenpairs (lambda,V) of A.\n\n* A=randsymten(d,n)\n\nCreates a random symmetric tensor of order d and dimension n.\n\n* e=symcheck(A)\n\nChecks the symmetry of A for all permutations of its indices.\n\n* B=embed(A)\n\nEmbeds a symmetric d-way tensor A with odd d into a symmetric d+1-way tensor B such that B(:,:,...,:,1)=A.\n\n* [lindex index]=exp2ind(mons)\n\nConverts homogeneous monomial exponents into a linear and tensor index of a d-way symmetric tensor of dimension n.\n\n* [U,V,D,e]=svdsteroid(A,method)\n\nCombination of an SVD and STEROID for a tensor A that is symmetric in all but the first mode.\n\n* demo.m\n\nSmall demo that illustrates the use of steroid.m\n\n2. Reference\n------------\n\n\"Symmetric Tensor Decomposition by an Iterative Eigendecomposition Algorithm\"\n\nhttp://arxiv.org/abs/1409.4926\n\n* A QR Algorithm for Symmetric Tensors\n\nhttp://arxiv.org/abs/1411.1926\n\nAuthors: Kim Batselier, Ngai Wong\n", 
  "id": 24171232
}