{
  "read_at": 1462558426, 
  "description": "Implementation of the submodular relaxation algorithms", 
  "README.txt": "This software implements several methods for MRF energy minimization based on the Lagrangian relaxation approach. \nEach method consists of two parts: the convex optimization routine to maximize the dual and the oracle to compute the value and the subgradient of the dual given some value of the dual variables (Lagrange multipliers).\n\nWe provide the following oracles:\n1) SMR oracle applicable for pairwise associative MRFs;\n2) SMR oracle speeded up by the usage of dynamic graph cuts (pairwise associative MRFs);\n3) DD TRW oracle applicable for pairwise associative MRFs [27];\n4) SMR oracle applicable for energies with high-order robust P^n Potts potentials;\n5) DD TRW oracle (CWD) applicable for energies with high-order robust P^n Potts potentials;\n6) NSMR oracle applicable for pairwise non-associative MRFs;\n7) SMR oracle applicable for pairwise non-associative MRFs via the \"subtraction trick\".\n\nWe provide the following optimization routines:\n1) subgradient method with adaptive stepsize [14];\n2) bundle method with fixed size of the bundle [14];\n3) bundle method with the aggregated bundle (Kiwiel's rule) [14, 16];\n4) LMBM method [10];\n5) L-BFGS for non-smooth function (Hanso library [30]).\n\nIf you use this code, please, cite the following paper in any resulting publication:\n\nAnton Osokin, Dmitry Vetrov, Submodular Relaxation for Inference in Markov Random Fields,\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 37(7): 1347-1359, July 2015.\n\nThe full text is available on arXiv.org (with some typos corrected):\nhttp://arxiv.org/abs/1501.03771\n\nAnton Osokin, (firstname.lastname@gmail.com)\n\nINSTALLATION\n-----------------------------\n1) Download the package\n2) Run ./setup_SMR from the package folder (requires internet connection to download the GCO library)\n3) Run ./example_SMR \n\nThe code was tested under \n- Win7-x64 using MATLAB R2014a and MSVC 2012 + Intel Visual Fortran Composer XE 2013;\n- ubuntu-12.04-x64 using MATLAB R2012a and gcc-4.4\n\nFortran compilers are required exclusively for the LMBM optimization method.\nYou can use all the other parts of the package without Fortran compilers.\n\nCONTENT OF THE PACKAGE\n-----------------------------\n./setup_SMR - script to add all the parts of the package to PATH\n./build_SMR - script to build all the mexified functions\n./example_SMR - an example of usage\n./optimizationMethods - code for the included optimization methods\n./oracles - code for the oracle functions\n./experiments - scripts to reproduce some experiments from the journal paper\n./data - functions to work with the datasets used in the journal paper\n./mexWrappers - mexified functions including third-party software\n./utils - some helper functions\n\nLICENSE\n-----------------------------\nThis software is distributed under MIT license that allows free usage of this code for whatever purposes.\n\nPlease note, that some third-party software included in this package are distributed under RESEARCH ONLY license. Please contact the authors of those packages if you interested in using the software for non-research purposes.\n\nTHIRD-PARTY SOFTWARE\n-----------------------------\nThis package includes a number of third-party libraries. Please cite the corresponding papers if you are using any of those.\n\n1) Boykov-Kolmogorov max-flow/min-cut algorithm:\nY. Boykov and V. Kolmogorov, An experimental comparison of Min-Cut/Max-Flow algorithms for energy minimization in vision, \nIEEE TPAMI, 26(9):1124-1137, 2004.\n\n2) A dynamic version of Boykov-Kolmogorov max-flow/min-cut algorithm:\nY. Boykov and V. Kolmogorov, An experimental comparison of Min-Cut/Max-Flow algorithms for energy minimization in vision, \nIEEE TPAMI, 26(9):1124-1137, 2004.\nP. Kohli and P. Torr, Dynamic graph cuts for efficient inference in markov random fields, IEEE TPAMI, 29(12):2079-2088, 2007.\n\n3) QPBO algorithm for energy minimization:\nV. Kolmogorov and C. Rother. Minimizing non-submodular functions with graph cuts - a review. IEEE TPAMI, 29(7):1274-1279, July 2007\n\n4) TRW-S algorithm for energy minimization:\nV. Kolmogorov, Convergent tree-reweighted message passing for energy minimization, IEEE TPAMI, vol. 28, no. 10, pp. 1568-1583, 2006.\n\n5) Alpha-expansion algorithm for energy minimization \nY. Boykov, O. Veksler, R.Zabih, Efficient Approximate Energy Minimization via Graph Cuts, IEEE TPAMI, 20(12):1222-1239, 2001.\n\n6) Hanso - an implementation of L-BFGS method for non-smooth functions. \nA. S. Lewis and M. L. Overton, Nonsmooth optimization via quasi-newton methods, Mathematical Programming, vol. 141, no. 1-2, pp. 135-163, 2013.\n\n7) LMBM optimization method.\nN. Haarala, K. Miettinen, and M. M. Makela, Globally convergent limited memory bundle method for large-scale nonsmooth optimization, Mathematical Programming, vol. 109, no. 1, pp. 181-205, 2007.\n\n8) Alpha-expansion for robust P^n Potts potentials.\nP. Kohli, L. Ladicky, P. H. S. Torr. \nRobust Higher Order Potentials for Enforcing Label Consistency\nInternational Journal of Computer Vision, 82(3):302-324, 2009.\n\n\n\n\n", 
  "id": 24530526
}