{
  "README": "This is our simulator for evaluating the impact of errors in\nestimating the size when performing size-based scheduling in big-data\nworkloads. Details in our technical report, available at \nhttp://arxiv.org/abs/1306.6023.\n\nNeeded software:\n - wget (to get the datasets)\n - Python 3.2 or 2.7\n - Python libraries: numpy, matplotlib (for plots), blist\n\nPay attention: blist v1.3.4 has a trivial bug (a couple of missing\nunderscores) that makes it not work in Python 3.2. At the time of this\nwriting, the problem is fixed on github, but not on the version that\ncan be installed from pypi. If you want to manually fix the bug, it's\nsufficient to replace self._mapping.sortedkeys with\nself._mapping._sortedkeys in lines 32 and 53 of _sorteddict.py.\n\nI got reported that this appears not to be sufficient with the Py2.7\ninstalled by default on MacOS. Contact me with your error if you have\nthis problem.\n\n=== GET THE WORKLOADS ===\n\n$./get_datasets\n(will get the workloads from the SWIM git repository)\n\n=== RUN THE EXPERIMENT ===\n\nusage: ./experiment.py -h\n\nThis will compute the sojourn times for each of the jobs in the\nspecified TSV file using FIFO, PS, SRPT and two variants of FSP that\ncope with errors (described again in our technical report). When\nperforming experiments, it will print the mean sojourn times for each\ninstance of the experiments. Since FIFO and PS do not suffer from\nestimation errors and they only depend on the trace, they will be\ncomputed only once rather than repeated depending on the number of\niterations.\n\nResults will be output in a binary file (Python's shelve format) named\n'results_FILENAME[.tsv stripped]_SIGMA_D-OVER-N_LOAD.s'. If such a\nfile already exists, we simply add the results of more experiment runs\nto it if the number of existing runs is not enough.\n\n=== PLOT THE RESULTS ===\n\nusage: plot_sojourn_vs_error.py -h\nusage: plot_sojourn_vs_load.py -h\nusage: plot_sojourn_vs_dn.py -h\n\n=== REPEAT THE EXPERIMENTS AND PERFORM THE PLOTS IN THE TECHNICAL REPORT ===\n\n$./do_experiments\n$./do_plots", 
  "read_at": 1462511389, 
  "description": "", 
  "id": 24760046
}