{
  "read_at": 1462509945, 
  "description": "Turbo topics find significant multiword phrases in topics.", 
  "readme.txt": "\n        -------------------\n        --- TURBOTOPICS ---\n        -------------------\n\n---------------------------------------------------------------------------\n\n(C) Copyright 2009, David M. Blei (blei@cs.princeton.edu)\n\nThis file is part of TURBOTOPICS.\n\nTURBOTOPICS is free software; you can redistribute it and/or modify it\nunder the terms of the GNU General Public License as published by the\nFree Software Foundation; either version 2 of the License, or (at your\noption) any later version.\n\nTURBOTOPICS is distributed in the hope that it will be useful, but\nWITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\nGeneral Public License for more details.\n\nYou should have a copy of the GNU General Public License along with\nthis program; if not, write to the Free Software Foundation, Inc., 59\nTemple Place, Suite 330, Boston, MA 02111-1307 USA\n\n---------------------------------------------------------------------------\n\n\nThis code contains python scripts for running the TURBOTOPICS method\non either a corpus of documents or a corpus of documents combined with\nthe output of LDA-C.  for both scripts, the corpus is a file of the\noriginal text of documents, one per line.\n\nNote that neither script requires specifying how large N should be in\nthe N-grams.  For more information about the method, see the paper at\n\n    http://arxiv.org/abs/0907.1013\n\nThe two scripts are\n\n  compute_ngrams.py:\n\n  Compute recursive multi-word expressions from a corpus.  This will\n  write out a file of vocabulary (including multi-word expressions)\n  and their counts.\n\n  lda_topics.py:\n\n  Compute multi-word expressions per-topic from a corpus and LDA-C\n  fit.  (Note: the argument --ntopics is the same as K in LDA-C.)\n  This will write out a file for each topic with the expressions and\n  counts.  Again, see the paper for details.\n\nAny questions/comments about this code should be posted to the topic\nmodels mailing list.  Subscribe at\n\n  https://lists.cs.princeton.edu/mailman/listinfo/topic-models\n", 
  "id": 24815038
}