{
  "read_at": 1462511471, 
  "description": "Creates optimal mapping functions for an oriented coarse-grained protein model using data from the Protein Data Bank.", 
  "README.txt": "\nINTRODUCTION\n------------\n\nP-MOST-PDB-Map is software that uses Protein Data Bank structure files to \ncalculate optimal backmapping parameters for the Protein Model with Oriented \nSiTes (P-MOST), compute the root-mean-square displacement for each atom type,\nand create molecular image files describing the mapping and backmapping.\n\nLICENSE\n-------\n\nP-MOST-PDB-Map is free software: you can redistribute it and/or modify it under \nthe terms of the GNU General Public License as published by the Free Software \nFoundation, either version 3 of the License, or (at your option) any later \nversion.\n\nP-MOST-PDB-Map is distributed in the hope that it will be useful, but WITHOUT \nANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS \nFOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with\nP-MOST-PDB-Map.  If not, see <http://www.gnu.org/licenses/>.\n\nPUBLICATION\n-----------\n\nDetails of the oriented coarse-grained protein model appear in my paper:\n\n[1] T. K. Haxton, \"High-resolution coarse-grained modeling using oriented \ncoarse-grained sites,\" submitted (available online at arxiv.org/abs/1409.8658).\n\nAUTHORS, CITATION, AND CONTACT INFORMATION\n-------------------------------------------\n\nP-MOST-PDB-Map was developed by Tom Haxton at the Molecular Foundry, Lawrence \nBerkeley National Laboratory.\n\nI ask that users please cite my publication [1] in any publication presenting \nresults produced with P-MOST-PDB-Map.\n\nThe latest version of P-MOST-PDB-Map can be found at \nhttp://nanotheory.lbl.gov/peptoid_code.\n\nContact: Tom Haxton (tomhaxton@gmail.com)\n\nPLATFORM\n--------\n\nP-MOST-PDB-Map has been tested on Linux and OS X.\n\nREQUIREMENTS\n------------\n\n1. C compiler (e.g. gcc) to compile source code\n2. PDB structure files (available from www.rcsb.org)\n3. VMD to view molecular files (optional)\n\nINSTALLATION\n------------\n\nRun \"make\" in the directory \"code\".\n\nCONTENTS/USAGE\n--------------\n\nroundtrip\n\n   Performs a least-squares fit to minimize the rmsd between original and\n   backmapped atomic configurations, given a set of Protein Data Bank (PDB)\n   files, and outputs the optimal model parameters and root-mean-square-\n   displacement by atom type.\n\n   Options:\n      Several parameter filenames. Defaults are set so that the code needs no \n         arguments if run from any second-level directory (e.g. /code or \n         /scripts).\n      -top_directory: Top of the directory tree containing PDB files to be\n         analyzed.\n      -base: Base of filename (including relative filename) for output files.\n      -discard: Boolean for whether to discard (1 or default) or not discard\n         (0) atoms with irregular geometries\n\n   Outputs:\n      <base>.rmsd: Average position in the frame of the site (before applying\n         any linear correction), component-wise root-mean-square displacement\n         (after applying linear corrections), root-mean-square displacement,\n         count, count if all residues were complete, and non-Gaussian parameter,\n         listed for each atom type\n      <base>.corrections.<RESIDUE>.<ATOM1>.<ATOM2>: Model parameters for ATOM1 \n         in RESIDUE whose backmapping function is a linear function of the\n         predicted position of ATOM2\n\n      <base>.Nterminus_error: List of N-terminal hydrogen atoms that were\n         removed because only one hydrogen was found \n      <base>.entry_average_file: Heavy-atom rmsd, non-Gaussian parameter, and\n         count, and hydrogen rmsd, non-Gaussian parameter, and count, listed by\n         PBD entry\n      <base>.error_files.ensemble: List of PDB entries not used because they\n         contained an ensemble of models\n      <base>.error_files.no_DBREF: List of PDB entries not used because they\n         contained no DBREF entry\n      <base>.error_files.non_amino_acid: List of PDB entries not used because \n         they contained residues other than the 20 natural amino acids\n      <base>.error_files.residue_indicies_out_of_order: List of PDB entries not \n         used because they contained residue indicies out of order within a \n         single chain\n      <base>.error_files.terminal_atom_in_non_terminal_residue: List of PDB \n         entries not used because they contained terminal atom types in non-\n         terminal positions\n      <base>.error_files.unknown_atom: List of PDB entries not used because they\n         contained an unrecognized atom type\n      <base>.file_statistics: List of number of entries excluded by reason\n      <base>.indistinguishable atoms: List of groups of indistinguishable \n         hydrogen atoms that could not be renamed according to their dihedral \n         angles\n      <base>.large_disagreement_file: List of atoms with roundtrip displacements\n         exceeding a threshold (default 1 angstrom)\n      <base>.moments: Average position in the frame of the site, component-wise \n         root-mean-square displacement, root-mean-square displacement, and count\n         for each atom type, before applying any linear corrections and listed\n         for each atom type\n      <base>.overlapping_atoms_error: List of pairs of atoms excluded because\n         both atoms were found at the same position\n\n   Outputs when discard option is on:\n      <base>.bondangle_error: Atoms discarded due to irregular bond angles\n      <base>.bondlength_error: Atoms discarded due to irregular bond lengths\n      <base>.tetrahedra_error: List of groups of atoms excluded because of an\n         irregular molecular geometry around a tetrahedral center\n\n   Outputs (auxillary calculations on the PDB structures):\n      <base>.Cterminus: Average and std dev bond lengths and angles for C-\n         terminus C, O, OXT atoms\n      <base>.radial: Average longitudinal and radial positions in the frame of\n         three adjacent heavy atoms, for groups of terminal hydrogens\n\ncreate_molecular_files\n\n   Creates molecular image files describing the mapping and backmapping \n   functions\n\n   Options:\n      Several parameter filenames. Defaults are set so that the code needs no \n         arguments if run from any second-level directory (e.g. /code or \n         /scripts).\n      -pdbfile: Input PDB structure file\n      -input_base: Directory containing parameter files (outputs of roundtrip)\n      -directory: Output directory\n      -filebase: Base of output files\n\n   Outputs:\n      <directory>/<filebase>.pdb: PDB file matching the input file except that\n         atom positions are replaced with the backmapped atom positions\n      <directory>/<filebase>.<RESIDUE>.<TYPE>.tcl: TCL script to be used with \n         VMD (in TkConsole run \"source <TCLFILE>\") to render an image of the\n         atoms and bonds, colored by coarse-grained site, in the first residue \n         of type RESIDUE in the PDB file.  TYPE denotes whether the atoms are\n         placed in their original positions or their backmapped positions.\n      <directory>/<filebase>.<RESIDUE>.<TYPE>.tcl: As above, and including\n         rendering of vectors representing the coarse-grained sites \n      <directory>/<filebase>.<RESIDUE>.<TYPE>.xyz: Coordinates used in the\n         above two TCL scripts\n\nSCRIPTS\n-------\n\nExample scripts are in the directory \"scripts.\"  They should be modified to\nreflect the location of PDB files on your computer.\n\nPRE-GENERATED OUTPUTS\n---------------------\n\noutput/: Outputs generated by running \"roundtrip\" on the entire PDB, both with\nand without the \"discard\" flag\n\nmolecular_files/: Outputs generated by running \"create_molecular_files\" on two \nlarge PDB structures with hydrogens\n\n", 
  "id": 24863956
}