{
  "read_at": 1462511460, 
  "description": "Set of documents and a wiki to communicate", 
  "README.md": "<!-- <div class=\"row\" style=\"margin-left:35px; margin-right:35px;\">\n\n<div class=\"row\">\n -->\n## RoboBrain API Documentation\n\nThis document is the full specification of the RoboBrain API. It includes both [Client API](wiki/robobrain-client-api) and the[Query API](wiki/robobrain-query-api). [RoboBrain Client API](wiki/robobrain-client-api) is developed for pushing information and knowledge into the RoboBrain and [Query API](wiki/robobrain-query-api) is developed for issuing queries to the RoboBrain.\n\nFor the technical report explaining the technical and algorithmic aspects of the RoboBrain, please refer to: arXiv Link [RoboBrain: Large-Scale Knowledge Engine for Robots](http://arxiv.org/abs/1412.0691)\n\n### Summary\n\n*   **[RoboBrain Client API](#api##client_api)**\n\n\t1.  [Installation](#installation)\n\t2.  [Client API Credentials](#client-api-credentials)\n\t3.  [Information Structure for RoboBrain Interface](#information-structure-for-robobrain-interface)\n\t4.  [Using the RoboBrain Client API (In Your Own Code)](#using-the-robobrain-client-api-in-your-own-code)\n\t5.  [Using the RoboBrain Client API (As a Script)](#using-the-robobrain-client-api-as-a-script)\n\n*   **[RoboBrain Query API](RaQueL.md#welcome-to-RaQueL)**\n\n### RoboBrain Client API\n\nRoboBrain supplies a REST API to its collaborators. Through RoboBrain REST API, collaborators can send their multi-modal information to the brain.\n\nRoboBrain Client API is a client developed purely in Python 2.X in order to provides unified and easy way to push information to the brain.\n\n*   It has multiple processing modes and provide both batch upload and serial upload. Batch upload is implemented in parallel.\n*   It relies on authentication module of the robobrain.me through HTTP Auth.\n\n#### Installation\n\nIn order to use the RoboBrain Client API, you need to install a few Python packages. Our client requires `boto` for s3 access, `request` for sending HTTP requests to the REST API and `filechunkio` for efficient file upload. They can be installed by using pip as\n\n\tsudo pip install boto  \n\tsudo pip install requests  \n\tsudo pip install filechunkio\n\nAfter the required packages are installed, cloning the github repo from [Client API - Github](https://github.com/RoboBrainCode/Client) would suffice. For installation problems and requesting an access to the private repo, please send an e-mail to the [robobrain@cs.stanford.edu](mailto:robobrain@cs.stanford.edu).\n\n#### Client API Credentials\n\nIn order to access to the RoboBrain Client API, you need a RoboBrain account. For the user account, please use the [Login link](http://robobrain.me/#/login). After creating the account, you need to send an e-mail to the [robobrain@cs.stanford.edu](mailto:robobrain@cs.stanford.edu) explaining your contributor account request. After you request is approved, you will receive an e-mail from us. After that, you can start to use the Client API with your credentials.\n\n#### Information Structure for RoboBrain Interface\n\nRoboBrain accepts information in terms of a json structure from its collaborators. Specifically, we use the following structure:\n\n```javascript\n{  \n \"feedtype\": \"Type Of The Feed\",  \n \"text\": \"Text Caption of the Feed with HashTags\",  \n \"source_text\": \"Your Project Name\",  \n \"source_url\": \"Your Project URL\",  \n \"mediashow\": [  \n   \"Is 0th image for visualization or for the brain graph ?\",  \n   \"Is 1st image for visualization or for the brain graph ?\",  \n   \"True or False\",  \n   \"True means, it is for visualization\"  \n ],  \n \"media\": [  \n   \"/your/local/path/to/media0\",  \n   \"/your/local/path/to/media1\",  \n   \"/your/local/path/to/media2\"  \n ],  \n \"mediatype\": [  \n   \"Image\",  \n   \"Video\",  \n   \"Text\"  \n ],  \n \"keywords\": [  \n   \"Some\",  \n   \"Keywords\",  \n   \"About\",  \n   \"Feed\"  \n ],  \n \"mediamap\": [  \n   \"#1\", (this means 0th media is related to 1st hashtag)  \n   \"#0#1\", (this means 1st media is related to 0th and 1st hashtags)  \n   \"#0\" (this means 3rd media is related to 0th hashtag)  \n ],  \n \"graphStructure\": [  \n   \"has_appearance: #1 ->#0\"  \n   \"Edge type and related nodes\"  \n   \"It means there exist has_apparance edge from hashtag1 to hashtag0\"  \n ],}\n ```\n\nHere, we go over the each field in the format:\n\n\t\"feedtype\": \"Type Of The Feed\",\n\nFeedtype is visualized in the bottom left corner of the feed in robobrain.me. It should include a few words and describe the broad category of the feed like Affordance, Grasping, Language etc.\n\n\t\"text\": \"Text Caption of the Feed with HashTags\",\n\nText is the caption of your feed. It should represent the information you are giving in a single English sentence. The keywords in the text which corresponds to abstract or physical entities which are useful to robots should be written as hashtags. Hashtag is written as #keyword. If the hashtag has more than one word, it should be written as #hashtag_with_more_than_one_words. An example is; \"The position of a #Standing_human while using a #shoe is distributed as #$heatmap_12.\"\n\nIf you want to hashtag a media use #$ instead of #. For example, \"#cup has an apperance in #image\" is refering to the media not the concept \"image\"; hence, it should be replaced as \"#cup has an apperance in #$image\"\n\n\t\"source_text\": \"Your Project Name\", \"source_url\": \"Your Project URL\",\n\nSource text is the name of the project which produces the feed and source url is a link to it. It is both used for visualization and verification if necessary.\n\n\t\"mediashow\": [   \"Is 0th image for visualization or for the brain graph ?\",   \"Is 1st image for visualization or for the brain graph ?\",   \"True or False\",   \"True means, it is for visualization\" ],\n\nEach feed includes some media files as well. These files can be images, videos, parameters, point clouds etc. RoboBrain requires large amount of data so we suggest pushing as many media as possible. However, visualizing that many media is not preferred on robobrain.me web page. So, we requests the feed provider to choose a few media to be displayed on the robobrain.me and mark them as \"True\" in the \"mediashow\". The number of members of the \"mediashow\" should be equal to the number of media file you push. Indeed, order represent the matching between files and these attributes.\n\n\t\"mediatype\": [   \"Image\",   \"Video\",   \"Text\" ],\n\nEvery entry of the mediatype array represents the type of the corresponding media. Medias can be image, video or text if they have True as mediashow. If their mediashow is False, they can be any file.\n\n\t\"keywords\": [   \"Some\",   \"Keywords\",   \"About\",   \"Feed\" ],\n\nPlease write a few keywords representing your feed. These keywords will be used for disambiguation, entity linking etc. by our machine learning algorithms.\n\n\t\"mediamap\": [   \"#1\", (this means 0th media is related to 1st hashtag)   \"#0#1\", (this means 1st media is related to 0th and 1st hashtags)   \"#0\" (this means 3rd media is related to 0th hashtag) ],\n\nMediamap links each media with one or more hashtags. Hashtags are counted starting from 0 in their order of occurrence in the text. If they occur more than once, each occurrence is a different hashtag and each occurrence is counted. If you have multiple facts about the same object push them separately.\n\n\t\"graphStructure\": [   \"has_appearance: #1 ->#0\"   \"Edge type and related nodes\"   \"It means there exist has_apparance edge from hashtag1 to hashtag0\" ],\n\nWe also ask contributes to supply the graph structure in terms of predicate, subject and object. For example; has_appearance: #1 ->#0 is correspond to a predicate has_appearance, subject hashtag 1 and object hastag 0. For the list of predicates please use the following command\n\n`python roboBrain.py getEdgeList`\n\nIt will display the currently supported set of edges/predicates. Try to use the available edges/predicates. However, if you need a different edge/predicate type, you can simply include it in your feed. We will automatically add it to the list. However, to make the machine learning algorithm slightly simpler, try to be consistent with the previously used edges.\n\nHere, we also include an example feed:\n\n\t{\n\t\t\"feedtype\": \"Object Affordance\",  \n\t \t\"text\": \"The position of a #Standing_human while using a #shoe is distributed as #$heatmap_12.\",  \n\t \t\"source_text\": \"Hallucinating Humans\",  \n\t \t\"source_url\": \"http://pr.cs.cornell.edu/hallucinatinghumans/\",  \n\t \t\"mediashow\": [  \n\t   \t\t\t\t\t\"True\",  \n\t   \t\t\t\t\t\"True\"  \n\t \t\t\t\t],  \n\t \t\"media\": [  \n\t   \t\"/home/ubuntu/images/shoe_.jpg\",  \n\t   \t\"/home/ubuntu/shoe_12_1.jpg_cr.jpg\"  \n\t \t\t\t\t],  \n\t \t\"mediatype\": [  \n\t   \t\t\t\t\t\"Image\",  \n\t   \t\t\t\t\t\"image\",  \n\t \t\t\t\t\t],  \n\t \t\"keywords\": [  \n\t   \t\t\t\t\t\"Human\",  \n\t \t  \"Affordance\",  \n\t \t  \"Object\",  \n\t   \t\t\"shoe\",  \n\t   \t\t\"Standing\"  \n\t \t\t\t\t\t],  \n\t \t\"mediamap\": [  \n\t   \t\t\t\t\t\"#1\",  \n\t   \t\t\t\t\t\"#0#1#2\"  \n\t \t\t\t\t\t],  \n\t \t\"graphStructure\": [  \n\t   \t\t\t\t\t\t\"spatially_distributed_as: #1 ->#2\",  \n\t   \t\"spatially_distributed_as: #0 ->#2\",  \n\t   \"can_use: #0 ->#1\"  \n\t ],  \n \t}\n<!-- ``` -->\n\nIn all fields, only use alphanumeric characters, dash '-', and an underscore '_' .\n\n\n#### Using the RoboBrain Client API (In Your Own Code)\n\nFor using the RoboBrain Client, we suggest new users to start with `generateFeeds.py` file. It includes the minimal code to use the Client API. Here, we explain the `generateFeeds.py` file line by line:\n\n`from RoboBrainClient.RoboBrainAPI import RoboBrainAPI`\n\nWith this line, we include the Client API\n\n\tRoboAPIUserName = 'YOUR_USER_NAME'  \n \tRoboAPIPass = 'YOUR_PASSWORD'  \n \tS3KEY = 'S3_KEY'  \n \tS3SECRET = 'S3_SECRET'\n\nPlease use the credentials you created for robobrain.me as your `RoboAPIUserName` and `RoboAPIPass`. You will receive the `S3KEY` and `S3SECRET` information in the e-mail confirming your contributor account.  \n\n\trC = RoboBrainAPI(RoboAPIUserName ,RoboAPIPass,S3KEY,S3SECRET,userHandle)\n\nHere, we initialize the RobobrainAPI. Please note that at this point no connection with RoboBrain is made.\n\n\tfor result in YourResults:\n\trC.addFeed(data)\n\nHere, you add feeds to the RoboBrain class by crawling through your own experimental results. Please read the formatting instructions in [Information Structure](wiki/Information%20Structure%20for%20RoboBrain%20Interface) before implementing your code. Please also note that, there is still no request is made to the RoboBrain and all information are stored in the memory. If you are pushing large amount of information, this approach can cause a problem. Hence, if you are pushing a large amount of information, please call the `rC.push2Brain()` function before you reach the memory limit of your system.\n\n\tURL = \"http://robobrain.me:3000/api/feeds/\"  \n\trC.push2Brain(URL)\n\nAt this stage, we push all the aggregated information to the RoboBrain. This function will return an HTTP response. If the data push is successful, you will recieve `HTTP 201:OK` response. If you receive any other response, please make sure\n\n*   You have no formatting error according to the specifications in [Information Structure](wiki/information-structure-for-robobrain-interface)\n*   You have working internet connection and you can reach [http://robobrain.me:3000/api/feeds/](http://robobrain.me:3000/api/feeds/) from your browser.\n*   You can login to robobrain.me successfully with your credentials.\n\nIf your answer is Yes to all aforementioned questions and still not receiving `HTTP 201:OK` response, please send an e-mail to [robobrain@cs.stanford.edu](mailto:robobrain@cs.stanford.edu)\n\n\n#### Using the RoboBrain Client API (As a Script)\n\nYou can also use RoboBrain Client API as a script to upload all feeds in the current folder. You can use either `batchUpload.py` or `batchUploadforBigDataset.py`. Depending on the size of the information you are pushing. If the amount of information you are pushing (excluding media files) is small enough to fit in the memory, use the `batchUpload.py` since it is faster. However, if your data is too big (e.g. at the scale of WordNet, ImageNet, Freebase, RoboBrain etc.), use the `batchUploadforBigDataset.py`. It is slower but more reliable.\n\nBefore using the script, please change the following lines:\n\n\tRoboAPIUserName = 'YOUR_USER_NAME'  \n\tRoboAPIPass = 'YOUR_PASSWORD'  \n \tS3KEY = 'S3_KEY'  \n \tS3SECRET = 'S3_SECRET'\n\nUse the credentials you created for robobrain.me as your `RoboAPIUserName` and `RoboAPIPass`. You will receive the `S3KEY` and `S3SECRET` information in the e-mail confirming your contributor account.\n\nAfter editing the credentials, you can aggregate all feeds in the folder of the API. Each file should have an extension .json and it should correspond to a single feed. After collecting all the feeds in the same folder, you can use\n\n`python batchUpload.py`\n\nor\n\n`python batchUploadforBigDataset.py`\n\nAt this stage, we push all the aggregated information to the RoboBrain. This script will return an HTTP response. If the data push is successful, you will recieve `HTTP 201:OK` response. If you receive any other response, please make sure\n\n*   You have no formatting error according to the specifications in [Information Structure](wiki/Information%20Structure%20for%20RoboBrain%20Interface)\n*   You have working internet connection and you can reach [http://robobrain.me:3000/api/feeds/](http://robobrain.me:3000/api/feeds/) from your browser.\n*   You can login to robobrain.me successfully with your credentials.\n\nIf your answer is Yes to all aforementioned questions and still not receiving `HTTP 201:OK` response, please send an e-mail to [robobrain@cs.stanford.edu](mailto:robobrain@cs.stanford.edu)\n\n\n## RoboBrain Query API\n\nRoboBrain introduces [**RaQueL**](RaQueL.md#welcome-to-RaQueL) (RoboBrain Query library) for querying the RoboBrain Engine. RaQueL is a combination of powerful functional programming concept with [CyPher graph query language](http://neo4j.com/docs/stable/cypher-query-lang.html) allowing us to build applications using RoboBrain.\n\n", 
  "id": 24914280
}