{
  "read_at": 1462511065, 
  "description": "Files related to the nmrlipids.blogspot.fi", 
  "README.md": "# Towards atomistic resolution structure of phosphatidylcholine glycerol backbone and choline headgroup at different ambient conditions\n\n[![DOI](https://img.shields.io/badge/doi-%2010.1021%2Facs.jpcb.5b04878-blue.svg)](https://doi.org/10.1021/acs.jpcb.5b04878)\n\nThis repository contains the research about the simulations of phosphatidylcholine (PC) lipid bilayers with 13 different atomistic models.\nThese have been compared with experiments (in fully hydrated conditions) in terms of C--H bond vector order parameters for the glycerol backbone and choline headgroups.\n\nThis work has been published in The Journal of Physical Chemistry B [https://doi.org/10.1021/acs.jpcb.5b04878](https://doi.org/10.1021/acs.jpcb.5b04878).\n\nThe repository contains all data, input files, figures and code associated with the publication. Furthermore, almost all simulation trajectories are stored in the [Zenodo community](https://zenodo.org/collection/user-nmrlipids) called **Nmrlipids** which has became the most extensive publicly available collection of molecular dynamics simulation trajectories of lipid bilayers.\n\n\n## Open collaboration\n\nThis work has been done as an open collaboration by using [nmrlipids.blogspot.fi](http://nmrlipids.blogspot.fi) as a communication platform.\nThe present approach was started by publishing a manuscript [1] discussing the glycerol backbone and choline structures in a Berger based model (the most used molecular dynamics simulation model for lipid bilayers).\nAfter publishing the initial manuscript, the open invitation for further contributions and discussion through the blog was presented.\nAll the scientific contributions are done publicly through the blog and all contributors were offered coauthorship according to the [guidelines](http://nmrlipids.blogspot.fi/2013/07/on-credits.html) defined in the beginning of the project. The acception of authorship is based on the self-assesment of the authors' scientific contribution to the project.\n\n\n## Organization of the repository\n\nThis repository structure has been designed for this kind of projects during the progress of this work,\nsee [Issue 17](https://github.com/NMRLipids/nmrlipids.blogspot.fi/issues/17), [Issue 15](https://github.com/NMRLipids/nmrlipids.blogspot.fi/issues/15)\nand the [workflow](http://nmrlipids.blogspot.fi/p/how-to-follow-and-make-contributions.html) page from the blog.\nHowever, in practise the organization of the whole repository has not been completed,\nthus some files may not be located in their correct places.\n\n#### DATAreportedINblog\n\nThe folder contains all results data about the order parameter of glycerol backbone and choline headgroups. See the `README` for details.\n\n#### Fig\n\nIt contains all the figures used in the manuscript and, when available, the script used to produce it from the data in `DATAreportedINblog`.\nSee the `README` for details.\n\n#### HGmodelMANUSCRIPT\n\nIt contains all sources files (`tex`, `bib`, `Makefile`) to produce the manuscript. See the `README` for details.\n\n\n## References\n\n[1] Ollila, O. H. S. Response of the hydrophilic part of lipid membranes to changing conditions - a critical comparison of simulations to experiments. 2013; [http://arxiv.org/abs/1309.2131v1](http://arxiv.org/abs/1309.2131v1)\n\n", 
  "id": 25030378
}