{
  "read_at": 1462511260, 
  "description": "Compress sensing for point source of satellites.", 
  "README.txt": "\n                             PURIFY\n  ----------------------------------------------------------------\n\nDESCRIPTION\n  PURIFY is a collection of routines written in C that implements different \n  tools for radio-interferometric imaging including file handling \n  (for both visibilities and fits files), implementation of the measurement \n  operator and set-up of the different optimization problems used for image \n  deconvolution. The code calls the generic Sparse OPTimization (SOPT) \n  package to solve the imaging optimization problems.\n    \n\nAUTHORS\n  R. E. Carrillo (http://people.epfl.ch/rafael.carrillo)\n  J. D. McEwen (http://www.jasonmcewen.org)\n  Y. Wiaux (http://basp.eps.hw.ac.uk)\n\nEXPERIMENTS\n  To run an example with a simulated AMI coverage and a 128X128 M31 test image,\n  run the script example_ami.c.\n\n  To run an example with a simulated variable density coverage and a 256X256 \n  version of M31 as test image, run the script example_m31.c.\n\n  To run an example with a simulated variable density coverage and a 256X256 \n  version of M31 as test image, run the script example_30dor.c.\n\nREFERENCES\n  When referencing this code, please cite our related paper:\n    [1] R. E. Carrillo, J. D. McEwen and Y. Wiaux.  \"Why CLEAN when\n    you can PURIFY?\", submitted to MNRAS, 2013 (arXiv:arXiv:1307.4370).  \n    Preprint available at http://infoscience.epfl.ch/record/187457.\n\nDOCUMENTATION\n   See doc/html/index.html\n\nWEBPAGE\n   http://basp-group.github.io/purify/\n\nINSTALLATION \n  To install the toolbox, the CFITSIO library \n  (heasarc.gsfc.nasa.gov/fitsio/)  and the SOPT toolbox \n  (github.com/basp-group/sopt) must be installed. \n  A makefile is provided to build the code. Before compiling you \n  might need to edit the makefile to specify your compiler and the \n  location where the dependencies are installed. Once these are \n  installed you just need to type\n  \n  %make all\n\n  to install the toolbox. \n\nSUPPORT\n  If you have any questions or comments, feel free to contact Rafael\n  Carrillo at: rafael {DOT} carrillo {AT} epfl {DOT} ch.\n\nNOTES\n  The code is given for educational purpose. The code is\n  in beta and still under development.\n\nLICENSE\n  PURIFY\n  Copyright (C) 2013 Rafael Carrillo, Jason McEwen, Yves Wiaux\n\n  This program is free software; you can redistribute it and/or\n  modify it under the terms of the GNU General Public License as\n  published by the Free Software Foundation; either version 2 of the\n  License, or (at your option) any later version.\n\n  This program is distributed in the hope that it will be useful, but\n  WITHOUT ANY WARRANTY; without even the implied warranty of\n  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n  General Public License for more details (LICENSE.txt).\n\n  You should have received a copy of the GNU General Public License\n  along with this program; if not, write to the Free Software\n  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA\n  02110-1301, USA.\n", 
  "id": 25040798
}