{
  "read_at": 1462511379, 
  "description": "tools for steady state computation of Boolean networks", 
  "README.md": "Requirements:\n1. Install Macaulay2 (http://www.math.uiuc.edu/Macaulay2/)\n2. Download Boost Library 1.55.0 (http://www.boost.org/doc/libs/)\nNOTE: If you want to use a different version of the Boost Library, you will have to edit the file NetReductionBoost/Makefile accordingly (Step 3 in Compiling)\n3. Download BNReduction.zip\n4. Have gcc, g++, perl, bash\n\nCompiling:\n1. Unzip BNReduction.zip\n2. Move the Boost Library folder to the BNReduction folder\n3. Make sure the contents of the file NetReductionBoost/Makefile and your version of the Boost Library match (only necessary if using a different version of Boost Library).\n4. Go to BNReduction\n5. make clean\n6. make install\n7. ./Testing_BNReduction.sh (this is used to check that everything is working)\n\nUsage:  \n./BNReduction.sh inputfile\nThe file with steady states will be generated into inputfile.fp (if it has no lines, that means there are no fixed points)\nNOTE: The input file must be a file where each line has a Boolean function for each variable. E.g., the following is a Boolean network in 4 variables:\nx1 & x2\n0\n!x2 | x4\n1\nThe variables must range from x1 to xn. The folder Examples has some examples of Boolean networks in the necessary format.\n\nHow to cite: \n1. A. Veliz-Cuba, B. Aguilar, F. Hinkelmann and R. Laubenbacher. Steady state analysis of Boolean molecular network models via model reduction and computational algebra. BMC Bioinformatics, 2014.\n\nAdditional references:\n2. A. Veliz-Cuba, B. Aguilar, and R. Laubenbacher. Dimension Reduction of Large Sparse AND-NOT Network Models. Electronic Notes in Theoretical Computer Science. Accepted, 2014. (see also arxiv.org/abs/1311.6868).\n3. A. Veliz-Cuba, K. Buschur, R. Hamershock, A. Kniss, E. Wolff and R. Laubenbacher. AND-NOT logic framework for steady state analysis of Boolean network models. Applied Mathematics and Information Sciences. 7(4): 1263-1274, 2013.\n4. A. Veliz-Cuba. Reduction of Boolean Network Models. Journal of Theoretical Biology, 289:167-172, 2011.\n5. F. Hinkelmann, M. Brandon, B. Guang, R. McNeill, G. Blekherman, A. Veliz-Cuba and R. Laubenbacher. ADAM: Analysis of Discrete Models of Biological Systems Using Computer Algebra. BMC Bioinformatics, 12:295, 2011.\n6. A. Veliz-Cuba, A. Jarrah and R. Laubenbacher. The Polynomial Algebra of Discrete Models in Systems Biology. Bioinformatics, 26:1637-1643, 2010.\nReferences 2-6 cover all the mathematical theory behind reference 1.\n\nLicense: Free for any academic/educational/any other non-profit use; in which case, you can do whatever you want with this code. No restrictions of any kind, explicit or implied. \n\nFor commercial purposes it is still free for up to a month (for evaluation). Afterwards, please contact the authors.\n\nWarranty: No warranty of any kind, explicit or implied. \n\n", 
  "id": 25088305
}