{
  "read_at": 1462511382, 
  "description": "Creates optimal mapping functions for an oriented coarse-grained protein model using data from the Protein Data Bank.", 
  "README.txt": "\nINTRODUCTION\n------------\n\nP-MOST-PDB-Map-Python-MySQL is software that uses Protein Data Bank structure \nfiles to calculate optimal backmapping parameters for the Protein Model with \nOriented SiTes (P-MOST) and compute the root-mean-square displacement for each \natom type.\n\nLICENSE\n-------\n\nP-MOST-PDB-Map-Python-MySQL is free software: you can redistribute it and/or \nmodify it under the terms of the GNU General Public License as published by the \nFree Software Foundation, either version 3 of the License, or (at your option) \nany later version.\n\nP-MOST-PDB-Map-Python-MySQL is distributed in the hope that it will be useful, \nbut WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY \nor FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for \nmore details.\n\nYou should have received a copy of the GNU General Public License along with\nP-MOST-PDB-Map.  If not, see <http://www.gnu.org/licenses/>.\n\nPUBLICATION\n-----------\n\nDetails of the oriented coarse-grained protein model appear in my paper:\n\n[1] T. K. Haxton, \"High-resolution coarse-grained modeling using oriented \ncoarse-grained sites,\" submitted (available online at arxiv.org/abs/1409.8658).\n\nAUTHORS, CITATION, AND CONTACT INFORMATION\n-------------------------------------------\n\nP-MOST-PDB-Map-Python-MySQL was developed by Tom Haxton at the Molecular \nFoundry, Lawrence Berkeley National Laboratory.\n\nI ask that users please cite my publication [1] in any publication presenting \nresults produced with P-MOST-PDB-Map-Python-MySQL.\n\nContact: Tom Haxton (tomhaxton@gmail.com)\n\nPLATFORM\n--------\n\nP-MOST-PDB-Map has been tested on OS X.\n\nREQUIREMENTS\n------------\n\n1. MySQL Community Server\n2. Python\n3. MySQL-python\n4. PDB structure files (available from www.rcsb.org)\n\nSee also the C version, P-MOST-PDB-Map, available at \nhttp://nanotheory.lbl.gov/peptoid_code.\n\nINSTALLATION\n------------\n\nNone required.\n\nCONTENTS/USAGE\n--------------\n\nStart the MySQL server, and run \"sudo mysql\" to open the SQL shell as root.\n\nIn a separate (bash) shell, run \"python roundtrip.py <directory>\", where\n<directory> is the top directory containing Protein Data Bank (PDB) files.\n\nMySQL OUTPUT TABLES\n-------------------\n\npdb_file_error_table: List of PDB entries excluded from the calculation, as well\n   as the reason for exclusion\n\npdb: List of atoms in the original PDB configurations\n\ncg: Table of coarse-grained sites, listing their positions and orthonormal \n   vectors describing their orientations\n\ncov: List of information for each linear correction backmapping function,\n   including the intercept (3-vector) and slope (3 x 3 matrix)\n\nrmsd: List of component-wise and overall root-mean-square displacement (rmsds)\n   between original and backmapped atomic configurations, separated by amino\n   acid residue and atom type\n", 
  "id": 25096328
}