{
  "read_at": 1462511257, 
  "description": "Electronic prolate spheroidal orbitals for diatomic molecules", 
  "README.md": "Electronic prolate spheroidal orbitals for diatomic molecules\n=============================================================\n\nMathematica notebooks computing electronic prolate spheroidal orbitals for diatomic molecules, i.e., solving the two-center single-electron Schrodinger equation, and calculating Coulomb and exchange integrals of these orbitals; see Ref. 1 and 2 for details. To run the notebooks, the FermiFab toolbox (Ref. 3) is required.\n\nFile structure\n--------------\n* `diatomic_base.m`: Mathematica package defining the core computational routines\n* `homonuclear_levels.nb`: single-electron energy levels in dependence of Z*R, homonuclear case, where R is the nuclear distance (bond length) and Z the nuclear charge\n* `heteronuclear_levels.nb`: single-electron energy levels, heteronuclear case\n* `diatomic_coulomb_m*.nb` pre-computation of Coulomb integral tables\n* `oxygen*.nb` ground state energy of the O2 molecule for various symmetries, using the prolate spheroidal orbitals as single-electron basis\n* `carbon_monoxide.nb` ground state energy of the CO molecule\n\n\nLicense\n-------\nCopyright (c) 2011-2012, Christian B. Mendl  \nAll rights reserved.  \nhttp://christian.mendl.net\n\nThis program is free software; you can redistribute it and/or\nmodify it under the terms of the Simplified BSD License\nhttp://www.opensource.org/licenses/bsd-license.php\n\n\nReferences\n----------\n1. Christian B. Mendl  \n   Efficient algorithm for two-center Coulomb and exchange integrals of electronic prolate spheroidal orbitals  \n   J. Comput. Phys. 231, 51575175 (2012), [arXiv:1203.6256](http://arxiv.org/abs/1203.6256)\n2. M. Aubert, N. Bessis and G. Bessis  \n   Prolate-spheroidal orbitals for homonuclear and heteronuclear diatomic molecules. I. Basic procedure  \n   Phys. Rev. A 10, 5160 (1974) [DOI](http://dx.doi.org/10.1103/PhysRevA.10.51)\n3. Christian B. Mendl  \n   The FermiFab toolbox for fermionic many-particle quantum systems  \n   Comput. Phys. Commun. 182, 1327-1337 (2011), [arXiv:1103.0872](http://arxiv.org/abs/1103.0872)  \n   URL http://sourceforge.net/projects/fermifab\n", 
  "id": 25153094
}