{
  "read_at": 1462511360, 
  "description": "This repository hosts the code for a framework that offers streaming exact node and edge betweenness centrality, while edges can be added or removed.", 
  "README.md": "StreamingBetweenness\n==================\n\nIntroduction:\n----------------\nThis repository hosts the code for a framework that offers streaming betweenness centrality while edges can be added or removed.\nNext, I include the standard disclaimer and describe the input options for the multi-machine (batch) version of the software (MapReduce via Hadoop).\nSingle-machine options can also be derived from this code, as well as only Brandes' algorithm version for speedup comparisons. Feel free to contact me for pointers.\n\nDisclaimer:\n---------------\nCopyright (c) 2014 Nicolas Kourtellis\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nAdditional Disclaimer:\n-----------------------------\nThis code was tested on Linux-based Hadoop clusters and works appropriately.\nAs mentioned above, please use at your own risk. We cannot provide any sort of guarantees that it will work on your platform and specific settings.\nAlso, we cannot provide any support for you to make it work in case of compilation problems.\n\nReference:\n---------------\nIf you use this software and its relevant features, please make sure to acknowledge the appropriate studies, by citing:\nNicolas Kourtellis, Gianmarco De Francisci Morales, Francesco Bonchi, \"Scalable Online Betweenness Centrality in Evolving Graphs\", http://arxiv.org/abs/1401.6981\n\nCommand Line Input Parameters:\n------------------------------\n\n- input path to use on hdfs\n- output path to use on hdfs\n- number of Mappers to split the sources: e.g., 1, 10, 100 etc. Rule of thumb: the larger the graph (i.e., number of roots to test), the larger should be this number.\n- number of Reducers to collect the output\n- number of vertices in graph\n- number of edges in graph\n- graph file (edge list, tab delimited) (full path)\n- file with edges to be added (tab delimited) (full path). Note: this version handles only edges between existing vertices in the graph.\n- number of random edges added\n- experiment iteration (in case of multiple experiments)\n- use combiner or not (true/false)\n- output path for file with stats\n- output path for file with final betweenness values\n\nExample of execution call:\n\nhadoop jar MapReduce_OptimizedBrandesAdditions_DO_JUNG.jar -libjars collections-generic-4.01.jar,jung-graph-impl-2.0.1.jar,jung-api-2.0.1.jar -Dmapred.job.map.memory.mb=4096 -Dmapred.job.reduce.memory.mb=4096 -Dmapred.child.java.opts=-Xmx3500m -Dmapreduce.task.timeout=60000000 -Dmapreduce.job.queuename=QUEUENAME input_iterbrandes_additions_nocomb_10k_1 output_iterbrandes_additions_nocomb_10k_1 10 1 10000 55245 10k 10k_randedges 100 1 false times/ betweenness/\n\nSimilar input can be used for the version that handles deletions of edges.\n", 
  "id": 25158454
}