{
  "README": "TeX-AutoTeX\n\nThis module is the basis for arXiv's (http://arXiv.org/) automatic (La-)TeX\nprocessing. It has been abstracted from arXiv internals and an attempt has\nbeen made to make this useful standalone. However this is not a turn-key\nsolution for document processing, instead it is intended to provide a basis\nfor integration with other systems.\n\nThe normal use is to point it at a directory containing an assortment of\nfiles which constitute the source material for a (La-)TeX\ndocument. TeX::AutoTeX::process then attempts to generated DVI, PostScript,\nor PDF from the input based on heuristics which have been developed and\nemployed at arXiv for many years. The resulting file(s) remain in the same\ndirectory. It is up to the calling process to pre- or post-process the\ndirectory contents as required.\n\nFor example the directory contents could originate from a storage module or\nrepository system and is unpacked to flat files in a temporary directory\nbefore TeX::AutoTeX is being invoked on that directory. The generated\nPostScript or PDF is assumed to then be used in a document delivery system.\n\nNo particular naming conventions or other requirements are imposed on the\nsource material, and sub-directories are permitted. The module attempts to\ndetermine processing order and input format based on file characteristics and\nheuristics and generally does not require any user input. This distinguishes\nTeX::AutoTeX from other existing frameworks, which require particular\nconfiguration, or are based on specific Makefiles or similar constructs.\n\nThe system has been tuned to process scientific papers received at arXiv and\nmay not perform optimally in other settings. You are welcome to modify it to\nyour needs and are encouraged to communicate changes and improvements back to\narXiv.\n\n\nWARNING \n\nTeX::AutoTeX::process will modify, overwrite, and delete files in the specified\ndirectory. It is assumed that directory is a temporary working directory and\nthat the sources were copied from elsewhere for processing.\n\n\nINSTALLATION\n\nThis module relies on the presence of a comprehensive TeX installation on the\nhost system to function. arXiv is using TeXLive 2009 and TeXLive 2010, but\nMikTeX or similar should also work.\n\nTo install this module, run the following commands:\n\n\tperl Build.PL\n\t./Build\n\t./Build test\n\t./Build install\n\n\nCONFIGURATION\n\nAfter installing, you must edit TeX::AutoTeX::Config to use your TeX\ninstallation. See the comments in that file.\n\nQUICKSTART\n\nMake sure you have backups of your source files. Only invoke TeX::AutoTeX on\na copy in a temporary directory! Files in that directory may be modified,\noverwritten, deleted or otherwise rendered unusable. You have been warned!\n\nAfter installation, edit TeX::AutoTeX::Config (see CONFIGURATION), switch to\na temporary directory containing a copy of the (La-)TeX sources for a single\npaper and then run:\n\nperl -MCwd -MTeX::AutoTeX -e '$t=TeX::AutoTeX->new(workdir => getcwd, verbose => 1,); $t->process;'\n\nSee perldoc TeX::AutoTeX for more options.\n\nSUPPORT AND DOCUMENTATION\n\nAfter installing, you can find documentation for this module with the\nperldoc command.\n\n    perldoc TeX::AutoTeX\n\nYou can also look for information at:\n\n    RT, CPAN's request tracker\n        http://rt.cpan.org/NoAuth/Bugs.html?Dist=TeX-AutoTeX\n\n    AnnoCPAN, Annotated CPAN documentation\n        http://annocpan.org/dist/TeX-AutoTeX\n\n    CPAN Ratings\n        http://cpanratings.perl.org/d/TeX-AutoTeX\n\n    Search CPAN\n        http://search.cpan.org/dist/TeX-AutoTeX/\n\n\nLICENSE AND COPYRIGHT\n\nCopyright (C) 2011 Thorsten Schwander\n\nThis program is free software; you can redistribute it and/or modify it\nunder the terms of either: the GNU General Public License as published\nby the Free Software Foundation; or the Artistic License.\n\nSee http://dev.perl.org/licenses/ for more information.\n\n", 
  "read_at": 1462510619, 
  "description": "Read-only release history for TeX-AutoTeX", 
  "id": 25578563
}