{
  "read_at": 1462511313, 
  "description": "", 
  "README.md": "Role Mining\n===========\n\nThe goal of the project was to determine and assign particular roles to different nodes in a network. Roles may indicate the importance of nodes in a community or type of their connection to various groups. They were predefined beforehand and mined in two datasets: Enron e-mail network and arxiv.org citation network of the Theoretical High Energy Physics (HepTh) domain.\n\nOur work was based directly on the article [SSRM: Structural Social Role Mining for Dynamic Social Networks](http://webdocs.cs.ualberta.ca/~zaiane/postscript/Role-ASONAM14.pdf).\n\n# Modules\n\n`Plotter` - module written to generate figures found in documentation\n\n`Network` - network representation based on [graph-tool](http://graph-tool.skewed.de/) \n\n`XNetwork` - network representation based on [NetworkX](https://networkx.github.io/)\n\n`RoleMining` - role extraction (as described in paper)\n\n`Reader` - reading and pre-processing input data\n\nOther files:\n\n`extract_communities.sh` - bash script extracting communities using CFinder from multiple graphs saved as edges file. New result directory is created for each input graph. ''\n\n`matplotlibrc` - matplotlib configuration file with styles for graph plotting\n\n# Datasets\n\nInput data used in this project can be found in `datasets` directory. Graphs are saved in `.edges` files, where one line represents one edge in graph, optional 3rd column can be edge weight.\n\n## Enron\n\n[Data source](http://foreverdata.com/1009/Enron_Dataset_Report.pdf)\n\n`datasets\\enron` - input data from Enron divided into timeslots by month. Each person has its unique integer id, mapping id : email can be found in `enron_guys.txt`. In `timeslots` directory there are two types of files:\n\n* `{month}.edges` - All communication from given month. Edge weight is equal to the number of emails send by person.\n* `{month}-filtered{k}.edges` - Communication from given month, but nodes which sent emails in less than `k` days are filtered out. \n\nCommunities genereted by CFinder can be found in `communities` directory.\n\n## Hep-Th\n\n[Data source](http://snap.stanford.edu/data/cit-HepTh.html)\n\nInput data dived in yearly timeslots are in `timeslots` dir. Arxiv IDs are used as nodes' label.\n\nIn `communities`, CFinder outputs is grouped into seperate directories, while `.communities` files hold groups extracted by Gephi (based on modularity).\nOther files:\n\n* `cit-HepTh.txt` - raw file as found on SNAP webpage\n* `cit-HepTh-dates.txt` - submission dates of Hep papers\n* `cit-HepTh.dates` - submission dates of all papers, after cleaning, removing nodes not existing in network and adding extracted dates.\n\n\n\n\n\n\n\n\n", 
  "id": 25864738
}