{
  "README": "Graph-cut Based Background Subtraction\n======================================\n\nMATLAB implementation of Nicholas Howe's graph-cut based background \nsubtraction algorithm.\n\nReferences\n----------\n\n[1] Howe, Nicholas R., and Alexandra Deschamps. \"Better foreground \nsegmentation through graph cuts.\" arXiv preprint cs/0401017 (2004). \n(http://arxiv.org/pdf/cs/0401017)\n\n[2] Howe, Nicholas R. \"Evaluating Recognition-Based Motion Capture on \nHumanEva II Test Data.\" (2008). \n(http://cs.smith.edu/~nhowe/Research/pubs/ehum08.pdf)\n\nCredits\n-------\n\nThe code is based on the original author's [implementation]\n(http://www.cs.smith.edu/~nhowe/research/code/), which was \ndistributed with the following README file:\n\n- - - - - - - -\n\nMATLAB Implementation of Graph-Based Foreground Segmentation\n------------------------------------------------------------\n\nWritten by Nicholas R. Howe\nPackaged July 2004\nPortions of code copyright Andrew Goldberg (see notice below)\n\nThis package comes with no warranty of any kind.\n\n\nDescription\n-----------\n\nThe files in this package comprise the Matlab implementation of a\nforeground segmentation algorithm based upon graph cuts, described in:\n\nBetter Foreground Segmentation Through Graph Cuts, N. Howe &\nA. Deschamps.  Tech report, http://arxiv.org/abs/cs.CV/0401017.\n\nThe file extractForeground.m contains a sample function that will\nperform a complete foreground segmentation for static camera video.\nIt uses a number of parameters, which are described in the\ndocumentation.  An attempt was made to choose sensible default values,\nbut they may need to be adjusted for some videos.\n\nMore generally, the implementation in extractForeground.m is only a\nsuggestion of how the graph-based segmentation might be used.  The\nsame approach can be applied with other (perhaps time-adaptive)\nbackground models.  The key step is at line 113 of the code, once the\ndeviation array has been created.  The graph-cut segmentation can be\napplied similarly to a deviation matrix computed in any other way.\n\n\nCopyright Notice\n----------------\n\nThe files included by gcut.cpp come from the Network Optimization\nLibrary created by Andrew Goldberg\n(http://www.avglab.com/andrew/soft.html).  That code comes with the\ncopyright notice below:\n\nPRF Copyright C 1995 IG Systems, Inc. Permission to use for evaluation\npurposes is granted provided that proper acknowledgments are\ngiven. For a commercial licence, contact igsys@eclipse.net.\n\nThis software comes with no warranty, expressed or implied. By way of\nexample, but not limitation, we make no representations of warranties\nof merchantability or fitness for any particular purpose or that the\nuse of the software components or documentation will not infringe any\npatents, copyrights, trademarks, or other rights.\n\nThe remaining files are copyright Nicholas R. Howe.  Permission is\ngranted to use the material for noncommercial and research purposes.\n", 
  "read_at": 1462510621, 
  "description": "Graph-cut based background subtraction", 
  "id": 25868958
}