{
  "read_at": 1462511315, 
  "description": "", 
  "README.md": "Copyright (C) 2015 Y. Billeh, M. Schaub\r\n\r\nThis program is free software: you can redistribute it and/or modify it under \r\nthe terms of the GNU General Public License as published by the Free Software \r\nFoundation, either version 3 of the License, or (at your option) any later \r\nversion.\r\n\r\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY\r\nWARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A \r\nPARTICULAR PURPOSE. See the GNU General Public License for more details.\r\n\r\nYou should have received a copy of the GNU General Public License along with \r\nthis program. If not, see http://www.gnu.org/licenses/.\r\n\r\n--------------------------------------------------------------------------------\r\nThis code implements the leaky-integrate-and-fire network simulations as \r\ndescribed in the following paper\r\n\r\nSchaub MT, Billeh YN, Anastassiou CA, Koch C, Barahona M (2015) \r\n\"Emergence of Slow-Switching Assemblies in Structured Neuronal Networks.\" \r\nPLoS Comput Biol 11(7): e1004196. doi:10.1371/journal.pcbi.1004196\r\n(arXiv version -- http://arxiv.org/abs/1411.2103)\r\n\r\n\r\n** If you use this code in an academic article, please cite our work. Thanks **\r\n\r\n--------------------------------------------------------------------------------\r\nCODE DESCRIPTION:\r\n\r\nThe code implements all different LIF network types presented in the manuscript.\r\n\r\nThe main files to run the simulations can be found in the folder \r\n\"NetworkImplemenatations\". In particular, using NetworkLIF.m in combination with \r\nany of the weight matrix scripts, will run one simulation of a LIF network.\r\nIf you want to loop over a different parameter, you can use the run_sim_loop.m\r\nfile.\r\n\r\nWhile the user is free to explore the range of parameters, we remark that there \r\nare some intrisic constraints on the probability ratio parameters R_* (e.g. \r\nR_EE) -- too extreme parameter could lead to connection probabilities greater \r\nthan 1 inside a subgroup of neurons -- in which case the code will crash. For \r\nthe parameter settings discussed in the manuscript this is not a problem. \r\n\r\nThere is a second folder named  \"UtilityFunctions\", which contains some \r\nfunctions that are called by the scripts in  \"NetworkImplemenatations\" folder. \r\nThere is also some code for plotting and analysing results generated by the \r\nsimulations. Please ensure these files are added to your path.\r\n", 
  "id": 25877074
}