{
  "read_at": 1462511372, 
  "description": "Software for computing the unrooted subtree prune-and-regraft distance between topologies", 
  "README.md": "uspr version 1.0.0\n====\n\nSoftware for computing the unrooted subtree Prune-and-Regraft (uSPR) distance between unrooted binary topologies in Newick format. Can also compute the Tree Bisection-and-Reconnection (TBR) distance and an intermediate distance called the replug distance. The uSPR distance is a natural distance metric with respect to phylogenetic tree search, as common tree search and sampling software mainly use SPR operations (or NNI operations, a subset of SPR operations). The uSPR distance is also a lower bound on the number of lateral gene transfer events required to explain the difference between a reference/species tree and a gene tree.\n\nPlease note that the uSPR distance is NP-hard to compute (as are the TBR and replug distances) and most of the algorithms used in this software scale exponentially with the distance computed. This version of uspr is aimed at trees with up to 50 leaves and uSPR distances up to 14.\n\nIf you are interested in comparing rooted trees in terms of SPR operations, you should use rspr instead (https://github.com/cwhidden/rspr). rspr is also much more efficient and can easily handle pairs of binary rooted trees with 200+ leaves and distances > 50.\n\nThis is the code for the preprint \"Calculating the Unrooted Subtree-Prune-and-Regraft Distance\" by Chris Whidden and Frederick A. Matsen IV. Please see \"http://arxiv.org/abs/1511.07529\" for more information on the motivation behind this project, the algorithms used and their expected performance.\n\nCopying\n====\n```\nCopyright 2015 Chris Whidden\ncwhidden@fredhutch.org\nhttps://github.com/cwhidden/uspr\nDecember 10, 2015\nVersion 1.0.0\n```\n\nThis file is part of uspr.\n\nuspr is free software: you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\nuspr is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with uspr.  If not, see <http://www.gnu.org/licenses/>.\n\nUsage\n====\n\nUsage: uspr [OPTIONS]\n\nInput: pairs of unrooted binary trees in Newick format on standard input, one tree per line .\n\nOutput:\nBy default, uspr will compute 4 distance metrics:\n- an approximation of the TBR distance that will provide a rough range. Note that the uSPR  distance is at most double the TBR distance, so doubling this range provides a rough estimate of the uSPR distance. This can be used to determine if the trees are too disimilar to be compared using this software.\n- the TBR distance, and an associated maximum agreement forest. The agreement forest shows which parts of the trees remain stable under one minimal set of TBR operations that transform one tree into the other. Tree edges not included in the agreement forest are those modified by these operations.\n- the replug distance, an intermediate distance between the TBR and uSPR distances and an associatied maximum endpoint agreement forest. This agreement forest indicates endpoints of modified edges that remain stable with asterisks (\\*). The replug distance is similar to the uSPR distance, but does not guarantee that intermediate operations result in a tree.\n- the uSPR distance and the number of trees that were explored to compute it using a progressive A\\* search.\n\nExample Output\n====\n```\n./uspr < test_trees/replug_example_3.tre\nT1: (a1,a2,(a3,(a4,(b1,(b2,(b3,(b4,(c1,(c2,(c3,c4))))))))));\nT2: (a1,(a2,(a3,a4)),(((b1,b2),(b3,(c1,(c2,(c3,c4))))),b4));\na_TBR: 2 <= d_TBR <= 6\n{2}\nd_TBR = 2\nF1: ((a1,a2),a3,a4); (b1,b2); (b3,(((c3,c4),c2),c1),b4);\nF2: ((a1,a2),a3,a4); (b4,(((c3,c4),c2),c1),b3); (b1,b2);\n{2} {3}\nd_R = 3\nF1: ((a1,a2),a3,a4); (b1,b2,(b3,b4)); ((*,c1),(c3,c4),c2);\nF2: ((a1,a2),a3,a4); ((b3,b4),b1,b2); ((*,c1),(c3,c4),c2);\nexamined 347 trees\nd_USPR = 3\n\n./uspr < test_trees/replug_example_4.tre\nT1: (a1,a2,(a3,(a4,(b1,(b2,(b3,b4))))));\nT2: (a1,(a2,(a3,a4)),(((b1,b2),b3),b4));\na_TBR: 1 <= d_TBR <= 3\n{1}\nd_TBR = 1\nF1: ((a1,a2),a3,a4); (b1,b2,(b3,b4));\nF2: ((a1,a2),a3,a4); ((b4,b3),b1,b2);\n{1} {2}\nd_R = 2\nF1: ((a1,a2),a3,a4); (b1,b2,(b3,b4));\nF2: ((a1,a2),a3,a4); ((b4,b3),b1,b2);\nexamined 170 trees\nd_USPR = 2\n```\n\nOptions\n====\n```\nBasic options\n\n-h --help              Print program information and exit.\n\n--tbr-approx\n--tbr\n--replug\n--uspr                 By default, uspr will compute all 4 distances. If any of these\n                       options are specified then uspr will compute only the specified\n                       distances.\n                       \n--print-mAFs           Print all maximal agreement forests found during execution of\n                       the program.\n--count-mAFs           Count all maximal agreement forests found during execution of\n                       the program.\n\nAlgorithm Options\n\n--no-approx-estimate\n--no-tbr-estimate\n--no-replug-estimate   Disable the TBR approximation, TBR distance, or replug distance\n                       heuristics when computing the SPR distance. In most cases these\n                       options will greatly increase the time required by uspr.\n                       \n--no-opt\n--no-protect-b         Disable all MAF optimizations or just the edge protection\n                       optimization for enumerating agreement forests. In most\n                       cases these options will greatly increase the time required\n                       by uspr.\n```\n\nuspr_neighbors\n====\n`uspr_neighbors` is a utility program that calculates all trees that can be obtained from an unrooted binary tree using a single subtree prune and regraft operation. This is called the SPR neighborhood of a tree. Input one tree in newick format on STDIN. Note that this program will output or count the input tree unless the `--ignore_original` option is specified.\n```\nOptions\n\n-h --help              Print program information and exit.\n\n--ignore_original      Do not output or count the input tree.\n\n--size_only            Count the number of SPR neighbors instead of printing them.\n```\n\nFiles\n====\n|File|Description|\n|----|-----------|\n|COPYING|            The GPL License version 3|\n|libs/boost/graph|   Boost Graph Libraries, a required dependency|\n|Makefile|           Makefile|\n|README.md|          This README|\n|tbr.h|              Library to calculate TBR and replug distances|\n|test_trees|         A folder of test tree pairs (*.tre) and expected output (*.test)|\n|uforest.h|          Forest data structure|\n|unode.h|            Tree node data structure|\n|uspr|               The main executable after compilation|\n|uspr.cpp|           Main file and interface code|\n|uspr.h|             Library to calculate SPR distances|\n|uspr_neighbors|     A sub executable for computing all SPR neighbors of a tree|\n|uspr_neighbors.cpp| Main uspr_neighbors file and interface code|\n|uspr_neighbors.h|   uspr_neighbors library code|\n|utree.h|            Tree data structure|\n\nDependencies\n====\nuspr requires the Boost Graph Library, part of the Boost C++ Libraries. The Boost Graph library is available from https://github.com/boostorg/graph and is also available in the package manager of most Linux distributions. The library is included as a submodule of uspr on github. If you obtained uspr directly from the github repository and do not have the Boost Libraries installed on your system, then the command `git submodule update --init --recursive` can be used to download the libraries.\n\n\nInstallation\n====\nuspr is a command-line program written in C++. To use it, compile uspr.cpp and execute the resulting program. On systems with the g++ compiler and make program, the included make file will compile uspr; simply run `make`. You can then run `make test` to confirm that the program was built and is running correctly.\n\nCiting uspr\n====\nIf you use uspr in your research, please cite:\n\nChris Whidden and Frederick A. Matsen IV. Calculating the Unrooted Subtree-Prune-and-Regraft Distance. eprint arXiv:1511.07529. http://arxiv.org/abs/1511.07529\n", 
  "id": 25885774
}