{
  "read_at": 1462511077, 
  "description": "Statistics abou the number of Bitcoin nodes connected through Tor exit nodes", 
  "README.md": "torban\n======\n\nCode useful for detecting systematic attacks on Tor exit nodes used to connect to the Bitcoin network.\n\nBy Kristov Atlas 2014\nOpen Bitcoin Privacy Project\n\nSee the live site at:\nhttp://www.openbitcoinprivacyproject.org/torban/www\n\n## Usage\n\n### Fetching new data and updating database\n```\ntouch common/torbandb.txt\nphp db-update/cron-update-db.php\n```\n### Displaying data from database in HTML format\n\n```\ninclude_once('IntersectionStatusHTMLWriter.php');\n$writer = new IntersectionStatusHTMLWriter();\n$writer->write();\n```\n\nor view www/index.php\n\n## More Info\n\nInspired by:\nhttp://arxiv.org/abs/1410.6079 \"Bitcoin over Tor isn't a good idea\"\n\n\"It turns out that by exploiting a Bitcoin built-in reputation based DoS protection an attacker is able to force specific Bitcoin peers to ban Tor Exit nodes of her choice. Combining it with some peculiarities of how Tor handles data streams a stealthy and low-resource attacker with just 1-3% of overall Tor Exit bandwidth capacity and 1000-1500 cheap lightweight Bitcoin peers (for example, a small Botnet) can force all Bitcoin Tor traffic to go either through her Exit nodes or through her peers. This opens numerous attack vectors. First it simplifies a traffic correlation attack since the attacker controls one end of the communication. Second, the attacker can can glue together different Bitcoin addresses (pseudonyms) of the same user. Third, it opens possibilities of double spending attacks for the mobile SPV clients, those which it was supposed to protect from such attacks. The estimated cost of the attack is below 2500 USD per month.\"\n\nData sources:<br/>\n[https://getaddr.bitnodes.io/api/](https://getaddr.bitnodes.io/api/)<br/>\n[http://torstatus.blutmagie.de/](http://torstatus.blutmagie.de/)\n\nA Bitcoin node is considered \"connected\" merely if it is listed by Bitnodes.io. The API permits queries for additional information about the state of a node -- this may be added in a future commit.", 
  "id": 25978987
}