{
  "read_at": 1462511396, 
  "description": "Evaluates the theoretical prediction for correlation function multipoles based on perturbation theory evaluation of the input real space clustering and velocity statistics to the Gaussian streaming model.", 
  "README.md": "cosmoxi2d\n=========\n\nWritten by Beth Reid.\n\nThis is a copy of the SVN product originally released through the SDSS3 \ncollaboration:\nhttp://www.sdss3.org/svn/repo/cosmoxi2d/\n\n===============================================================================\nIntroduction\n===============================================================================\n\nThis code numerically evaluates the model described in detail in Reid and White\n2011 (arxiv:1105.4165) and Reid et al. 2012 (arxiv:1203.6641) for the multipole\nmoments (up to ell = 4) for the observed redshift space correlation function of\nbiased tracers as a function of cosmological (though an input linear matter\npower spectrum, growth rate f, and Alcock-Paczynski geometric factors alphaperp\nand alphapar) as well as nuisance parameters describing the tracers (bias and\nsmall scale additive velocity dispersion, isotropicdisp1d).\n\nMany caveats regarding the accuracy of this code at reproducing N-body halo\nclustering results are described in the papers mentioned above.  Briefly, our\ntheoretical model works best for highly biased tracers where the 2nd order bias\nterm is small.  On scales larger than 100 Mpc, the code relies on 2nd order\nLagrangian Perturbation theory as detailed in Matsubara 2008 (PRD 78, 083519),\nand uses the analytic version of Reid and White 2011 on smaller scales.\n\n===============================================================================\nDownloading and compiling\n===============================================================================\n\nThis code requires the GNU scientific library (GSL) and has been tested on\nv1.14.  In what follows below, GSL_DIR refers to the top-level directory\nwhere GSL is installed.  For example, if the GSL libraries are in\n/usr/local/lib, then GSL_DIR=/usr/local.\n\nIf you have sdss3tools installed, this product may be installed with\nsdss3install.  If you are using this method, make sure GSL is already\ninstalled in your EUPS system.\n\nIf you are installing manually, follow the instructions below.\n\nThe code may be obtained from:\n\nsvn export http://www.sdss3.org/svn/repo/cosmoxi2d/tags/1.0 cosmoxi2d-1.0\n\nAfter you have obtained the code, cd to the directory containing the code.\n\nIf you use bash:\n\n$ export COSMOXI2D_DIR=$(pwd)\n$ export GSL_DIR=/usr/local\n$ make\n\nIf you use tcsh:\n\n> setenv COSMOXI2D_DIR `pwd`\n> setenv GSL_DIR /usr/local\n> make\n\nIf the 'make' is successfull, the cosmoxi2d executable will appear in the\nbin directory.\n\n===============================================================================\nRunning\n===============================================================================\n\nVarious parameters are specified in a parameters file.  Two example files are \nprovided in the examples directory.\n\nTo run the examples, type\n\nbin/cosmoxi2d examples/p6new.params\nbin/cosmoxi2d examples/p6bestfitBOSSDR9.params\n\nThe prediction for xi multipoles are output in the file you specified in the\nparams file.  Compare with the expected output in p6iso21.xi024.true and\np6bestfitBOSSDR9.xi024.true.  Difference in the last few digits are expected.\n\n===============================================================================\nImportant details\n===============================================================================\n\n1.  The internal units of cosmoxi2d are in Mpc, while the units in the input\npower spectrum are assumed to be with k in h/Mpc and P(k) in units of (Mpc/h)^3,\nconsistent with the output of camb.  You must specify the value of h you assumed\nto compute P(k) in the paramter 'pkhval' in the paramter file.  The bins in\nwhich the theory correlation function is computed are specified in units of\nMpc, so you need to do some bookkeeping yourself if you integrate this code into\nan MCMC.  The best way to account for your fiducial choice of h (in order to\nspecify observed correlation function bins in Mpc) is through the\nAlcock-Paczynski parameters alphaperp and alphapar.\n\n===============================================================================\nInput parameters\n===============================================================================\n\n-- 'ptcalcopt'\nCalculation of the relevant perturbation theory integrals is one of the slowest\nportions of the code; if you are working a fixed input linear matter power\nspectrum and fixed 'pkampscale', these integrals only need to be output once.\n  0: read both PT integral sets from input files ('qrintsfname' and\n'sptvelfname')\n  1: compute sptvel integrals, read qr integrals\n  2: compute qr integrals, read spt integrals\n  3: compute both spt and qr integrals (output to 'qrintsfname' and\n'sptvelfname' for later use)\n\n-- 'pklinfname'\nThis is the data file containing the input linear matter power spectrum\n(generated by, e.g., camb) at the redshift of interest.  Column 1 is k in\n(h/Mpc), Column 2 is P(k) in (Mpc/h)^3.  This will be converted to Mpc^-1 and\n(Mpc)^3 units within the code using the parameter 'pkhval'; this must be\nproperly specified to agree with the input linear matter power spectrum if you\nwant the BAO to show up in the right place!\n\n-- 'pkhval'\nValue of h used to compute P(k) in pklinfname.  If your k,P(k) is already in\npure Mpc units, set this to 1.\n\n-- 'pkampscale'\nFor your convenience, use this parameter to rescale the input linear power\nspectrum.  If you want the second order corrections to be correct, all the PT\nintegrals should we recomputed with 'ptcalcopt' set to 3.\n\n-- 'qrintsfname'\nIf ptcalcopt = 0 or 1, this specifies the file containing the PT qr integrals to\nread from.  If ptcalcopt = 2 or 3, the code computes the qr integrals and\noutputs them to this file.\n\n-- 'sptvelfname'\nIf ptcalcopt = 0 or 2, this specifies the file containing the PT sptvel\nintegrals to read from.  If ptcalcopt = 1 or 3, the code computes the sptvel\nintegrals and outputs them to this file.\n\n-- 'bias'\nThe Eulerian bias of your tracer for which you wish to predict the correlation\nfunction.  Eulerian bias = 1 + Lagrangian bias.\n\n-- 'fvel'\nLogarithmic growth rate d ln D/ d ln a.  This specifies the amplitude of the\nredshift space distortions where beta = fvel/bias.  This should be evaluated in\nthe same cosmological model at the same redshift as your input power spectrum.\n\n-- 'isotropicdisp1d'\nAdditive constant contribution (in units of Mpc^2!!) to the pairwise velocity\ndispersion; the same constant is added to the dispersion perpendicular and along\nthe pair separation vector.\n\n-- 'xi024outfname'\nFile name where the predicted correlation function is written.  The first five\nlines give values of all relevant parameters used to compute the correlation\nfunction.  Columns are\nbin center (Mpc), xi0, [xi2, xi4, ...].  The number of columns is determined by\nellmax.\n\n-- 'alphaperp' and 'alphapar'\nThese parameters convert the correlation function in your cosmological model to\nbe tested to the one predicted given the cosmological parameters you used to\nconvert the observed angles and redshifts to comoving distances.  Confusingly,\nthe parameters in the code are inverses of the parameters with the same name\ndefined in Eqn. 14 of Reid et al. 2012.  BE WARNED!  If the cosmological model\nto be tested has angular diameter distance DA(z) and expansion rate H(z) at the\nredshift of interest, and the cosmological model used to compute the observed\ncorrelation function had DAfid(z) and Hfid(z), set\n\nalphaperp = DA(z)/DAfid(z) and alphapar = Hfid(z)/H(z)\n\nwhere z is also the redshift at which you evaluate the input power spectrum.\n\n-- 'deltasfine'\nIntermediate versions of xi are computed with spacing deltasfine (2.0) and then\nsubsequently splined.  Larger values should make the code run faster but\nconvergence of all quantities of interest should be carefully checked.\n\n-- 'databinfile'\nThis file describes the bins in which to compute the theory correlation\nfunction.  The columns are central, minimum, and maximum redshift space pair\nseparations to include in the bin.  The units are in Mpc (!!) AMHERE, IS HFID\nneeded??\n\n-- 'ellmax'\nMaximum multipole to compute; code is faster for lower values of ellmax.\nAllowed values are 0,2,4.\n", 
  "id": 25970219
}