{
  "read_at": 1462510053, 
  "description": "A Wild Bootstrap for Degenerate Kernel Tests", 
  "README.md": "Wild bootstrap Kernel Tests\n====\nTwo kernel test are implemented in this package\n\n* **MMD** Maximum mean discrepancy kernel two-sample test. \n* **HSIC** Hilbert Schmidt Independence Criterion  - independence test.\n\nThe wild bootstrap MMD test verifies the hypothesis that X has the same distribution as Y. The wild bootstrap HSIC test verifies the hypothesis that X and Y are independent. For the details see 'A Wild Bootstrap for Degenerate Kernel Tests' http://arxiv.org/abs/1408.5404. See example.m for the sample code.\n\nSyntax\n---\nBoth tests share the same syntax\n```\nRESULTS = wildMMD(X,Y)\nRESULTS = wildMMD(X,Y,Name,Value)\n```\n```\nRESULTS = wildHSIC(X,Y)\nRESULTS = wildHSIC(X,Y,Name,Value)\n```\n**Arguments**\n\nX and Y are arrays of the observations. Each row contains a single observation, each column contains single dimension of all observations. X and Y must have the same number of observations.\n\nThe named arguments can be any of:\n\n+ **'Test'** : if 1 the first flavor of the test is used, if 2 the second flavor is used - the differences between flavors are described in 'A Wild Bootstrap for Degenerate Kernel Tests'. The default is value is 1.   \n* **'Alpha'** : test level, default value is 0.05.\n* **'Kernel'**: function that takes two arrays X,Y, both of dimension m by d, and returns kernel matrix K of size m by m such that K(i,j) = k(X(i,:),Y(j,:)) where k is a kernel function. See rbf_dot for the default implementation.\n* **'WildBootstrap'**: function that returns wild bootstrap process. See bootstrap_series function in util directory for the default implementation.\n* **'NumBootstrap'** : number of bootstrap re-sampling. Default value is 300.\n  \n**Output**\nThe Output RESULTS contains the following fields:\n* **testStat** : the value of test statistic.\n* **quantile** : test critical value.\n* **reject**  : 1 iff null hypothesis is rejected by the test.\n", 
  "id": 25986935
}