{
  "read_at": 1462511358, 
  "description": "Code and data for the PLoS ONE paper \"Predicting Flow Reversals in a Computational Fluid Dynamics Simulated Thermosyphon using Data Assimilation\"", 
  "README.md": "Predicting Flow Reversals in a Computational Fluid Dynamics Simulated Thermosyphon using Data Assimilation\n================================================================================\n\nA paper by Andrew J. Reagan, Yves Dubief, Peter Sheridan Dodds, and Christopher M. Danforth.\nSee the paper on the [arXiv](http://arxiv.org/abs/1510.03389) and soon at PLoS, where it has recently been accepted.\n\nAbstract\n--------\nA thermal convection loop is a annular chamber filled with water, heated on the bottom half and cooled on the top half.\nWith sufficiently large forcing of heat, the direction of fluid flow in the loop oscillates chaotically, dynamics analogous to the Earth's weather.\nAs is the case for state-of-the-art weather models, we only observe the statistics over a small region of state space, making prediction difficult.\nTo overcome this challenge, data assimilation (DA) methods, and specifically ensemble methods, use the computational model itself to estimate the uncertainty of the model to optimally combine these observations into an initial condition for predicting the future state.\nHere, we build and verify four distinct DA methods, and then, we perform a twin model experiment with the computational fluid dynamics simulation of the loop using the Ensemble Transform Kalman Filter (ETKF) to assimilate observations and predict flow reversals.\nWe show that using adaptively shaped localized covariance outperforms static localized covariance with the ETKF, and allows for the use of less observations in predicting flow reversals.\nWe also show that a Dynamic Mode Decomposition (DMD) of the temperature and velocity fields recovers the low dimensional system underlying reversals, finding specific modes which together are predictive of reversal direction.\n\n\n", 
  "id": 26035273
}