{
  "read_at": 1462553803, 
  "description": "", 
  "README.md": "NICE: Non-linear independent components estimation\n==================================================\n\nThis repository contains code (in [`pylearn2/`](https://github.com/laurent-dinh/nice/blob/master/pylearn2/)) and hyperparameters (in [`exp/`](https://github.com/laurent-dinh/nice/blob/master/exp/)) for the paper:\n\n[\"NICE: Non-linear independent components estimation\"](http://arxiv.org/abs/1410.8516) Laurent Dinh, David Krueger, Yoshua Bengio. ArXiv 2014.\n\nPlease cite this paper if you use the code in this repository as part of\na published research project.\n\nWe are an academic lab, not a software company, and have no personnel\ndevoted to documenting and maintaing this research code.\nTherefore this code is offered with minimal support.\nExact reproduction of the numbers in the paper depends on exact\nreproduction of many factors,\nincluding the version of all software dependencies and the choice of\nunderlying hardware (GPU model, etc). We used NVIDA Ge-Force GTX-580\ngraphics cards; other hardware will use different tree structures for\nsummation and incur different rounding error. If you do not reproduce our\nsetup exactly you should expect to need to re-tune your hyperparameters\nslight for your new setup.\n\nMoreover, we have not integrated any unit tests for this code into Theano\nor Pylearn2 so subsequent changes to those libraries may break the code\nin this repository. If you encounter problems with this code, you should\nmake sure that you are using the development branch of [Pylearn2](https://github.com/lisa-lab/pylearn2/) and\n[Theano](https://github.com/Theano/Theano/),\nand use `git checkout` to go to a commit from approximately October 21, 2014. More precisely [`git checkout 3be2a6`](https://github.com/lisa-lab/pylearn2/commit/3be2a6d5ff81273c12023208166b630300eff338) (for Pylearn2) and [`git checkout 165eb4`](https://github.com/Theano/Theano/commit/165eb4e66ab1f5320b2fe67c630a7e76ae5e6526) (for Theano).\n\nThis code itself requires no installation besides making sure that the\n`nice` directory is in a directory in your PYTHONPATH. If\ninstalled correctly, `python -c \"import nice\"` will work. You\nmust also install Pylearn2 and Pylearn2's dependencies (Theano, numpy,\netc.)\n\nCall [`pylearn2/scripts/train.py`](https://github.com/lisa-lab/pylearn2/blob/master/pylearn2/scripts/train.py)\non the various yaml files in this repository\nto train the model for each dataset reported in the paper. The names of\n*.yaml are fairly self-explanatory.", 
  "id": 26144469
}