{
  "read_at": 1462553929, 
  "description": "Origin Destination Multi-Edge analysis package", 
  "README.md": "Origin-Destination Multi-Edge Package.\n========================================================================\n\n Copyright 2014 Oleguer Sagarra. All rights reserved. Code under License GPLv3.\n______________________________________________________________________________________\n\n\n## Introduction \n\nThe Origin-Destination Multi-Edge network package (ODME) is a set of \ncodes that I have written during the development of my PhD thesis. It \nis a package intended to be used for the analysis of many kinds of \nnetworks, focusing specially on spatial, multi-edge networks.\n\nA multi-edge network is a non binary network composed of \ndistinguishable, integer weights. A paradigmatic example of it are \nOrigin-Destination matrices used to represent flows between nodes or \nlocations. The present package is able to analyze many types of any \ngeneral form of non binary networks (being binary networks a particular case of them), \nbe them spatial or not.\n\nThe package is structured in three separated modules which perform \ndifferent operations. The first one is an analysis tool, while the \nsecond is used to solve the parametters needed for the generation of \nnull models. The third one is used for the generation of such models.\n\nThe package may be used to study spatial networks or non-spatial ones, \nand the analysis tool can be used in any weighted network, as long as \nthe weights are integer numbers.\n\n## References \n\n\n[1] Statistical mechanics of multiedge networks\n\tSagarra O., Perez-Vicente C. and Diaz-Guilera, A.  Phys. Rev. E 88, 062806 (2013)\n    [Physical Review E](http://pre.aps.org/abstract/PRE/v88/i6/e062806)\n\n[2] The configuration multi-edge model: Assessing the effect of fixing node strengths on weighted network magnitudes\n\tSagarra O., Font-Clos F., Perez-Vicente C. and Diaz-Guilera, A.\n\t[Europhysics Letters](http://iopscience.iop.org/0295-5075/107/3/38002/article;jsessionid=D22CAAF312F43653DA0C1279853CBF0C.c3)\n\n[3] Supersampling and network reconstruction of urban mobility.\n\tSagarra, O., Szell, M., Santi, P., and Ratti, C. PLoS One 10, e0134508 (2015)\n\t[arXiv:1504.01939v1](http://arxiv.org/abs/1504.01939)\n    [PLoS One 10, e0134508 (2015)](http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0134508)\n\n[4] Role of adjacency-matrix degeneracy in maximum-entropy-weighted network models.\n    Sagarra, O., Perez-Vicente C. and Diaz-Guilera, A. Phys. Rev. E 92, 052816\n    [arxiv:1509.01383](http://arxiv.org/abs/1509.01383)\n    [Physical Review E 92, 052816 (2015)](http://journals.aps.org/pre/abstract/10.1103/PhysRevE.92.052816)\n\n\n\n\n## Contents of the package\n\nThis package is structured in three separated modules. Each module has \nits own README and documentation and the organization goes as follows:\n- Module 1: Network analysis. Codes are written in pure C and the \nmodule constitutes a tool for the analysis of general purpose weighted networks (be them \nspatial or not), as long as their weights are integer numbers.\n- Module 2: Model Fitting. Codes written in python (numpy and other \npackages needed). This module serves to fit the parametters used for \nthe generation of maximum entropy null models.\n- Module 3: Model generation. Codes written in C. This module \ngenerates expectations from different maximum entropy models, as well \nas two well-known models: Radiation and sequential gravity model.\n\n\n\n\n## Acknowledgements\n\nI would like to thank Pol Colomer and Sergio Oller for their very useful comments and suggestions.\n\n\n\n## License\n\n(C) Copyright 2014 Oleguer Sagarra.\nAll rights reserved. \nCode under License GPLv3.\n\nEach file in this folder is part of the ODME package. This code has no warranty whatsoever nor any kind of support is provided. \nYou are free to do what you like with this code as long as you leave this copyright in place. Please cite us if you use our software.\n\nODME is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\n\nODME is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with the package. If not, see http://www.gnu.org/licenses/.\n\n\n## Additional notes\n\n\nCheck the DOCS/ folder in each module as well as their separate README files for details.\n\n", 
  "id": 26213864
}