{
  "id": 26443162, 
  "read_at": 1462553971, 
  "README.rst": "Nested Sampling for Javascript applications\n============================================\n\nI demonstrate how to build useful, interactive statistics tools\nusing model comparison between low-dimensional models and parameter estimation.\n\nFeatures of the framework\n--------------------------\n* Web tools are **interactive**, the user can choose or enter data\n* Web tools are **easily accessible**, the user does not have to compile or download anything (low setup cost) and can play with data without effort.\n* With RadFriends / Nested Sampling (http://arxiv.org/abs/1407.5459) you do not need to worry about convergence, this is handled safely.\n* You can also do **parameter estimation** -- posterior samples are computed for you.\n* *Beware*: RadFriends becomes inefficient for high-dimensional problems. \n  Depending on your specific problem, that may become limiting already at 5 dimensions. \n  This implementation is aimed for **simple, low-dimensional problems** (line fitting, comparing distributions)\n\nAbout the demo\n--------------------------\n**Try it out**: https://johannesbuchner.github.io/ultranest-js/twodist.html\n\nI show an application where the user can enter two data sets.\nTwo models are compared. In the first model, all data are generated from a normal distribution with unknown parameters (2 parameters).\nIn the second model, the two data sets are each generated from a normal distribution with unknown parameters (4 parameters).\nAfter clicking the start button, the marginal likelihood (evidence, Z) of both models is computed,\nand compared. Please take a look at the source files.\n\n**Please fork and build your own application!**\n\nFiles\n------\n\n* twodist.html: HTML interface, with plotting\n* js/worker.js: WebWorker interface\n* js/problem2.js: Implementation of the likelihood and prior function \n* js/plot.js: Some plotting\n* js/js_nested2.js: Generic Nested Sampling implementation using RadFriends\n\n\nAuthor\n-------\nSome files are based on the BEST tool (http://www.sumsar.net/best_online/),\nand are attributed appropriately.\nOtherwise, the code is written by Johannes Buchner (C) 2014, and licensed under\nAGPLv3 (see LICENSE file). If you require a different license, please contact me.\n\n\n", 
  "description": "Nested Sampling for Javascript applications"
}