{
  "read_at": 1462553870, 
  "description": "Working to elevate the readability and design of astronomy journal articles.", 
  "README.md": "elevate-apj\n===========\n\n##*Working to elevate the readability and design of astronomy journal articles.*\n\n\n#Updates from .astronomy6!\nWe had a great unconference discussion about the future design and contents of journal articles the first day of #dotastro in Chicago. There was standing room only at the session; check out the Twitter hashtag #hackj. There was also an awesome talk about Authorea in the morning of the first day.\n\nSome article-related hacks: Stuart Lynn made a great [demo](http://openjournals.github.io/polymer_paper/) of what an html5 based paper might look like. Lots of hacks started by Jonathan Sick and Adam Becker on [rich citations](https://github.com/jonathansick/starlit) and [article reccomendations](https://github.com/freelanceastro/astrorec).\n\nFor my part I spent hacking time on reformatting some journal articles in to a format that is easier to read on my iPad! This was the **minimum-effort** path to making an article more readable.\n\n[**Here's a screenshot!**](newton2014.jpg)\n\n\nI generated this from Elizabth Newton's latest paper source on [the arXiv](http://arxiv.org/abs/1412.2758) by changing the first two lines in the .tex file to:\n\n    \\documentclass[onecolumn]{elevate-apj}\n    \\usepackage[paperheight=200in,paperwidth=7in,margin=1.5in]{geometry}\n\nThis doccument class `elevate-apj` is just `emulate-apj` with about 5 tiny tweaks. I think it looks **awesome** compared with the normal PDF (or HTML!) layout.\n\nIf you want to see a PDF file of my [most recent](http://arxiv.org/abs/1411.3723) paper with this layout more carefuly applied, [look here](flares.pdf). I think the figure placement is great. Tables are deluxe-bad.\n\n\n\n## Some challenges\n- The `paperheight=` call allows arbitrarily long pages in the resulting PDF. In this way the entie article was contained on one long page. However, I had to set this length manually, and I couldn't find a programatic way to find the length.\n\n- There's a more subtle problem I mused about: How do you \"zoom out\" to get the 10,000ft overview of the article? This is a general problem with digital reading I think.\n\n- Making this work on arXiv article sources was hard! Only a handful of articles worked out of the box. This is because people put *tons* of customization in to their .tex files to make them work with arXiv.\n\n- Some image viewers automatically scale to the document *height*... which makes for a funny UX at first.\n\n![](http://img.shields.io/badge/Built%20at-%23dotastro-blue.svg)\n\n<hr>\n\n# The problem...\n\n<img align=\"right\" src=\"old.png\">\nThe design for most journal articles in astronomy is a two-column, highly condensed layout. This format makes efficient use of paper, which in turn reduces printing costs. The narrow columns are also easy to read/parse, like that of a newspaper. \n\nNearly all journals are changing to an online-only form of publication. This raises two important issues:\n\n1. The web versions of these articles are difficult to read, and so most people avoid them and use the PDF versions instead.\n2. The PDF versions of the articles look great on paper, but are difficult to read on a computer screen due to their layout.\n\nIn effect journal articles are *not* becoming online-only, they're just outsourcing the printing job to their readers. **Paper is still the best medium to read astronomy journal articles today due to the article layout.**\n\n### We can improve this!\n\nBy updating the layout of journal articles we hope to:\n\n- increase use of web/PDF article versions on computers and tablet devices\n- improve comprehension and scientific usefulness of articles themselves\n- reduce use of paper, trees, ink, printer/photocopier maintenance...\n\n\nTo accomplish this we must:\n\n- consider the screen size and shape of the devices people use.\n- consider the human exerience with the article, top-to-bottom flow, avoiding unnecessary scrolling, etc.\n- learn from the single-column layout/design of sites like medium.com, and just about every news website.\n- make the PDF and web versions of articles as similar as possible.\n- make figures/images, as well as tables, seamlessly integrated within the article.\n\n### .astronomy6 Goals/Needs\n- discuss and create a new design for journal articles\n- hack together a really sloppy implementation of this design in LaTeX\n- take the sources files for an article formatted with [emulateapj](http://hea-www.harvard.edu/~alexey/emulateapj/) (probably from the arXiv) and apply this new design\n- Try to generate the article for the web as well using the new [**WebTeX engine!**](https://github.com/pkgw/webtex)\n\nI can sketch the design, but would love more people to discuss them with. Perhaps each person took a screenshot of an article or website they thought was a format inspiration? Design on a white board if possible\n\nI can do some hacking in LaTeX, but other expertise/thoughts would be incredibly valuable. Should we start from the article class, or emulateapj package? This LaTeX design doesn't have to be robust, but the primary goal is to create a demo PDF that is more pleasing to read on a computer/tablet.\n\nTo do the web version I need people who have skills. Should we try to use Markdown and MathJax? Generate a Jekyll/CSS/somethingelse template? Brute force?\n\n\n### Resources/Links/Thoughts\n\n- [http://aas.org/media/press-releases/american-astronomical-society-journals-going-electronic-only]()\n- [http://www.paulolyslager.com/optimal-text-layout-line-length/]()\n- [http://www.dyslexiefont.com]()\n- [https://www.authorea.com]()\n- [http://www.paulolyslager.com/optimal-text-layout-line-length/]()\n- [http://www.dyslexiefont.com]()\n- [https://www.authorea.com]()\n- [http://www.nngroup.com/articles/avoid-pdf-for-on-screen-reading/]()\n- [https://medium.com/the-physics-arxiv-blo]()\n", 
  "id": 26459646
}