{
  "read_at": 1462553926, 
  "description": "C++ implementation of the Minimum Variance Bulk Flow Estimator", 
  "README.md": "#Minimum Variance Bulk Flow Estimator\n##A C++ implementation by Morag Scrimgeour\n\nA C++ implementation of the Minimum Variance bulk flow estimator, described in the papers:\n* Watkins, Feldman & Hudson (2009), MNRAS 392 743 ([Arxiv link](http://arxiv.org/abs/0809.4041)) \n* Feldman, Watkins & Hudson (2010), MNRAS 407 2328 ([Arxiv link](http://arxiv.org/abs/0911.5516))\n\n##The Method\nThe Minimum Variance estimator is a method for calculating the large-scale bulk flow of a galaxy sample, given an input catalogue of galaxy positions and measured peculiar velocities, with estimated Gaussian uncertainties. The details of the method can be found in the above papers. \n\n##The C++ code\nThe main C++ function is MV_bulkflow.cpp. Running make will compile the header files and create the executable MV_bulkflow. Mock galaxy data and ideal survey files, along with a sample matter power spectrum generated using [CAMB](http://camb.info/), are provided in the Data folder.\n\n####MLE.cpp\nThis file contains functions to implement the Maximum Likelihood Estimate of the bulk flow, from Eq. (2.2) of Kaiser (1988), MNRAS 231, 149 ([ADS link](http://adsabs.harvard.edu/abs/1988MNRAS.231..149K)).\n\n####MV.cpp\nThis file contains all the necessary functions for implementing the Minimum Variance bulk flow method, in Eqs. (8) to (26) in Feldman, Watkins & Hudson (2010).\n\n####usefulfuncs.cpp\nThis file contains a variety of useful small functions, for both this pipeline and for other uses. Functions include getRA(x,y) and getDec(x,y,z) - functions for calculating Right Ascension and Declination from Cartesian coordinates - and LinearInterpolate, a simple interpolation function.\n\n####cosmology.cpp\nThis file contains some useful cosmology functions, including dxx_mpch(z,OM,OL), which calculates comoving distance in Mpc/h as a function of redshift, Omega_m and Omega_L.", 
  "id": 26575282
}