{
  "read_at": 1462553931, 
  "description": "Lightweight Fortran 90 Parareal for 3D Burgers' equation", 
  "README.md": "\nParareal F90 {#mainpage}\n============\n\nThis is a lightweight standalone implementation of [Parareal](https://en.wikipedia.org/wiki/Parareal) solving 3D Burger's equation using a forward Euler and a RK3SSP method as coarse and fine integrators. It contains three different implementations of Parareal, one based on MPI, one using OpenMP without pipelining and one using OpenMP with pipelining. All three versions compute the same result, the purpose of the code is to compare different implement strategies with respect to speedup, memory footprint and energy consumption.\n\nAttribution\n-----------\nYou can freely use and reuse this code in line with the BSD license. \nIf you use it (or parts of it) for a publication, please cite\n\n@unpublished{Ruprecht2015,   \n  author = {Ruprecht, Daniel},    \n  howpublished = {arXiv:1509.06935 [cs.MS]},    \n  title = {{Implementing Parareal - OpenMP or MPI?}},    \n  url = {http://arxiv.org/abs/1509.06935},    \n  year = {2015}    \n}\n\n(this will be updated once published).\n\nReleases\n--------\n[![][image]][link]\n\nA description of the code and performance results can be found [here](http://arxiv.org/abs/1509.06935).\n\nDocumentation\n-------------\n\nIf you have Doxygen installed, you can run *doxygen Doxyfile* in the base directory to generate HTML documentation of the code.\n\nHow do I get set up?\n--------------------\n\n\nTo build, you will need the following files in the base directory:\n  - preprocessor.f90\n  - makefile.defs\n\nIn preprocessor.f90, a flag is defined that switch between linear advection and nonlinear advection (only the latter case is really Burger's equation, the other is a linear advection-diffusion problem). \n\nIn makefile.defs, the compiler is specified and compiler flags are set. The code needs no libraries, only a MPI compiler with -enable-threads and the correct flag to allow for OpenMP directives (e.g. -fopenmp for GCC). Just specify the compiler and the flags in makefile.defs and type make in the base directory.\n\nTo run, need file\n  - system.defs\n\nThe entries in system.defs are used to automatically build scripts to run the code on different platforms (see e.g. build_runscript.py in /scripts). There are several examples provided. If you want to include your own system, you will need to modify the following python scripts\n  - get_run_cmd.py\n  - build_runscript.py\n  - run_parareal.py \n  - ...\n\nPython runscripts\n-----------------\nThere is a collection of python scripts that automatically run the code with different configurations to generate different sets of data. The script run_parareal_scaling.py for example runs Parareal with different numbers of processors plus the fine integrator as reference and generates all data necessary to plot speedup.\n\nTest harness\n------------\nThere is a set of tests, some written in Fortran and some in Python. Just type *python run_tests* in the base directory to start testing. If you add the flag *nof90* then only the high level python test scripts will be run.\n\n\nWho do I talk to?\n-----------------\n\nThis code is written by [Daniel Ruprecht](http://www.parallelintime.org/groups/leeds.html).\n\n[image]:  https://zenodo.org/badge/doi/10.5281/zenodo.31288.svg\n[link]:  http://dx.doi.org/10.5281/zenodo.31288", 
  "id": 26905813
}