{
  "read_at": 1462553937, 
  "description": "Combining posterior samples from multiple subsets", 
  "README.md": "Weierstrass Sampler for parallel MCMC\n===========\n\nAn R implementation of Weierstrass rejection sampler for combining posterior samples from multiple subsets.\n\n#Description\nThe Weierstrass sampler is a \"divide-conquer-combine\" type parallel MCMC sampler. The implementation in this package is the Weierstrass rejection sampler that directly works on the subset posterior samples. It is a post-processing sampler. The sampler makes use of rejection sampling or importance sampling to combine the subset posterior samples for approximating the posterior obtained on full data set.\n\nTo combine subset posterior samples, the algorithm adopts the 'pairwise-combining' strategy, i.e, it first combines the subset pairwisely to obtain half numbers of new subsets and then repeats the procedure until obtaining the final one. More detailed information is provided in the R-help documentation accompanied with functions.\n\nBesides the main function, two testing models are also included in the pacakge. Uers can build logistic model and binomial model with user-specified features (such as number of predictors, predictor correlations, etc) for testing the performance of the weierstrass rejection sampler. The testing functions integrate full functionalities of data generating, inference and combining. The logistic model requires the package `BayesLogit` (available on R-CRAN) for posterior sampling. More detailed information can be found in the R-help documentation.\n\n#Installation\nThere are several ways to install the package for R. Building the package requires `devtools` (avaiable on R CRAN). Just type the following lines in your R console (Suppose your current working directory is where you want to keep the package),\n```\nlibrary(devtools)\ninstall_github('weierstrass','wwrechard')\n```\nNow the package is fully functional.\n\nAlternatively, one can download the whole repository manually (in one folder and assume the folder is named \"weierstrass\") into the target directory, or obtain via `git`,\n```\ncd your_target_directory\ngit clone https://github.com/wwrechard/weierstrass.git\n```\nand then in the R console (Suppose your current working directory is where you want to keep the package) type,\n```\nlibrary(devtools)\ninstall('weierstrass')\n```\nHowever, this way might require restarting R in order to correctly view the R-help documentation for the functions.\n\nFinally, if you are not interested in the R-help documentation, you can simply download \"weierstrass.r\" under \"./R\" on this repository. This is the main function for weierstrass rejection sampling. \"logitTest.r\" and \"BinTest.r\" under the same directory are the two testing functions. All of the three can be directly `source` and used in R.\n\n#Usage\nTo call up the package, type in the R console,\n```\nsetwd(directory_that_weierstrass_is_installed)\nlibrary(weierstrass)\n```\nThe detailed information of functions is documented in their R-help docs. Type\n```\n?weierstrass\n```\nwill call the help document for the function `weierstrass`. One simple linear regression example is also included in the help docs, to view that simply type,\n```\nexample('weierstrass')\n```\n`logitTest` and `BinTest` are the two testing functions for Weierstrass rejection sampling. The details can be found in their help documents by typing\n```\n?logitTest\n?BinTest\n```\n\n#Reference\nXiangyu Wang, David B. Dunson. Parallelizing MCMC via Weierstrass Sampler. [http://arxiv.org/abs/1312.4605]\n", 
  "id": 26981887
}