{
  "read_at": 1462553830, 
  "description": "", 
  "readme.txt": "\n             High-Speed Tracking with Kernelized Correlation Filters\n\n             J. F. Henriques   R. Caseiro   P. Martins   J. Batista\n                                   TPAMI 2014\n\n________________\nTo be published.\narXiv pre-print: http://arxiv.org/abs/1404.7584\nProject webpage: http://www.isr.uc.pt/~henriques/circulant/\n\nThis MATLAB code implements a simple tracking pipeline based on the Kernelized\nCorrelation Filter (KCF), and Dual Correlation Filter (DCF).\n\nIt is free for research use. If you find it useful, please acknowledge the paper\nabove with a reference.\n\n\n__________\nQuickstart\n\n1. Extract code somewhere.\n\n2. The tracker is prepared to run on any of the 50 videos of the Visual Tracking\n   Benchmark [3]. For that, it must know where they are/will be located. You can\n   change the default location 'base_path' in 'download_videos.m' and 'run_tracker.m'.\n\n3. If you don't have the videos already, run 'download_videos.m' (may take some time).\n\n4. Execute 'run_tracker' without parameters to choose a video and test the KCF on it.\n\n\nNote: The tracker uses the 'fhog'/'gradientMex' functions from Piotr's Toolbox.\nSome pre-compiled MEX files are provided for convenience. If they do not work for your\nsystem, just get the toolbox from http://vision.ucsd.edu/~pdollar/toolbox/doc/index.html\n\n\n__________\n\nThe main interface function is 'run_tracker'. You can test several configurations (KCF,\nDCF, MOSSE) by calling it with different commands:\n\n\n run_tracker\n   Without any parameters, will ask you to choose a video, track using\n   the Gaussian KCF on HOG, and show the results in an interactive\n   figure. Press 'Esc' to stop the tracker early. You can navigate the\n   video using the scrollbar at the bottom.\n\n run_tracker VIDEO\n   Allows you to select a VIDEO by its name. 'all' will run all videos\n   and show average statistics. 'choose' will select one interactively.\n\n run_tracker VIDEO KERNEL\n   Choose a KERNEL. 'gaussian'/'polynomial' to run KCF, 'linear' for DCF.\n\n run_tracker VIDEO KERNEL FEATURE\n   Choose a FEATURE type, either 'hog' or 'gray' (raw pixels).\n\n run_tracker(VIDEO, KERNEL, FEATURE, SHOW_VISUALIZATION, SHOW_PLOTS)\n   Decide whether to show the scrollable figure, and the precision plot.\n\n Useful combinations:\n >> run_tracker choose gaussian hog  %Kernelized Correlation Filter (KCF)\n >> run_tracker choose linear hog    %Dual Correlation Filter (DCF)\n >> run_tracker choose gaussian gray %Single-channel KCF (ECCV'12 paper)\n >> run_tracker choose linear gray   %MOSSE filter (single channel)\n\n\nFor the actual tracking code, check out the 'tracker' function.\n\n\nThough it's not required, the code will make use of the MATLAB Parallel Computing\nToolbox automatically if available.\n\n\n__________\nReferences\n\n[1] J. F. Henriques, R. Caseiro, P. Martins, J. Batista, \"High-Speed Tracking with\nKernelized Correlation Filters\", TPAMI 2014 (to be published).\n\n[2] J. F. Henriques, R. Caseiro, P. Martins, J. Batista, \"Exploiting the Circulant\nStructure of Tracking-by-detection with Kernels\", ECCV 2012.\n\n[3] Y. Wu, J. Lim, M.-H. Yang, \"Online Object Tracking: A Benchmark\", CVPR 2013.\nWebsite: http://visual-tracking.net/\n\n[4] P. Dollar, \"Piotr's Image and Video Matlab Toolbox (PMT)\".\nWebsite: http://vision.ucsd.edu/~pdollar/toolbox/doc/index.html\n\n[5] P. Dollar, S. Belongie, P. Perona, \"The Fastest Pedestrian Detector in the\nWest\", BMVC 2010.\n\n\n_____________________________________\nCopyright (c) 2014, Joao F. Henriques\n\nPermission to use, copy, modify, and distribute this software for research\npurposes with or without fee is hereby granted, provided that the above\ncopyright notice and this permission notice appear in all copies.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\" AND THE AUTHOR DISCLAIMS ALL WARRANTIES\nWITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR\nANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\nWHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\nACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF\nOR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\n", 
  "id": 27149332
}