{
  "read_at": 1462557151, 
  "description": "IPMACC is a framework for translating/executing OpenACC for C API to/over CUDA or OpenCL runtime.", 
  "README.md": "IPMACC translates and executes OpenACC for C applications over CUDA, OpenCL, and Intel ISPC. First, the framework translates OpenACC for C API to CUDA/OpenCL/ISPC source. Then, it compiles the CUDA/OpenCL/ISPC code with the system compiler allowing the execution of application over CUDA or OpenCL -capable devices or SIMD of the CPU (using ISPC).\n\nIPMACC supports data, kernels, loop, enter, exit, and atomic directives. It also allows user-defiend data types and function calls within accelerator regions. We believe IPMACC is more of translator than a compiler, outputing the CUDA/OpenCL/ISPC code which is equivalent to the input OpenACC code. It allows further optimization by expert developer. We believe there can be performed many optimizations in translations, and this is what we are looking forward to. Also IPMACC can be used as a framework for extending OpenACC framework and evaluating new directive/clauses. Please refer to Limitation section of this document to overview supported directives and API calls.\n\n# Getting Started:\n* Refer to docs/ipmacc-openacc.pptx to learn basics of OpenACC.\n* Refer to TODO document to see latest changes and the roadmap.\n* Refer to INSTALL file for installation.\n* Refer to docs/ipmacc-performance.pdf to see the performance comparison of OpenACC applications compiled by our implementation versus native CUDA implementation.\n* After the installation, the best way to start is to compile and run the samples in the test-case/ directory. Example:\n```\n    $ ipmacc test-case/vectorAdd.c -o vectorAdd\n    $ ./vectorAdd\n```\n* There are microbenchmarks to evaluate the overhead of memory allocation, memory copies, and kernel launches under test-case/microbenchmarks/ directory. Also there are wide set of benchmarks under test-case/rodinia/openacc/\n\n\n# Usage:\n* IPMACC is a command-line tool reading single source and generating the destination source code (and also the object or binary). It has few limited compile switch. See the available switches with the following commands:\n\n`$ ipmacc --help`\n\n* In a case that there is a switch which IPMACC does not understands, IPMACC passes the switch to the system compiler. Hence, technically, IPMACC accepts all switches of the system compiler. The system compiler is `nvcc` in case of CUDA, `gcc` in case of OpenCL, and `gcc`/`ispc` in case of ISPC target. Examples:\n    * In case of CUDA backend, which is the default, the following command generates a binary for Kepler GPUs:\n      `$ ipmacc acc_source.cpp -arch=sm_35 -o binary`\n\n# Runtime environment variables:\n* Set **IPMACC_VERBOSE** to run the code in verbose mode debugging your code with the generate code (copies, kernel launches, and\n    synchronizations):\n\n    `$ export IPMACC_VERBOSE=1`\n\n* Set **IPMACCLIB_VERBOSE** to run the code in verbose mode debugging IPMACC OpenACC underlying library:\n\n    `$ export IPMACCLIB_VERBOSE=1`\n\n# IPMACC Extensions to OpenACC\nRefer to EXTENSIONS file to read about the IPMACC additions.\n\n# Limitations:\nCurrent version of IPMACC has several limitations in fully implementing OpenACC standard:\n* Currently, parallel directive is not supported. Notice that with a little effort by the programmer, any parallel region construct can be translated into a kernels region. Synchronization clause/APIs are not supprted as well. IPMACC generates a code to synchronize host and device after every kernels region.\n* Only 1D array can be transfered in-out the region.\n* Clause support: `seq` clause for the top-level 1-nested loop is not supported. This is weird case where there is only one loop in the region which is targeted for serial execution.\n* There are some issues between NVCC and C's `restrict` keyword in CUDA 4.0.\n* Limitations on the Reduction/Private clause of loop\n    * For nested loops, reduction is only allowed over the most outer loop.\n    * IPMACC assumes the reduction/private variable is not declared inside the loop.\n    * If the variable is defined as both private() and reduction(), IPMACC assumes reduction which covers private too.\n    * Reduction/Private on array/subarray is not supported\n    * Default reduction type is two-level tree reduction [1]. Alternatively for CUDA, atomic reduction is implemented and it is supported only on recent hardwares (compute capability >= 1.3). Proper flag should be passed to underlying NVCC; add `-arch=sm_13` compile flag.\n* To gurantee proper device allocation and release, it is necessary to use acc_init() early in the code to avoid potentially runtime errors. This is essential for the OpenCL target devices.\n* IPMACC can parallel the iterations of loops with the following increment steps: +, -, ++, --, *, /\n* ISPC backend support is experimental right now. Most inner loop is executed in parallel over SIMD and the most outter parallel loop will be executed over ISPC tasks. char, short, and long data types are not fully supported. For reduction, only min, max, and sum operations are supported.\n* Using templates for ISPC backend might lead to compilation crash.\n* OpenCL >= 2.0 is necessary for some features (e.g. function calls)\n\n# Contributors:\n* Ahmad Lashgar from Institute for Research in Fundamental Sciences (now at University of Victoria)\n* Alireza Majidi from Institute for Research in Fundamental Sciences (now at Texas A&M University)\n* Ebad Salehi from University of Victoria\n\n# About IPMACC:\nIPMACC is originally developed at Institute for Research in Fundamental Sciences (IPM), Tehran, Iran. We had an old outdated website on IPM page here http://hpc.ipm.ac.ir/ipmacc/. Follow our latest updates on https://github.com/lashgar/ipmacc\n\n# Questions:\nIf you had any question or thinking of any issue, create a new issue thread here https://github.com/lashgar/ipmacc/issues or send an email to lashgar@uvic.ca\n\n# Publications:\n**[1]** Ahmad Lashgar, Alireza Majidi, and Amirali Baniasadi, **\"IPMACC: Open Source OpenACC to CUDA/OpenCL Translator\"**, arXiv:1412.1127 [cs.PL], December 2, 2014.\n\n**[2]** Ahmad Lashgar, Alireza Majidi, and Amirali Baniasadi, **\"IPMACC: Translating OpenACC API to OpenCL\"**, To be appeared in The 3rd International Workshop on OpenCL (IWOCL), Stanford University, California, USA, May 11-13, 2015.\n\n**[3]** Ahmad Lashgar and Amirali Baniasadi, **\"Employing Software-Managed Caches in OpenACC: Opportunities and Benefits\"**, To appear in ACM Transactions on Modeling and Performance Evaluation of Computing Systems (ToMPECS), Accepted on June 28, 2015.\n\n# References:\n**[1]** Mark Hariss. Available: http://developer.download.nvidia.com/compute/cuda/1.1-Beta/x86_website/projects/reduction/doc/reduction.pdf\n\n**[2]** Matt Pharr and William R. Mark. **\"ispc: A SPMD Compiler for High-Performance CPU Programming\"**, In Proceedings Innovative Parallel Computing (InPar), San Jose, CA, May 2012.\n\n", 
  "id": 27397624
}