{
  "read_at": 1462557188, 
  "description": "A genetic algorithm that finds optimal polynomial form to fit to data. ", 
  "README.md": "GAz\n===\n\nA genetic algorithm that finds optimal polynomial form to fit to data.\n\nThis code was created and optimised for calculating photometric redshifts for low redshift galaxies.\n\nA full description of the algorithm (an its application to photometric redshift estimation) can be found in the preprint http://arxiv.org/abs/1412.5997. Please acknowledge this work when using GAz.\n\n\n-----------------------------------------------------------------------------------------\n\nUSAGE:\n\n-Specify path to training, validation, and test sets in run_GA.py (defaults to use sample data provided)\n\n-Specify GA properties desired (currently optimised for task described in http://arxiv.org/abs/1412.5997) by modifying the polyGA object in run_GA.py (described in polynomial_GA.py)\n\n-Run the run_GA.py script.\n\nNOTE: it is a good idea to run the GA several times to mitigate against the dependence on the intial population. The final result should be taken as the run with the losest cross validation error.\n\nOUTPUT:\n\n    - poly_out : the best polynomial found with optimal coefficients (1 row per term in format: coeff,exponent,exponent,...,exponent)\n    \n    - predictions_out : prediction with error for specified data set (format : true_value,prediction,prediciton error bar)\n\n\nUsing optimal polynomial on new dataset:\n\n-Run make_predictions.py script with new data as input:\n\n    options:\n \n        -f : path to input data (required)\n \n        -e : use input errors to calculate error on prediction (optional, default won't use errors)\n            inputs: Y/y (use errors) N/n (don't use errors)\n      \n        -o : path to save output prediction (optional, defaults to \"path/to/input/_predictions\")\n \n        -p : path to polynomial file ouput by code (optional, defaults to 'poly_out')\n \n-----------------------------------------------------------------------------------------\n\nDEPENDENCIES:\n\n- Scipy\n- Numpy\n- Matplotlib (if using plotting scripts)", 
  "id": 27493805
}