{
  "read_at": 1462557083, 
  "description": "", 
  "README.md": "A Parallel and Efficient Algorithm for Learning to Match (PL2M)\n====\n\nBuild\n----\n\nSimply type \"make\" in the terminal line or follow the commands in the Makefile.\n\nUsage\n----\n\npl2m_train is used to train models based on train/test files and user/item feature matrix files, which needs 6 parameters:\n\n     [usage] <configure-file> <user-feature-matrix> <item-feature-matrix> <train> <test> <model-output-prefix>\n\npl2m_infer is used to make predictions based on trained models, which needs 3 parameters:\n\n     [usage] <test> <particular-model> <prediction-output-file>\n\nFor more details, please check the example.\n\nConfigure File\n----\n\nPlease check the \"examples/pcf.conf\" for details.\n\nFormat of the Matrix File\n----\nSpare Matrix for user features and item features.\n\nFor each line, first come with the id of user/item. Then followed by the number of non-zero features. Features are described by their indices and values, separated by a colon. Here is an example for user 123, who have 5 non-zero features in total.\n\n    123 5 123:1 1:0.5 10:0.5 11:0.5 20:0.5\n    \nFor more details, please check the example.\n\nFormat of Train/Test file\n----\nClassical 3/4 columns, where weight of this instance is optional (1 default). However, in one train/test files, the columns in each line should be same.\n\n    user item rate [weight]\n    \nFor more details, please check the example.\n\nExample\n----\n\n1. run the buildFeatMat.py in the folder \"data\".\n\n        python buildFeatMat.py\n\n   which will generate 4 four files in the folder \"data\", which are the train/test files and user/item feature matrix files.\n\n2. get into the folder \"example\", create a folder \"models\".\n\n        mkdir models\n    \n3. run the predefined script.\n\n        ./run.sh\n\nwhich includes both training and testing procedures.\n\nReference\n----\n\nIf you are using this toolkit for some research, please cite the following papers.\n\n[1]  Shang, J., Chen, T., Li, H., Lu, Z., & Yu, Y. (2014). A Parallel and Efficient Algorithm for Learning to Match. In Data Mining (ICDM), 2014 IEEE 14th International Conference. IEEE.\n\nThere is also a long version of this paper available on arXiv.\n\n    http://arxiv.org/abs/1410.6414\n    \n\n\n\n", 
  "id": 27507579
}