{
  "read_at": 1462543294, 
  "description": "Selection function for the SDSS/SEGUE survey (G and K star samples)", 
  "README.md": "#segueSelect\n\n##AUTHOR\n\nJo Bovy - bovy at ias dot edu\n\nIf you find this code useful in your research, please cite\n[arXiv:1111.1724](http://arxiv.org/abs/1111.1724). Thanks!\n\n\n##INSTALLATION\n\nStandard python setup.py build/install\n\n\n##DEPENDENCIES\n\nThis package requires [NumPy](http://numpy.scipy.org/), [Scipy] (http://www.scipy.org/), [Matplotlib] (http://matplotlib.sourceforge.net/), and [Pyfits](http://www.stsci.edu/resources/software_hardware/pyfits). To use coordinate transformations, [galpy](https://github.com/jobovy/galpy) is required.\n\n\n##BASIC DOCUMENTATION\n\nsegueSelect is a Python package that implements the model for the\nSDSS/SEGUE selection function described in Appendix A of\n[arXiv:1111.1724](http://arxiv.org/abs/1111.1724). It automatically\ndetermines the selection fraction---the fraction of stars with good\nspectra---as a continuous function of apparent magnitude for each\nplate. The selection function can be determined for any desired sample\ncuts in signal-to-noise ratio, u-g, r-i, and E(B-V).\n\nTo get started, download the files at\nhttp://astro.utoronto.ca/~bovy/segueSelect/, put them in some directory,\ndefine an environment variable SEGUESELECTDIR that points to this\ndirectory, and untar the segueplates.tar.gz file (tar xvzf\nsegueplates.tar.gz).\n\n\nAfter installing the package (python setup.py install) you can use the\npackage as\n\n\tfrom segueSelect import segueSelect\n\tselectionFunction= segueSelect(sample='G',sn=15,select='all')\n\nto get the selection function for the SEGUE G-star sample, using a\nsignal-to-noise ratio cut of 15, and selecting all stars in the\nspectroscopic sample in the G-star color range 0.48 <= g-r <= 0.55\n(as opposed to select='program', which just uses the stars that were\ntargeted as G stars).\n\nThe selection function is determined on the fly, so sample selection\ncan be adjusted if desired. Relevant options are\n\n    ug= if True, cut on u-g, (default: False)\n    \tif list/array cut to ug[0] < u-g< ug[1]\n    ri= if True, cut on r-i,  (default: False)\n    \tif list/array cut to ri[0] < r-i< ri[1]\n    sn= if False, don't cut on SN, \n    \tif number cut on SN > the number (default: 15)\n    ebv= if True, cut on E(B-V), \n    \t if number cut on EBV < the number (default: 0.3)\n\nThe type of selection function can be set separately for 'bright'\nplates and 'faint' plates. The default for both is 'tanhrcut', which\nis the selection function described in Appendix A of\n[arXiv:1111.1724](http://arxiv.org/abs/1111.1724), but other options\ninclude:\n\n    type_bright= or type_faint=\n    \n        'constant': constant for each plate up to the faint limit for\n\tthe bright/faint sample (decent for bright plates, *bad* for\n\tfaint plates that never reach as faint as the faint limit)\n\n        'sharprcut': use a sharp cut rather than a hyperbolic tangent\n\tcut-off at the faint end of the apparent magnitude range\n\nThe recommended setting is 'tanhrcut' for both bright and faint plates.\n\nFor a full list of options, do\n\n    ?segueSelect\n\nOnce the selection function is initialized it can be evaluated as\n\n     plate=2964\n     value= selectionFunction(plate,r=16.)\n\nwhere value is then the fraction of stars in the photometric sample\nwith a SEGUE spectrum passing the sample cuts for that plate number\nand that r-band apparent magnitude. 'r=' can be an array, for quicker\nevaluation.\n\n\n##ADVANCED FUNCTIONALITY\n\nPlease look at the source code (segueSelect/segueSelect.py) for an\noverview of the advanced capabilities of this package. Some useful\nfunctions are\n\n\n    selectionFunction.check_consistency(plate)\n\nwhich will calculate the KS probability that the spectropscopic sample\nwas drawn from the underlying photometric sample with the model\nselection function.\n\n\n    selectionFunction.plot(plate=plate)\n\nplots the selection function of this plate.\n\n\n    selectionFunction.plot_plate_rcdf(plate)\n\nplots the cumulative distribution function in r-band apparent\nmagnitude of the spectroscopic sample (red) and the photometric\nsample+selection-function-model for this plate (these should look\nsimilar and are what are used to calculate the KS probability).\n\n\n    read_gdwarfs(file=_GDWARFALLFILE,logg=False,ug=False,ri=False,sn=True,\n                 ebv=True,nocoords=False)\n\nwhich reads the G stars (*not* just the dwarfs!) and applies the\ncolor, SN, and E(B-V) cuts (same format as above). If\n[galpy](https://github.com/jobovy/galpy) is installed, velocities will\nalso be transformed into the Galactic coordinate frame (read the\nsource for details).\n\n\n##K STARS\n\nThe code can also determine the selection function for SEGUE K\nstars. However, the bright/faint boundary seems to move around for K\nstars as the survey progressed (rather than stay constant at r=17.8\nmag), so the default selection function fails to give a reasonable\nselection function for many plates. The K star selection function is\nstill a work in progress, but determining the bright/faint boundary on\na plate-by-plate basis seems to work for most plates. This can be done\nby using\n\n    selectionFunction= segueSelect(sample='K',sn=15,select='program',indiv_brightlims=True)\n\nAgain, testing of this selection function has been very limited, so\nuse care when using the K stars. More details from some email:\n\n    Iterating with Katie Schlesinger, I think I have mostly figured\n    out the SEGUE K star selection function. It seems like there are ~40\n    plates for which the bright/faint boundary is not near 17.8 mag for\n    the K stars, but near 16 or 17 mag instead. A practical way to deal\n    with this is to set the bright/faint boundary for each plate pair at\n    the brightest spectroscopic K star on the faint plate of the pair.\n    This seems to give an acceptable model for the K star selection\n    function for the 'program' stars (those stars with the K-star target\n    bit set); it does not work so well for the sample of all spectroscopic\n    objects with 0.55 < g-r < 0.75, as there are always some stars much\n    brighter than the interface. It's unclear whether this is a documented\n    feature of the target selection (I cannot find any mention of it in\n    the SEGUE paper).\n", 
  "id": 2752865
}