{
  "read_at": 1462557165, 
  "description": "Random network generator", 
  "readme.md": "RandNetGen\n========================================================================\n\n Copyright 2014 Pol Colomer de Simon. All rights reserved. Code under License GPLv3.\n______________________________________________________________________________________\n\nThe program takes a network from an edge list file and generates a maximally random network with the same degree sequence and any possible combination of a list of other target properties.\n\nThe program can fix:\n* The original joint degree distribution *P(k,k')*\n* The average neighbour degree *Knn(k)*\n* The clustering coefficient\n* The number of triangles\n* The clustering spectrum\n\nRandomize a network fixing some properties is equivalent to generate dk-random graphs [4]. Increasing values of d capture progressively more properties of the network.\ndk 1 is equivalent to randomize the network fixing only the degree sequence. dk 2 fixes additionally the degree correlations. dk 2.1 fixes also the clustering coefficient and 2.5 de full clustering spectrum.\n\nRandomize a network keeping some properties of the original network can be useful for studying the effect of a certain feature on any topological or dynamical property of a network.\nCompare real networks with randomized versions of them can also reveal formation patterns.\nCode developed for the publication of articles in references [1,2,3].\n\n## Requirements and Installation\n\n  You only need to install the GSL library: http://www.gnu.org/software/gsl/\n  \n  How to tutorial: http://www.brianomeara.info/tutorials/brownie/gsl\n\n## Compilation\n\n  Simply run:\n\n    $ make \n\n  The executable created is called **RandNetGen**\n\n\n## Execution\n\nThe executable is called **RandNetGen**. The program has a set of options. To introduce on option you must introduce first its option key (preceded by a dash), one white space and then the argument value. The only compulsory option is the input network file (-net).\nArguments can appear in any order. If an argument does not appear the program gets the default value:\n\nExamples\n______________\n To randomize a network fixing its degree sequence and clustering spectrum\n \n \t$ ./RandNetGen -net netFILEname -ck original\n \n\n To randomize a network in the dk 2.1 series\n \n \t$ ./RandNetGen -net netFILEname -dk 2.1\n   \n \n To get a network with the same joint degree distribution *P(k,k')* and a certain clustering coefficient (0.23).\n \n \t$ ./RandNetGen -net netFILEname -pkk 1 -cbar 0.23    ## fixing \n \n \n To get a network with the same degree sequence, with an average neighbour degree given from a file and the original number of triangles\n \n \t$ ./RandNetGen -net netFILEname -knn knnFILEname -tri original\n \n \n \n## Options and Arguments\n\n#### Options:\n```\n\t-net      Network input file\n\t-pkk      Rewiring method\n\t-knn      Average neighbour degree\n\t-ck       Clustering spectrum\n\t-cbar     Local clustering coefficient\n\t-tri      Number of triangles per node\n\t-dk       Dk serie randomization\n\t-rewires  Number of rewires each metropolis step\n\t-beta0    Initial Metropolis temperature \n\t-Abeta    Increment ratio of the metropolis temperature \n\t-accMIN   Minimum acceptance rate\n\t-seed     Random seed\n```\n#### Arguments\n**Input network file**\n```\n-net <value>\n```\nName of the input network file. It should be in the edge list format: \nA file with two columns with all the edges. With or without repetitions.\nUndirected and unweighted networks only.\n\n**Rewiring method** \n```\n-pkk <value>\n```\nTwo possible integer values: 0 or 1.\n  * 0 if you only want to preserve the degree sequence\n  * 1 if you want to preserve the joint degree distribution (so both, the degree sequence and the degree correlations.)\n(Default: 0)\n\n**Average neighbours degree (*Knn(k)*)**\n```\n-knn <value>:\n```\nThe Average degree of the neighbours of nodes of degree *k*, *Knn(k)**. Three different values:\n  * \"original\" : the program gets the *Knn(k)* of the original network as the target one.\n  * \"filename\" : give the name of a file with the target *Knn(k)* you want. This file should have to columns. the first one is the degree and the second the *Knn(k)* of nodes of such degree\n  * \"none\"     : The program does not fix the *Knn(k)*.\n  * (Default: \"none\")\n\n**Clustering spectrum**\n```\n-ck <value>\n```\nThe clustering coefficient of nodes of degree *k*, *C(k)*. Three different values:\n  * \"original\" : the program gets the clustering spectrum of the original network as the target one.\n  * \"filename\" : give the name of a file with the target clustering spectrum you want. This file should have to columns. the first one is the degree and the second the clustering of nodes of such degree\n  * \"none\"     : The program does not fix the clustering spectrum.\n  * (Default: \"none\")\n\n**Clustering coefficient**\n```\n-cbar <value>\n```\nLOCAL clustering coefficient. Three different values:\n  * \"original\"   : the program gets the clustering coefficient of the original network as the target one.\n  * float number : the numerical value of the target clustering coefficient.\n  * \"none\"       : The program does not fix the clustering coefficient.\n  * (Default: \"none\")\n\n**Number of triangles of the network**\n```\n-tri <value>\n```\nThree different values:\n  * \"original\"   : the program gets the number of triangles of the original network as the target one.\n  * float number : the numerical value of the target number of triangles divided by the total number of nodes.\n  * \"none\"       : The program does not fix the number of triangles.\n  * (Default: \"none\")\n\n**dk series**\n```\n-dk <value>\n```\nThree different values:\n  * 0   : the program does not use the dk series terminology (default value)\n  * 1   : randomize only preserving the degree sequence\n  * 2   : randomize preserving the joint degree distribution (degree sequence and degree correlations). Equivalent to -pkk 1\n  * 2.1 : randomize preserving the joint degree distribution and the clustering coefficient. Equivalent to -pkk 1 -cbar original\n  * 2.5 : randomize preserving the joint degree distribution and clustering spectrum. Equivalent to -pkk 1 -ck original\n  * (Default: 0)\n\n**Number of rewires**\n```\n-rewires <value>\n```\nNumber of rewires of each metropolis step for a given temperature. Its proportional to the total number of edges of the network E. So a value of 100 means that we do 100*E rewires each metropolis step. If the metropolis algorithm is not able to reach the aim value of the clustering try to increase this parameter.\n(Default: 100)\n\n**Initial metropolis temperature**\n```\n-beta0 <value>\n```\nBeta is the inverse of the temperature. Beta0 is the initial value of beta.\nThe optimal value depends on the size of the system.\nI recommend to put a number that gives an initial acceptance rate above 90%.\n(Default: 100)\n\n**The temperature increment**\n```\n-Abeta <value>\n```\nThe incremental factor of B each time we reduce the temperature during the metropolis algorithm.\n*Bnew = Bold x Abeta*.\nIf the metropolis algorithm is not able to reach the aim value of the clustering try to reduce this parameter.\n(Default: 1.4)\n\n**The minimum acceptance rate**\n```\n-accMIN <value>\n```\nThis parameter controls when the metropolis algorithm stops.\n(Default: 0.00005)\n\n**The random seed**\n```\n-seed <value>\n```\n\n(Default: Time of the CPU)\n\n## Time performance\nOn an intel(r) Core(tm) i7-3770 CPU @ 3.40GHz x 8\n\nFixing the original clustering spectrum of the PGP network that has ~24000 edges takes approx 3.5 min\n\nFixing the original clustering spectrum of the PGP network preserving the joint degree distribution *P(k,k')* approx 11 min\n\nFixing a flat clustering spectrum of *C(k)=0.25* , preserving the joint degree distribution *P(k,k')* of a scale free network of 100.000 nodes and gamma exponent 3.1 (169518 edges) takes approx 86 hours.\n\n|Dk-Series | PGP (24000 edges)  |  US-aiports (1087 edges)|\n|:----------:|:------------------:|:-----------------------:| \n| 1        |        1 sec       |          1 sec          |\n| 2        |       14 sec       |          1 sec          |\n| 2.1      |       11 min       |         24 sec          |\n| 2.5      |       11 min       |         24 sec          |\n\n\n\n\n    \n\n## Brief description of Random Network Generator\n\nThis program randomizes a undirected and unweighted network by rewiring all the links but preserving the degree sequence using a similar approach to the algorithm in ref. [1,2]. We use two different rewiring schemes. In the first one (-pkk 0), two different edges are chosen at random. Let these connect nodes A with B and C with D. Then, the two edges are swapped so that nodes A and D, on the one hand, and C and B, on the other, are now connected. We take care that no self-connections or multiple connections between the same pair of nodes are induced by this process. This rewiring scheme preserves the degree distribution of the original network but not degree-degree correlations. In the second rewiring scheme (-pkk 1), we first chose an edge at random and look at the degree of one of its attached nodes, k. Then, a second link attached to a node of the same degree k is chosen and the two links are swapped as before. Notice that this procedure preserves both the degree of each node and the actual nodes' degrees at the end of the two original edges. Therefore, the procedure preserves the full degree-degree correlation structure encoded in the joint distribution *P(k k')*. Both procedures are ergodic and satisfy detailed balance.\n\nIn case the program is configured to fix any kind of clustering (spectrum,coefficient or number of triangles) or average neighbours degree (*Knn(k)*) it generates maximally random clustered networks by means of a biased rewiring procedure. Regardless of the rewiring scheme, explained above, at use, the process is biased so that generated graphs belong to an exponential ensemble of graphs. Here we consider ensembles where the Hamiltonian depends on the target property.\n\nIn case you are interested in randomizing weighted networks take a look at [multi edge randomizer](https://github.com/osagarra/Multi_edge_randomizer) by Oleguer Sagarra.\n\n## Acknowledgements\n\nI want to thank Sergio Oller, Chiara Orsini, Oriol Vilanova and Marian Boguna for their very useful comments and suggestions.\n\n## References \n\n[1] Pol Colomer-de-Simon, M Angeles Serrano, Mariano Beiro, \n    J. Ignacio Alvarez-Hamelin, and    Marian Boguna,\n    \"Deciphering the global organization of clustering in real complex networks.\" \n    [Scientific reports 3, 2517 (2013)](http://www.nature.com/srep/2013/130827/srep02517/full/srep02517.html).\n\n[2] Pol Colomer-de-Simon, Marian Boguna,\n    \"Double Percolation Phase Transition in Clustered Complex Networks\"\n    [Physical Review X, 4, 041020 (2014)](https://journals.aps.org/prx/abstract/10.1103/PhysRevX.4.041020)\n\n[3] Chiara Orsini, Marija Mitrovic Dankulov, Almerima Jamakovic, Priya Mahadevan, Pol Colomer-de-Simon, Amin Vahdat, Kevin E. Bassler, Zoltan Toroczkai, Marian Boguna, Guido Caldarelli, Santo Fortunato, Dmitri Krioukov,\n    \"How Random are Complex Networks\"\n    [Arxiv.org](http://arxiv.org/abs/1505.07503)\n\n[4] P. Mahadevan, D. Krioukov, K. Fall, and A. Vahdat,\n    Systematic Topology Analysis and Generation Using Degree Correlations\n    [SIGCOMM 2006](http://dl.acm.org/citation.cfm?doid=1151659.1159930) \n\n## License\n\nCopyright 2014 Pol Colomer de Simon.\nAll rights reserved. \nCode under License GPLv3.\n\n\n\n\n", 
  "id": 27600463
}