{
  "read_at": 1462557174, 
  "description": "Jansen-MIDAS, a software for segmentation of photomicrographs based on MLSOS technique.", 
  "README.md": "Jansen-MIDAS\n============\n\nThis is the repository for Jansen-MIDAS, a software for segmentation of photomicrographs based on MLSS and MLSOS techniques.\n\n**Author:** Alexandre Fioravante de Siqueira\n\n**Description:** Jansen-MIDAS is a software developed to provide\nMulti-Level Starlet Segmentation (MLSS) and Multi-Level Starlet\nOptimal Segmentation (MLSOS) techniques. These methods are based on\nthe starlet transform, an isotropic undecimated wavelet, in order to\ndetermine the location of objects in photomicrographs.\nUsing Jansen-MIDAS, a scientist can obtain a multi-level threshold\nsegmentation of his/hers photomicrographs.\n\n**Version:** april 2016.\n\n**Please cite:**\n\n1. de Siqueira, A.F. et al. Jansen-MIDAS: a multi-level photomicrograph\nsegmentation software based on isotropic undecimated wavelets, 2016. [(arXiv)](http://www.arxiv.org/abs/1604.05921)\n\n2. de Siqueira, A.F. et al. Estimating the concentration of gold\nnanoparticles incorporated on Natural Rubber membranes using Multi-Level\nStarlet Optimal Segmentation. Journal of Nanoparticle Research, 2014,\n16; 2809. doi: [10.1007/s11051-014-2809-0](http://dx.doi.org/10.1007/s11051-014-2809-0).\n\n3. de Siqueira, A.F. et al. An automatic method for segmentation\nof fission tracks in epidote crystal photomicrographs. Computers and\nGeosciences, 2014, 69; 55-61. doi: [10.1016/j.cageo.2014.04.008](http://dx.doi.org/10.1016/j.cageo.2014.04.008). [(arXiv)](http://www.arxiv.org/abs/1602.03995)\n\n4. de Siqueira, A.F. et al. Segmentation of scanning electron\nmicroscopy images from natural rubber samples with gold nanoparticles\nusing starlet wavelets. Microscopy Research and Technique, 2014, 77(1);\n71-78. doi: [10.1002/jemt.22314](http://dx.doi.org/10.1002/jemt.22314).\n\nJansen-MIDAS is free software: you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program.  If not, see <http://www.gnu.org/licenses/>.\n\n", 
  "id": 27833157
}