{
  "read_at": 1462557147, 
  "description": "", 
  "README.md": "=======\nHALOGEN\n=======\n\nHALOGEN is a C program for creating realistic synthetic dark matter halo catalogs \nin a flash. \n\nIt decomposes the problem of generating cosmological tracer distributions\n(eg. halos) into four steps:\n* Generating an approximate density field;\n* Generating the required number of tracers from a CDF over mass;\n* Placing the tracers on field particles according to a bias scheme dependent\non local density;\n* Assigning velocities to the tracers based on velocities of local particles.\n\nIt also implements a default set of four models for these steps as:\n* 2LPT density field\n* Tabulated mass function from the literature\n* A single-parameter power-law biasing scheme.\n* A linear transformation of velocities from the sampled DM particle\nvelocities.\n\nFor more details on the method, see Avila, S. et\nal. 2015 -- http://mnras.oxfordjournals.org/cgi/content/abstract/stv711?ijkey=Do3EfS9S1jHUhrv&keytype=ref\n\nInstallation\n------------\nHALOGEN depends only on the libraries FFTW (v2.x only) and GSL. To set these and \nother specific options for compilation, edit the top part of the ``Makefile.defs``\nfile in the top-level directory. Compilation has been tested with mpicc/gcc, \nicc and craycc.\n\nAlso in the ``Makefile.defs`` file are a number of global options for HALOGEN\nwhich affect its output in various ways. Please set these as desired.\n\nAfter modifying ``Makefile.defs``, all (4) executables can be compiled with\n``make`` (using ``make halogen``, ``make 2LPT-HALOGEN``, ``make 2LPT`` and\n``make fit`` makes each executable individually).\n\nThe executables will be compiled into the top-level directory.\n\nTo optionally install, save the executable somewhere on the system path, eg. \nin ``/usr/bin/``.\n\n\nUsage\n-----\nThe primary usage is by using the fully combined executable, and simply runs\nas\n\n    $ 2LPT-HALOGEN <2LPT.input> <HALOGEN.input>\n\nFor details on the parameters in the input files, and how to run the other \nexecutables, see the README file in the ``examples/`` directory.\n\nWe strongly encourage every user to run through these examples before\nundertaking any other usage of HALOGEN.\n\n\nAcknowledgments\n---------------\nIf you find this code helpful in your research, please cite Avila, S. et\nal. 2014 -- http://arxiv.org/abs/1412.5228.\n\nNote that HALOGEN makes use of the pre-existing codes:\n - 2LPTic by Sebastian Pueblas and Roman Scoccimarro (http://arxiv.org/abs/astro-ph/9711187, http://cosmo.nyu.edu/roman/2LPT/)\n - CUTE  by David Alonso (http://arxiv.org/abs/1210.1833)\n\nAuthors\n-------\nSantiago Avila Perez: santiago.avila@uam.es\nSteven Murray: steven.murray@uwa.edu.au \n", 
  "id": 27875219
}