{
  "read_at": 1462557193, 
  "description": "with apologies to douglas hofstadter, melanie mitchell, and james marshall", 
  "README.md": "metaca\n======\nwith apologies^* to douglas hofstadter, melanie mitchell, and james marshall\n\n![metaca](http://metameso.org/~joe/timesCA.png \"MetaCA\")\n\nThis code creates \"meta-\" cellular automata spacetime diagrams.  That\nis, the CA's evolve their own rules locally, rather than evolving an\nabstract state according to one global rule.  A MetaCA can be coupled\n(in one or both directions) with a standard CA.\n\nPrevious work with cellular automata feature evolving global rules,\nincluding the recent work on PICARD by Theodore Pavlic et al.  The\ncurrent work is the first example that I am aware of that evolves the\nevolutionary rule locally.\n\nIn addition to these 1D examples, our paper (and slides) presented at\nAISB'15 consider 2D examples.  The code for those experiments is in\n[ewenmaclean/2dCA](https://github.com/ewenmaclean/2dCA).\n\n## Citation\n\nCorneli, J. and Maclean,\nE. 2015. [The search for computational intelligence](http://www.cs.kent.ac.uk/events/2015/AISB2015/proceedings/socialComp/papers/SACCS-AISB2015_submission_6.pdf). In:\nErden, Yasemin J., Giovagnoli, Raffaela, and Dodig-Crnkovic, Gordana,\neds., _Social Aspects of Cognition and Computing Symposium, Proc. Annual Convention of the Society for the Study of Artificial Intelligence and Simulation of Behaviour (SSAISB), University of Kent, Canterbury, UK, 20-22nd April 2015_.\n\n## *: See also\n\n- Douglas Hofstadter, \"Prologemena to any future Metacat\", in Fluid concepts and creative analogies, pp. 307 - 318, 1995\n\n- Melanie Mitchell, Peter T. Hraber, and James P. Crutchfield. Revisiting the edge of chaos: Evolving cellular automata to perform computations. Complex Systems, 7:89--130, 1993.\n\n- James B. Marshall, Metacat: A Self-Watching Cognitive Architecture for Analogy-Making and High-Level Perception, (PhD thesis) Indiana University, Bloomington 1999.\n\n- Pavlic, Theodore P. and Adams, Alyssa M. and Davies, Paul C.W. and Walker, Sara Imari, Self-referencing cellular automata: A model of the evolution of information control in biological systems In: Artificial Life 14: Proceedings of the Fourteenth International Conference on the Synthesis and Simulation of Living Systems, The MIT Press, 522--529, 2014. (arXiv:1405.4070)\n", 
  "id": 28039880
}