{
  "read_at": 1462557140, 
  "description": "Molecular dynamics simulations of classical anharmonic hard-point particle chains", 
  "README.md": "Molecular dynamics simulations of classical anharmonic hard-point particle chains\n=================================================================================\n\nC source code (with minor improvements) and Mathematica test files for the calculations in Ref. 1 and 2 below. The code uses the FFTW library and consists of three subprojects:\n- monoatomic chains with a shoulder-shaped interaction potential\n- biatomic hard-point particle chains with alternating masses and pairwise elastic collisions at zero separation distance\n- biatomic hard-point particle chains with alternating masses and square-well interaction potential; i.e., the particles additionally \"collide\" when reaching a maximum separation distance\n\nHow to compile the source code:\n- Windows: Visual Studio project files are provided in the *vcproj* subfolders\n- Linux/Unix-type OS: makefiles are available in the *bin* and *test* subfolders. You probably have to adapt the FFTW library paths to your local installation. Some test files use a smaller lattice size (e.g., 16 instead of 4096) and require a temporary change of the 'NUM_SITES' preprocessor constant in `field.h` prior to compilation.\n\n\nLicense\n-------\nCopyright (c) 2014, Christian B. Mendl  \nAll rights reserved.  \nhttp://christian.mendl.net\n\nThis program is free software; you can redistribute it and/or\nmodify it under the terms of the Simplified BSD License\nhttp://www.opensource.org/licenses/bsd-license.php\n\n\nReferences\n----------\n1. Christian B. Mendl, Herbert Spohn  \n   Current fluctuations for anharmonic chains in thermal equilibrium  \n   [arXiv:1412.4609](http://arxiv.org/abs/1412.4609)\n2. Christian B. Mendl, Herbert Spohn  \n   Equilibrium time-correlation functions for one-dimensional hard-point systems  \n   Phys. Rev. E 90, 012147 (2014), [arXiv:1403.0213](http://arxiv.org/abs/1403.0213)\n3. Christian B. Mendl, Herbert Spohn  \n   Dynamic correlators of Fermi-Pasta-Ulam chains and nonlinear fluctuating hydrodynamics  \n   Phys. Rev. Lett. 111, 230601 (2013), [arXiv:1305.1209](http://arxiv.org/abs/1305.1209)\n4. Herbert Spohn  \n   Nonlinear fluctuating hydrodynamics for anharmonic chains  \n   J. Stat. Phys. 154, 1191-1227 (2014), [arXiv:1305.6412](http://arxiv.org/abs/1305.6412)\n", 
  "id": 28096568
}