{
  "read_at": 1462557201, 
  "description": "Python code for extracting typical travel times from call detail records.", 
  "README.md": "---------\nd4dttimes\n---------\n\nThis repository contains the python code for extracting travel times between different locations based on anonymized call detail record data.\n\nThe format of the input data is explained in http://arxiv.org/abs/1407.4885 (tower level mobility data).\nThe original research data was provided by Orange and Sonatel in conjunction with the Data for Development Challenge Senegal (D4D 2014, http://www.d4d.orange.com/en/home/).\n\nThis repository contains the 'minimal set' of tools for extracting travel times from CDR data provided in the above format.\n(This code is a cleaned, stripped down version of the actual research code.)\nFor more advanced pipelining of data, you may contact the author of this repository.\n\n\nAuthor:\n-------\nRainer Kujala, Rainer.Kujala [at sign) aalto.fi\n\nContents:\n---------\naux.py\n\n\tA couple of helper functions.\n\ncell_tower_groups_from_coords.py\n\n\tFunction how to group cell towers given a location and a radius.\n\ncomp_tower_tower_travel_times.py\n\n\tFunctions for computing all travel times between two locations.\n\ncompute_on_road_distances.py\n\n\tFunctions for computing the on-road distances between locations.\n\ndataio.py\n\n\tHelper functions for loading data.\n\nttime_estimator.py\n\n\tEstimates travel times given the travel times obtained using `comp_tower_tower_travel_times.py`\n  A function for computing bootstrap estimates.\n\nexample_pipeline.py\n\n\tSimple script to show how these should be used in combination.\n\n\nTesting\n-------\n\nTest modules:\n\n\ttest_aux.py\n\ttest_comps.py\n\nDependencies\n------------\n\nThis package depends on the following packages.\n\n- The SciPy stack: (Numpy, Scipy, Matplotlib)\n- geopy (used for computing distances between coordinates)\n\nCity coordinate data (cities_coords_senegal.csv) has been obtained from http://www.tageo.com/index-e-sg-cities-SN.htm\n", 
  "id": 28098858
}