{
  "README": "Welcome to Copter!\n\nIntroduction\n------------\nCopter is a software package for doing calculations in cosmological\nperturbation theory.  Specifically, Copter includes code for computing\nstatistical observables in the large-scale structure of matter using various\nforms of perturbation theory, including linear theory, standard perturbation\ntheory, renormalized perturbation theory, and many others.  For a fuller\ndescription of the various theories, see arXiv:0905.0479 and references\ntherein.\n\n\nRequirements\n------------\nCopter is written in C++, so you'll need a relatively modern C++ compiler (e.g.\ng++).  Copter makes use of the Boost C++ library headers, so you will need to\nhave these installed somewhere on your system.  (Note that Copter only uses\nboost::bind and boost::cref, both of which are defined purely in header files,\nso there is no need to link against boost.  Also, these particular functions\nhave now been included in the standardize TR1 library, so the dependence on\nBoost will go away in the future.)\n\nTo build the optional Python bindings, you'll need\n  1) a recent version of SWIG (usually located at /usr/bin/swig).\n  2) Python development headers (usually found in /usr/include/pythonM.N),\n  3) Numpy development headers (usually found in /usr/include/numpy)\nThe configure script (described below) should find the relevant files\nautomagically.\n\n\nBuilding and Installing\n-----------------------\nCopter should compile on any standard Unix-like system (including Linux and OS\nX).  It makes use of GNU Autotools, which is the standard build system for most\nopen source software today.  For you, the user, installation is as simple as\nentering the three commands\n  $ ./configure [OPTION]... [VAR=VALUE]...\n  $ make\n  $ make install\n\nThe installation directory is determined by the options you pass to the\n'configure' script.  The most important options are:\n  --prefix=PREFIX   top-level installation directory (defaults to /usr/local,\n                      so you probably want to specify this option)\n  --enable-openmp   use OpenMP to parallelize expensive loops (default yes)\n  --enable-python   build Python bindings (default no)\nBy default 'make' will use the standard system compiler.  To use a different\ncompiler, append 'CXX=<preferred C++ compiler>' to your configure command.\nTry `./configure --help' to see a full list of options.\n\nRunning 'make install' will install the library 'libcopter.so' to 'PREFIX/lib',\nthe corresponding C++ header files to 'PREFIX/include/Copter', and some\nstandard data files to 'PREFIX/share/Copter'.  If Python bindings are enabled,\nthey will be installed to 'PREFIX/lib/pythonM.N/site-packages'.\n\nFor example, to install Copter to your home directory (~/lib, ~/include, etc.)\nusing the Intel compiler, you would run\n  $ ./configure --prefix=$HOME --enable-openmp CXX=icpc\n  $ make\n  $ make install\n\n", 
  "read_at": 1462543290, 
  "description": "A software package for cosmological perturbation theory", 
  "id": 2816233
}