{
  "read_at": 1462557259, 
  "description": "The function provided by this package is a QR factorizations for Tall-and-Skinny matrices (TSQR) which is implemented in Apache Spark.", 
  "README.txt": "ITSQR: Iterative Tall-and-Skinny QR Factorization in Spark Implementation\r\nVersion 0.1\r\nDistributed in 2014/09/04\r\n===\r\n\r\n### Hsiu-Cheng Yu, Che-Rung Lee\r\n\r\n\r\n# Introduction\r\n----------------\r\nThe function provided by this package is a QR factorizations for Tall-and-Skinny matrices (TSQR) implementation.  \r\nA 'Tall-and-Skinny matrix' which number of rows is much bigger than its number of columns. \r\nThe TSQR function can be used to solve many problems, such as stochastic SVD (SSVD). You can find more detail about \r\nthis implemenation in my thesis \"Implemenations of TSQR for Cloud Platforms and Its Applications of SSVD and Collaborative Filtering\".\r\n\r\nIn this implementation, we provide three functions:\r\n\r\n * TSQR: Compute Q and R matrices of given tall-and-skinny matrix.\r\n * Recommendation System: An application of stochastic SVD, Use item-based collaborative filtering to implement a recommendation system\r\n \r\nThis code is written in Java and uses JLAPACK and JBLAS library for matrix computation.\r\n\r\n# Environment Setup\r\n--------\r\nThis code is for Linux systems.  This implementation is based on several library. Make sure those library are properly installed before running this program.\r\n\r\n * Apache Spark 0.9.x version (http://spark.apache.org/)\r\n   This implementation is running on Spark standalone mode\r\n * matrix-toolkits-java (https://github.com/fommil/matrix-toolkits-java)\r\n * JLAPACK, JBLAS and F2JUTLI (http://www.netlib.org/java/f2j/)\r\n * ITSQR package in Hadoop MapReduce implementation (https://github.com/NovanHsiu/ITSQR-Hadoop)\r\n \r\n# Compiling \r\n--------------\r\nFirst, decompress our archive into installed directory of Spark. And setup following paths in script \"compute-classpath.sh\" and \"pom.xml\".\r\nThere are five paths of libraries need to setup in \"compute-classpath.sh\": MTJ, JLAPACK, JBLAS, JUTIL and HITSQR.\r\n\r\n - MTJ \r\n  Path where matrix-toolkits-java is installed.\r\n - JLAPACK\r\n  Path where is lapack.jar package\r\n - JBLAS\r\n  Path where is blas.jar package\r\n - JUTIL\r\n  Path where is f2jutil.jar package\r\n - HITSQR\r\n  Path of TSQR.jar, the package of ITSQR in Hadoop implementation\r\n  \r\nUsing Maven to compile and archive, or remove the old file.\r\n (1) $ mvn install\r\n     Compile and archive all Class files\r\n (2) $ mvn clean\r\n     Remove archive file and directory of Class file\r\n\t \r\n# Usage Example and Command Line Arguments\r\n----------------------------------------------------\r\n\r\n $(MTJ)\r\n  Path of matrix-toolkits-java package\r\n $(JLAPACK)\r\n  Path where is lapack.jar package\r\n $(JBLAS)\r\n  Path where is blas.jar package\r\n $(JUTIL)\r\n  Path where is f2jutil.jar package\r\n $(SPARK_HOME)\r\n  Path where Spark is installed\r\n $(TSQR_DIR)\r\n  Path where TSQR package is installed\r\n  TSQR_DIR=$(SPARK_HOME)/ITSQR_Spark_v1\r\n  \r\n## Upload our example for experiment of ITSQR or SSVD\r\n $ hadoop fs -mkdir tsqr\r\n $ hadoop fs -copyFromLocal testdata/100x5\r\n \r\nIn the input file of example, one line means one row in a matrix, and numbers are separated by a space. \r\nIf you want to use other matrices for this code, the format of matrices must follow above rules.\r\n\r\n## Upload our example for experiment of Recommendation System\r\n $ hadoop fs -mkdir ratingData\r\n $ hadoop fs -copyFromLocal testdata/testRatingData\r\n \r\n The input of recommendation system is composed by user ratings for items in text file, looks like following example:\r\n <user id> <item id> <rating value>\r\n 108 123 3.5\r\n\r\n## Example: Run Iterative TSQR\r\n### Do QR Factorization only\r\n ${SPARK_HOME}/ITSQR_Spark_v1/run-tsqr nthu.scopelab.stsqr.TSQR \\\r\n -master spark://scopion-headnode:7066 \\\r\n -input input/mat30x10 \\\r\n -output outputQ \\\r\n -subRowSize 10 \\\r\n -em 2g\r\n\r\n#### Explanation of Arguments for Running Iterative TSQR\r\nThe argument has star mark * means that it must be given a value by user and other arguments without star mark have default value.\r\n \r\n -master *\r\n  location of dameon process on master node\r\n -input *\r\n  Input file, including its directory.\r\n -output *\r\n  Output directory\r\n -subRowSize * (default: equal to number of columns)\r\n  It is the number of rows of each submatrix. These submatrices are split from input matrix. subRowSize must be bigger than the number of columns, and smaller than the number of rows of the original matrix.\r\n -em (default: 512m)\r\n  Memory for each executor on slave node\r\n -reduceSchedule (default: 1) \r\n  This argument is used in QRFirstJob. The input can be a sequence of numbers, which are separated by commas.  The ith number in the sequence represents the number of Reducers in the ith MapReduce task.\r\n  Finally, last number need to set to one in order to calculate the final R.\r\n  For example, 4,1 means that it has two MapReduce and first MapReduce has four Reducers and second has one reducer.\r\n \r\n## Example: Running Iterative TSQR SSVD (ITSSVD) Item-Based Recommendation System \r\n ${SPARK_HOME}/ITSQR_Spark_v1/run-tsqr nthu.scopelab.stsqr.ssvd.rec.RecommendationRunner \\\r\n -master spark://scopion-headnode:7066 \\\r\n -input ratingData/testRatingData \\\r\n -output outputRS \\\r\n -rank 10 \\\r\n -oversampling 50 \\\r\n -subRowSize 1000 \\\r\n -numrec 10 \\\r\n -em 2g\r\n\r\n#### Explanation of Arguments for Running Recommendation System \r\n - input, output, ....\r\n  The same as they are in the TSQR example\r\n - rank *\r\n  \"rank\" is Stochastic number that would simply m*n matrix to m*k matrix. (k is smaller than n)\r\n - oversampling\r\n  \"oversampling\" is a sampling value for reducing deviation of SSVD and this value would increase the size of column in calculation\r\n - numrec\r\n  Number of recommended item for per user\r\n   \r\n# Tuning Suggestion of Arguments\r\n--------------------------------\r\nIf you want improve performance for ITSQR by tuning argument. We have some tips for following three arguments.\r\n\r\n-subRowSize\r\nThis argument does not has obvious influence for performance of application in this package, but it has a point need to know. \r\nIf the argument is too large which cause the data size of sub matrix is bigger than Map task input split size, \r\nthat will dramatically reduce the performance because of unblance workload for each task.\r\n\r\n-reduceSchedule\r\nThe default value of this argument was one (1). If you encounter the out of memory problem of JVM or performance bottleneck in QRFirstJob or QJob\r\nthat caused by bigger data, you could find more detail in section 5.4.2 of my thesis which is descirbed in above part of introduction.\r\n\r\n# Overview\r\n--------\r\n * src/main/java/nthu/scopelab/stsqr/TSQR.java - driver code for TSQR\r\n * src/main/java/nthu/scopelab/stsqr/ssvd/rec/RecommendationRunner.java - driver code for Recommendation System\r\n * src/main/java/nthu/scopelab/stsqr/ssvd/rec/RecSplitVRunner.java - driver code for Recommendation System with another method of implementation\r\n \r\n# References\r\n--------------\r\n * Direct QR factorizations for tall-and-skinny matrices in MapReduce architectures [[pdf](http://arxiv.org/abs/1301.1071)]\r\n * Tall and skinny QR factorizations in MapReduce architectures [[pdf](http://www.cs.purdue.edu/homes/dgleich/publications/Constantine%202011%20-%20TSQR.pdf)]\r\n * [MAHOUT-376] Implement Map-reduce version of stochastic SVD [https://issues.apache.org/jira/browse/MAHOUT-376]\r\n\r\nContact\r\n--------\r\n * For any questions, suggestions, and bug reports, email Hsiu-Cheng Yu by s411051@gmail.com please.\r\n * This code can be reached at: https://github.com/NovanHsiu/ITSQR-Spark\r\n \r\n", 
  "id": 28614521
}