{
  "read_at": 1462543292, 
  "description": "Python tools for numerical models useful to rubidium atomic physicists.", 
  "README.md": "#Rubidium Spectrum Model\nThis script provides python code that is useful for calculating absorption spectra for the Rubidium D1 and D2 lines.\n\nBased on the paper by Paul Siddons:\n*Siddons et al. J. Phys. B: At. Mol. Opt. Phys. 41, 155004 (2008).*\npreprint available: [arXiv:0805.1139](http://arxiv.org/abs/0805.1139).\n\nThis code is also heavily inspired by Mathematica code by the same author. Unfortunately, the original code does not appear to be available any more.\n\n\n##Features\nFunctions provide calculation of the following:\n - Transmission as a function of temperature (T) and detuning ([?]).\n - Index of refraction *n([?],T)*\n - Group velocity *V<sub>g</sub>([?],T)*\n - Other intermediate parameters: vapor pressure, absorption, etc.\n\n##Requirements (minimum tested)\n\n - python (2.7)\n - Scipy (0.9.0)\n - matplotlib \n - numpy\n\nI recommend using either [Anaconda](https://store.continuum.io/cshop/anaconda/) or [Enthought Canopy](https://store.enthought.com). These packages provide the above requirements in one easy-to-maintain format.\n\n##Installation & Usage\n\nThe single-script python code `rubidiumD1.py` or `rubidiumD2.py` will generate absorption data for a vapor cell at a given temperature (in Kelvin) with length Lc (in meters). The detuning range generated can be set and defaults to -4 GHz through +6 GHz. The script generates a plot using pylab (matplotlib) and saves raw data to an ascii file.\n\nAn [IPython notebook](http://nbviewer.ipython.org/github/DawesLab/rubidium/blob/master/Rubidium%20Vapor.ipynb) is also included that provides an example workflow.\n\n##Extending the code\n\nFunctions from this script can be imported and used in other python code. My intention is to continue to build on these features and maintain a useful python repository for numerical modeling in rubidium vapor systems.\n\nPlease contribute if you have more ideas and time. If this is useful, leave a comment and let me know what more you would like it to do.\n", 
  "id": 2885420
}