{
  "read_at": 1462551840, 
  "description": "Matlab code for experimenting with various SPSD Sketches", 
  "README.md": "Nystrom Bestiary v2.0  \n=====================\nwritten by [Alex Gittens](http://thousandfold.net/cz)  \nlicensed under the [Creative Commons ShareAlike 4.0 International License](http://creativecommons.org/licenses/by-sa/4.0/)\n\nNystrom Bestiary is a collection of code for experimenting with various SPSD Sketches, including Nystrom extensions based on column sampling, Nystrom extensions based on random mixtures of columns, and 'pinched' and 'prolonged' eigensketches (see the review paper [\"Finding structure with randomness: Probabilistic algorithms for constructing approximate matrix decompositions\"](http://arxiv.org/abs/0909.4061) equations (5.11) and (5.12) for the precise definition of these two sketches).\n\nIt was used to produce the figures in the paper [\"Revisiting the Nystrom Method for Improved Large-scale Machine Learning\"](http://arxiv.org/abs/1303.1849) (arXiv preprint link) by Alex Gittens and [Michael Mahoney](http://cs.stanford.edu/people/mmahoney/). In particular, the experimental setup to generate exactly those figures is included.\n\nSend comments, suggestions, and complaints to gittens AT icsi FULLSTOP berkeley FULLSTOP edu\n\nContents\n--------\n- the `extensions/` directory contains the implementations of various Nystrom extensions\n- the `io/` directory contains the code used to create, load, and process the datasets\n- the `datasets/` directory contains the datasets used in the experiments\n- the `experiments/` directory contains a set of m-files that actually runs the Nystrom\n extensions on various datasets and stores statistics on the errors and timing\n- the `outputs/` directory is used to store the output of the experiments\n- the `plots/` directory stores the plots of the timings and errors\n- the `auxiliary/` directory contains code needed in computing the extensions\n- the `visualization/` directory contains the code used to produce the plots of the\n various timings and errors\n- the `misc/` directory contains miscellany (so far, the code to generate the data\nfor Table 2 in the paper)\n\nUsage instructions\n-------\n_ALL m files should be run from the base folder, otherwise you'll run into path issues_    \nTo produce the figures in the paper:  \n#####Short story\nEnsure that you are in the base directory, `NystromBestiary`, and run the following commands from the Matlab prompt:\n\n    addpath(genpath('.'))\n    create_bestiary_datasets\n    maxNumCompThreads = 1; # if you want accurate timing info\n    runall\n    visualizeall\n\n#####Long story\n1.  add all the subdirectories in this folder to your path\n2.  run `create_bestiary_datasets` to generate\n some required distance matrices; this step generates about 1.5Gb of data\n3. If you want to have email notifications at the start and end of each\nexperiment, modify `runall.m` to set the `sendEmails` flag to true and set the \nemail-related variables appropriately, then run\n`setpref('Internet', 'SMTP_Password', 'youremailpassword')`\nat the Matlab command line\n4.  run `runall` (or pick individual experiments) in the experiments directory;\n this step generates about 2.7Gb of data\n5.  wait several days for the experiments to stop running!\n6.  run `visualizeall`\n\nThe pdfs will be located in the output directory\n\nSee the individual m-files for more details. Make appropriate\nmodifications to substitute your own datasets.\n\nAttributions:\n------------\n* jdqrpcg.m is due to [Yvan Notay](http://homepages.ulb.ac.be/~ynotay/) (see the m file for full attribution)  \n* notifier.m is due to [Benjamin Krause](http://www.mathworks.com/matlabcentral/fileexchange/authors/74912) (see the m file for full attribution)  \n\nfor dataset provenances, see Table 3 in the above mentioned paper (datasets: Abalone, Wine, Spam, Kin8nm, Dexter, Gisette, Enron, Protein, SNPs, HEP, GR, Gnutella)  \ntwo additional datasets, Cranfield and Medline, are from the [Text to Matrix Generator](http://scgroup20.ceid.upatras.gr:8000/tmg/) Matlab Toolbox's website.\n", 
  "id": 29410392
}