{
  "README": "Xapers - personal journal article management system\n===================================================\n\nXapers is a personal document indexing system, geared towards academic\njournal articles.  Think of it as your own personal document search\nengine, or a local cache of online libraries.  It provides fast search\nof document text and bibliographic data and simple document and bibtex\nretrieval.\n\nDocument files (in PDF format) and source identifiers (e.g. DOI) are\nparsed and indexed into a Xapian search engine [0].  Document text is\nextracted from the PDF and fully indexed.  Bibliographic information\ndownloaded from online libraries is indexed as prefixed search terms.\nExisting bibtex databases can be easily imported as well, including\nimport of pdf files specified in Jabref/Mendeley format.  Documents\ncan be arbitrarily tagged.  Original document files are easily\nretrievable from a simple curses search UI.  The command line\ninterface allows for exporting bibtex [1] from arbitrary searches,\nallowing seamless integration into LaTeX work flows.\n\nXapers provides source modules for some common online resources:\n\n  * doi: Digital Object Identifier (https://dx.doi.org/)\n  * arxiv: Open access e-print service (http://arxiv.org/)\n  * dcc: LIGO Document Control Center (https://dcc.ligo.org/)\n  * cryptoeprint: Cryptology ePrint Archive (https://eprint.iacr.org/)\n\nContributions of additional source interface modules is highly\nencouraged.  See the SOURCES file, included with the xapers source,\nfor info on creating new sources.\n\nXapers is heavily inspired by the notmuch mail indexing system [2].\n\n[0] http://www.xapian.org/\n[1] http://www.bibtex.org/\n[2] http://notmuchmail.org/\n\n\nContact\n=======\n\nXapers was written by:\n\n    Jameson Graef Rollins <jrollins@finestructure.net>\n\nXapers has a mailing list:\n\n    xapers@lists.mayfirst.org\n    https://lists.mayfirst.org/mailman/listinfo/xapers\n\nWe also hang out on IRC:\n\n    channel: #xapers\n    server:  irc.freenode.net\n\nPlease submit all bug reports to the Debian bug tracking system (BTS):\n\n    https://bugs.debian.org/xapers\n    https://www.debian.org/Bugs/Reporting\n\n\nGetting Xapers\n==============\n\nSource\n------\n\nClone the repo:\n\n    $ git clone git://finestructure.net/xapers\n    $ cd xapers\n\nDependencies :\n  * python (>= 2.6)\n  * python-xapian - Python Xapian search engine bindings\n  * poppler-utils - PDF processing tools\n  * pybtex - Python bibtex parser\n  * pycurl - Python bindings to libcurl\n\nRecommends (for curses UI) :\n  * python-urwid - Python Urwid curses library\n  * xdg-utils - Desktop tools for opening files and URLs\n  * xclip - X clipboard support for copying document fields\n\nOn Debian:\n\n    $ sudo apt-get install python-xapian poppler-utils python-pycurl pybtex python-urwid xdg-utils xclip\n\nRun the tests:\n\n    $ make test\n\nDebian\n------\n\nXapers is a part of Debian:\n\n    $ apt install xapers\n\nDebian/Ubuntu snapshot packages can be easily made from the git\nsource.  You can build the package from any branch but it requires an\nup-to-date local branch of origin/debian, e.g.:\n\n    $ git branch debian origin/debian\n\nThen:\n\n    $ sudo apt-get install build-essential devscripts pkg-config python-all-dev python-setuptools debhelper dpkg-dev fakeroot\n    $ make debian-snapshot\n    $ sudo dpkg -i build/xapers_0.6_amd64.deb\n\n\nUsing Xapers\n============\n\nSee the included xapers(1) man page for detailed usage and information\non source modules and searching.\n\nCommand line interface\n----------------------\n\nThe main interface to Xapers is the xapers command line utility.  From\nthis interface you can import documents, search, tag, etc.\n\nThe \"add\" command allows importing or updating single documents.  The\n\"import\" command allows importing an entire bibtex databases (.bib\nfile).  If the bibtex entries include \"file\" fields (ala. Mendeley or\nJabref), then those files are retrieved, indexed, and imported as\nwell.\n\nCurses interface\n----------------\n\nThe curses interface (\"xapers show ...\") provides a simple way to\ndisplay search results and retrieve files.  Documents matching\nsearches are displayed with their bibliographic information.  Document\ntags can be manipulated, files and bibtex can be viewed, and source\nURLs can be opened in a browser.\n\nxapers-adder\n------------\n\nxapers-adder is a simple script that helps the adding of individual\ndocuments to your Xapers database.  It can be used e.g. as a PDF\nhandler in your favorite browser.  It displays the PDF then presents\nthe user with the option to import the document into Xapers.  The user\nis prompted for any sources to retrieve and any initial tags to add.\nIf the source is known, bibtex is retrieved and indexed.  The\nresulting xapers entry for the document is displayed.\n\nDevelopment of more clever import methods is highly encouraged.\n\nPython library\n--------------\n\nXapers is a python library under the hood:\n\n    >>> import xapers\n    >>> db = xapers.Database('~/.xapers/docs')\n    >>> docs = db.search('tag:new')\n    >>> for doc in docs:\n            doc.add_tags(['foo'])\n            ...\n    >>> \n\nDevelopment of new interfaces to the underlying library is highly\nencouraged.\n", 
  "read_at": 1462551832, 
  "description": "Just a clone of git://finestructure.net/xapers", 
  "id": 29491763
}