{
  "README": "Higgs-Yukawa Polynomial Hybrid Monte Carlo (HYpHMC) \n\n    A collection of C++ utilities for the investiagtion of the lattice Higgs-Yukawa model using Monte-Carlo methods. The bulk of the source code was written by P. Gerhold (arXiv:1002.2569 [hep-lat]) and J. Kallarackal. Changes were made to conform to C++ standards and add the GNU auto-tools framework by J. Bulava. \n\n1: Obtaining the Code\n\n   We use the GIT revision control system. Before obtaining the package, you \ninstall GIT, which is present in basically every package management system, or \ncan be downloaded from http://git-scm.com/. With git installed, do \n\n     git clone git://github.com/johnbulava/HYpHMC\n\nwhich will fetch the repository from github. There should now be a 'HYpHMC' \ndirectory created where you executed this command. \n\n\n2: Compiling \n\n     From the 'HYpHMC' directory, you first need to run \n\n\t\t aclocal\n\t\t autoconf \n\t\t automake --add-missing \n\nsuccessfully before proceeding. This will create the (machine-dependent) \nmakefiles on your system. Once this has been completed the standard \ncompilation chain\n\n                  ./configure \n\t          make \n\t          make install \n\ncan be performed. \n\n3: Running the code \n\n      The executables are found in the 'mainprogs' directory. To generate \nscalar field configurations, one must run `pHMC' in a directory that contains \nthe input file `SimulationParameterspHMC.txt'. A sample version of this input \nfile can be found in the `input_files' directory. The directory where pHMC is \nrun must also have a complicated subdirectory structure. This structure can be \ncreated with the following commands: \n\n\tmkdir -p dataBase/data/results/pHMC/\n\tcd dataBase/data/results/pHMC/\n        mkdir FACC configurations miscellaneous revers analysis measure     omegaFields states\n\nHopefully, this will be fixed in future revisions. The 'pHMC' executable can \nnow be run in the top dir. that contains 'dataBase'. Note: you probably want \nto make some symbolic link to a central data storage place. \n\n     Once a simulation has completed and the scalar field configurations have \nbeen generated, the 'analyzer' executable must be run in the same directory in\nwhich 'pHMC' was run, to analyze the data. The input file \n'AnalyzerToDoList.dat' must be present in this directory. Before running this, \ncreate the directories 'data' and 'pics' in this directory, and copy the \nscripts 'fixbb' and 'makePlot' from the scripts directory. \n\n     After the analysis has been completed, the measurements can be analyzed \nusing the 'evaluateConfs' executable. This requires the input file \n'EvaluateConfsToDoList.dat', which is identical to 'AnalyzerToDoList.dat', to\nbe created in the directory containing the 'dataBase' directory. \n\n     Once this has been completed, a latex summary of the results can be \nobtained by \n\n    cd dataBase/data/results/pHMC/analysis/subFolder<descriptor> \n    make \n  \n4: Adding to the repository. \n\n   Please don't be afraid to add to the repository! Especially documentation! If you have changed some files (hopefully to add documentation) do \n\n\t git commit <filename> \n\nto add these changes to the repository. If you wish to commit all changes, do \n\n   git commit -a \n\nIf you have created a new file, do \n   \n\t git add <filename> \n\t\nto add it to the repository. After adding a file, you still need to do a \n'git commit <filename>' to commit the change. Note: When moving/renaming files,\n'git commit' will delete the old files, but `git add' still must be performed \nto add the new files. Please do not add machine dependent makefiles \n(Makefile.in) to the repository. \n\nIf you have made some changes that you wish to be commited to the central \nrepository, please notify me (john.bulava@cern.ch), and I will commit them. \n\nIf you want the latest changes from the central repository do \n\n        git pull git://github.com/johnbulava/HYpHMC\n\n", 
  "read_at": 1462543325, 
  "description": "", 
  "id": 2964416
}