{
  "read_at": 1462551609, 
  "description": "introductory material", 
  "README.md": "# intro\n\nThis course will cover the basics of an exciting emerging field of statistical connectomics (aka, brain-graphs). It is so new, that we are going to make some of it up in this class! The first week will be introductory lectures that I give. The rest of the semester will be run like a seminar; each week will focus on a different topic. On Tuesdays we will hear about a statistical method that operates on graphs, and on Thursdays we will read about some neuroscience data upon which one could apply these techniques. The final project will consist of implementing a statistical method devised for graphs on a brain-graph problem. Recommended background: coursework in probability, linear algebra, and numerical programming (eg, R, Python). \n\n## course info\n\n * instructor: joshua vogelstein, jovo@cis.jhu.edu\n * TA: greg kiar, gkiar@jhu.edu\n * course website: https://github.com/openconnectome/Statistical-Connectomics-Class\n * coursework submission website: https://github.com/openconnectome/Statistical-Connectomics-Coursework\n * class times: 3-4:15pm TT\n * class location: hodson 311\n * office hours: 4:15-5:00pm TT\n * google drive containing all relevant [articles](https://drive.google.com/folderview?id=0By_9m7n8XhYKN0o4cHZNbHNWbTg&usp=sharing)\n * communal [class notes](https://docs.google.com/document/d/1YhhtP_KWaol2EsYQ7iX2oK0huT1Qi7erJ2zsX49AjC4/edit?usp=sharing)\n * Presentation [sign up form](https://drive.google.com/open?id=1F6u0Zzt11AStUJ0U3QwYg3UFNXQHcBZnC7l17dJVHCs&authuser=0)\n * gitter community [chat room](https://gitter.im/Statistical-Connectomics-Sp15/intro)\n\n## stuff that would be useful to know\n\n  * some math/stat: graph theory, basic stats & prob, optimization theory, linear algebra\n  * some neurobiology\n  * some numerical programming language\n  * git & github\n  * how to make technical presentations\n  * [Python PEP8](https://www.python.org/dev/peps/pep-0008/) Formatting \n  * Some other useful [recommendations](http://w.ocp.me/style:project)\n  * [OCAR Examples](https://drive.google.com/open?id=0B_dAuemRqBb9fjRNc2VudTN1VVoxRkVGSjAxbU10SXp2OXZPX1V1VnQxamdaZXRYcm9tUFU&authuser=0)\n  * [Nam's Thing](https://drive.google.com/open?id=0B_dAuemRqBb9YUZWcVlfQ1lWdzg&authuser=0)\n\n## useful libraries\n\n  * [igraph](http://igraph.org/) for graph analytics in R or python (which we use/develop)\n  * [FlashGraph](https://github.com/icoming/FlashGraph) for graph analytics at scale on commodity machine (which we use/develop)\n  * [scikit learn](http://scikit-learn.org/stable/) machine learning in python (our friends develop)\n\n## weekly presentations\n\n  * each week we will read 2 articles, one from neuro, one from graph-stats\n  * one person will present each article\n  * that person will create a new repo in the https://github.com/Statistical-Connectomics-Sp15/\n  * that repo will contain the article, other background reading, and the presentation\n  * i recommend latex beamer or keynote, you are free to make presentations however you like, including chalk talks\n  * these presentations are for you: reading papers, understanding them, and giving talks are all really important parts of doing science, so it is important to practice and get feedback.\n\n## homework\n\n * read the article associated with each lecture before class\n * homework will be asking >=1 questions, answering >=1 questions, and either asking or answering an additional 2 questions,  before the *next* presentation\n * each question will be its own 'issue' in the corresponding github repo, this will ease grading\n * presenter has to address each question within a week of the due date of the question by responding to issues\n * these issues and responses will be counted up.  the fraction you do in time counts for 50% of your grade.\n * these assignments are for you: thinking about the content even after it is presented can help consolidate the information in your head, it also gives you an opportunity to provide feedback to your classmates on what was clear, and what was not, so they can improve the presentation\n \n\n## Issue tracker guidelines\n\n1. **[Search the issues](https://github.com/openconnectome/Statistical-Connectomics-Class/issues)** for similar entries before submitting your own, there's a good chance somebody else had the same issue. Show your support with `:+1:` and/or join the discussion. Please submit issues in the following format (as the first post):\n1. **Summary:** Summarize your issue in one sentence (what goes wrong, what did you expect to happen)\n1. **Steps to reproduce:** How can we reproduce the issue\n1. **Expected behavior:** Describe your issue in detail\n1. **Observed behavior**\n1. **Relevant logs and/or screenshots:** Please use code blocks (\\`\\`\\`) to format console output, logs, and code as it's very hard to read otherwise.\n1. **Possible fixes**: If you can, link to the line of code that might be responsible for the problem\n\n\n## course project\n  \n  * there will be a course project due the last day possible,\n  * you will again make a github repo\n  * you will implement some statistical graph method to answer some neuroscientific problem\n  * the grading system will be: i will pull the repo, follow and necessary install instructions, and type 'make', or some such.  if code runs, figures are generated, and report is complied, you get an A for the project, which will be 50% of your grade. i recommend having your friends check before handing it in. \n\n\n## Syllabus \nfor each lecture, here i list the questions we will try to answer, and the background required background reading.\n\n\n  * 1/27: What are Brain Graphs? [Euler1735]\n   * What's a Graph? Directed? Loops? Weights?\n   * What's a Brain Vertex?\n   * What's a Brain Edge?\n   * How many graphs with n vertices?\n  * 1/29: Why do we want stats for graphs? [Goldenberg09a]\n   * Why are t-tests insufficient? \n   * Why is math with graphs hard? \n   * Why are features inadequate? \n  * 2/3: What are some random graph models? [cajal-lecture]\n   *  What is the simplest random graph model? \n   *  What is the most complicated random graph model? \n   *  What are some intermediate random graph model? \n    * Stochastic Block Model\n    * Random Dot Product Model\n    * Latent Position Model\n  * 2/5: What are attributed graphs? [mr. cap]\n   * What are edge attributes? \n   * What are vertex attributes? \n   * What are graph attributes? \n   * What are latent attributes?\n  * 2/10: How can we cluster the vertices of a graph? [Feinberg & Wasserman (1981), Holland, Laskey & Leinhardty (1983)]\n   *  What is the distribution for latent vertex attributes?\n   *  How are the RDPG & SBM related?\n   *  What is the objective function?\n   *  How do we solve it?\n  * 2/12: Statistical Decision Theory for Graphs [Snijders & Nowicki (1997), Nowicki, K., and Snijders, T. A. B. (2001)]\n   * What is the Sample Space?\n   * What is the Statistical Model?\n   * What is the Action Space?\n   * What is the Decision Function Class?\n   * What is the Loss Functional?\n   * What is the Risk Functional?\n  * 2/17: [bock11]\n  * 2/19: images-to-graphs (i2g)\n  * 2/24: Sporns05a\n  * 2/26: Hoff, P., Rafferty, A., and Handcock, M. (2002)\n  * 3/3: Varhsney et al. (2011)\n  * 3/5: you say graph invariant, i say test statistic\n  * 3/10: Presentation by Nam Lee: Wang and Bickel\n  * 3/12: Presentation by Max Collard and Jerry Wang\n  * 3/17: http://arxiv.org/abs/1407.4137 (Automatic discovery of cell types and microcircuitry from neural connectomics)\n  * 3/19: http://arxiv.org/abs/1310.0532 (Perfect Clustering for Stochastic Blockmodel Graphs via Adjacency Spectral Embedding), and http://arxiv.org/abs/1309.4111 \n  * 3/24: Stochastic Blockmodeling of the Modules and Core of the Caenorhabditis elegans Connectome\n   * HW: due 3/26; 2q+2a\n  * 3/26: A multivariate distance-based analytic framework for connectome-wide association studies\n   * HW: due 4/2; project proposal\n  * 3/31: workshopping (chatting about proposals)\n  * 4/2: Effective Data Mining using Neural Networks () presented by Alan\n   * HW: due 4/2: 2q+2a\n  * 4/7:  Hebbian phase sequences (Almeida-Filho) presented by William, Duo, and Erika\n   * HW: due 4/9: 2q+2a\n  * 4/9:  Dense inhibitory connectivity (Fino) presented by Ally and Rohit\n   * HW: due 4/14; redefining edges and nodes in a graph \n  * 4/14: Graph Matching presented by Jason Matterer\n   * HW: due 4/16; 2q+2a \n  * 4/16: Connectomics for Brain Disease (Bullmore) presented by Sandya, Sandra, and Indigo\n   * HW: due 4/21; 2q+2a\n  * 4/21: Graph Classification Using Signal-Subgraphs: Applications in Statistical Connectomics (Vogelstein), presented by Elan and Austin\n   * HW: due 4/23; 2q+2a\n  * 4/23: Loopy Curvilinear Stuctures presented by David and Michael\n  * 4/28: Network dynamics of the brain and influence of the epileptic seizure onset zone (Burns) presented by Michele Lohr and Allen Kim\n  * 4/30: Hierarchical stochastic block models by Vince Lyzinski\n  \n  \n", 
  "id": 29850318
}