{
  "read_at": 1462551700, 
  "description": "A RAVEN II Simulator (works with no robotic hardware)", 
  "README.txt": "======================================\nSummary and licensing information\n======================================\nThis code is for RAVEN II surgical simulator. It is based on the open-source RAVEN II control software, developed by the University of Washington Biorobotics lab at: https://github.com/uw-biorobotics/raven2/tree/indigo. It enables running RAVEN control software with no robotic hardware attached.\n\nA Python script (Real_Packet_Generator_Surgeon.py) mimicks the network packets sent from the surgeon console based on a previously collected data from the trajectory of a basic surgical task. A 3D visualization tool for ROS (rviz package) is used for 3D animation of the robotic motions. \nFor more information, please see: http://web.engr.illinois.edu/~alemzad1/papers/MedicalCPS_2015.pdf\nhttp://arxiv.org/abs/1504.07135v1\n\nCopyright (C) 2015 University of Illinois Board of Trustees, DEPEND Research Group\nHoma Alemzadeh, Daniel Chen, Abishek Krishnamoorthy (rviz), and Xiao Li (dynamic models) \n\nThis program is free software: you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program.  If not, see <http://www.gnu.org/licenses/>.\n\n======================================\nHow to run\n======================================\nSetting up the repository:\n1. After downloading the repository, rename the folder to \"raven_2\"\n2. Change the ROS_PACKAGE_PATH environment variable to the location of raven_2 folder\n4. Run \"tar zxvf ./teleop_data/new_test_data.tgz\" to unzip the datafiles used by the packet generator\n\nRunning RAVEN simulator\n1. Goto raven_2 folder:  \"roscd raven_2\"\n2. Simple simulator:     \"python run.py sim 1 none\"\n   Dynamic simulator:    \"python run.py dyn_sim 1 none\"\n   Robot /w packet-gen:  \"python run.py rob 1 none\"\n   Robot /w surgeon-gui: \"python run.py rob 0 none\" \n", 
  "id": 29894070
}