{
  "read_at": 1462551786, 
  "description": "cTuning min datasets for shared benchmarks", 
  "README.md": "Minimal data sets used for autotuning and co-design in computer engineering\n===========================================================================\n\nVarious public data sets for public bechmarks and kernels used\nin our research on universal and multi-objective autotuning/crowd-tuning.\nIt is possible to reproduce and extend some techniques from our recent papers:\n\n* http://arxiv.org/abs/1506.06256\n* http://hal.inria.fr/hal-01054763\n* https://hal.inria.fr/inria-00436029\n* http://arxiv.org/abs/1407.4075\n\nOur eventual goal is to gradually release all our artifacts (code and data)\nto help community reproduce and extend this research.\n\nStatus\n======\nStable reprository\n\nDependencies on other repositories\n==================================\n* ctuning-programs\n* ck-autotuning\n* ck-env\n\nAuthors\n=======\n\n* Grigori Fursin, cTuning foundation (France) / dividiti (UK)\n* Various authors of shared programs (see individual entries)\n\nPrerequisites\n=============\n* Collective Knowledge Framework: http://github.com/ctuning/ck\n\nInstallation\n============\n\n> ck pull repo:ctuning-datasets-min\n\nList of other CK data set repositories shared as zip\n====================================================\n\nIt is possible to share CK repositories as zip archives (useful to share artifacts along with publications and add them as supplementary material for ACM Digital Library, for example). Such repositories can be installed via\n\n> ck add repo:[repo_name] --zip=[zip archive name or full URL] --quiet\n\nWe shared multiple repositories with thousands of data sets for our shared benchmarks via Google Drive:\n\n* https://drive.google.com/folderview?id=0B-wXENVfIO82dzYwaUNIVElxaGc&usp=sharing \n\nFor example, you can download ckr-ctuning-datasets.zip \n(or other and much larger datasets ckr-usb-ctuning-dataset-* from our PLDI paper).\n\nRegister it with CK simply via:\n\n> ck add repo:ctuning-datasets --zip=ckr-ctuning-datasets.zip --quiet\n\nNow, when you run shared cTuning benchmarks (programs), \nyou will automatically have an extended choice of data sets.\n\nIf you want to compile and run our benchmarks on Android-based mobile phones,\nyou need to download and register with CK Android NDK as described here:\n* https://github.com/ctuning/ck/wiki/Getting_started_guide_tools\n\nList of other CK data set repositories shared via BitTorrent\n============================================================\n\nWe share some large CK repositories in zip via BitTorrent to optimize sharing (upload and download) of such repositories across multiple users. We use the following file name convention for such repositories: ckr-<repo></repo>-YYYYMMDD.zip.\n\n* ckr-32332f6412da1be1-20150803.zip (~287Mb) - Data sets (MiDatasets and cDatasets) from our past R&D to crowdsource autotuning and benchmarking (crowd-tuning and crowd-benchmarking). Get torrent here: https://github.com/ctuning/ck-guide-images/blob/master/ckr-32332f6412da1be1-20150804.zip.torrent?raw=true\n", 
  "id": 29987672
}