{
  "read_at": 1462552073, 
  "description": "Test any Z' model against LHC data", 
  "README.md": "# <img src=icons/logotype.png width=325 height=187 /> \n\nZPriMATE -- Z Prime Models At Terascale Energies\n\n\n#Obtaining ZPriMATE\n-----------------------\n\nFirst and foremost, it has to be pointed out that ZPriMATE is work in progress and so far only a minimal working \npre-release version for dilepton final states exists. At this stage, sources are available only from a public \ngit\nrepository at https://github.com/PatFo/ZPriMATE.git\n\n\n##Prerequisites\n-------------------------\n\nZPriMATE has been developed for the UNIX systems  Linux and OS X and hast been tested on the following systems:\n\n- Debian 8.1 (Jessie)\n- Ubuntu 14.04 LTS (Trusty Tahr)\n- Ubuntu 15.04 (Vivid Vervet)\n- OS X 10.9 (Mavericks)\n- OS X 10.10 (Yosemite)\n\nThe program package was designed to be as self-contained as possible. However, there are some \ndependencies \nthat are required for installing and running ZPriMATE:\n\n\n- **C/C++ Compiler**: The package needs an installed version of the g++ or clang compiler.\n- **Python 2.7**: Python 2.7.3 is the minimum required version.  Additionally the following Python packages are \nneeded\n  - Numpy \n  - Scipy\n  - Matplotlib\n\n\n\nDuring configuration of ZPriMATE, the presence of all dependencies is inquired. If \nany dependencies are missing, an error is thrown and the user is informed of the absence of the  missing prerequisite.\n\n#Installation\n\n##Obtaining sources with git\n-------------------------\n\nThe most convenient and platform independent way to obtain a copy of ZPriMATE is to clone the git repository. \nIf git is installed on the machine, it is sufficient to run the following command in a terminal\n```\n$ git clone https://github.com/PatFo/ZPriMATE.git\n```\nThis will create a subdirectory called ZPriMATE in the directory where you have issued the command. \n\n##Obtaining sources without git\n-------------------------\nIf git is not installed, one can obtain a copy of the master branch from the github mirror.\n\nOn Linux:\n```\n$ wget https://github.com/PatFo/ZPriMATE/archive/master.tar.gz -O - | tar xz\n```\nOn OS X:\n```\n$ curl -Lk https://github.com/PatFo/ZPriMATE/archive/master.tar.gz | tar xz\n```\nIssuing one of those commands create a subdirectory called ZPriMATE-master. \nBuilding\n\nOnce the source files have been obtained, installation works  as usual\n```\n$ cd ZPriMATE(-master)\n$ ./configure [--prefix=<install-path>]\n$ make \n$ make install\n```\nThe optional '--prefix' variable allows to specify an installation path. The default path is \n'/usr/local'. Depending on where you install ZPriMATE to, you might be asked to set up the program properly by \nrunning\n```\n$ source setup.sh\n```\n\n#The program structure\n---------------------------------\n\nZPriMATE was designed as a modular program package implemented in a hybrid Python/C++ approach. The input the user has to provide essentially consists\nof the model characterized by a set of model parameters and a LHC analysis that the model shall be tested \nagainst. The input is passed to the  C++ core application (*Core*) that calculates the semi-analytical \ncross section and turns it into a prediction of the signal events s_i. The signal prediction and the analysis are \nthen passed on to a Python routine  (*Limit Calculator*) responsible for the statistical evaluation and \nthe determination of the *R*-value. Based on the determined *R*-value, a model can be excluded or not. \nA second Python routine  (*Plotter*)  plots the  calculated signal prediction s_i. \nIn the following section, the individual parts of ZPriMATE are described in more detail.\n\n\n##Input\n-------------------\n\nZPriMATE is a command line tool that is invoked after successful installation  by running \n```\n$ zprimate <settings/file/path>\n```\n\n```\n      //Minimal settings file example\n      //-----------------------------\n\n      //PROGRAM PARAMETERS\n      // $VERBOSE       = 1\n      // $ACC           = 1e-2\n      // $ODIR          = <outdir>\n      // $PDF           = mstw/grid/mstw2008lo.00.dat\n\n\n      //SPECIFY MODEL FILE OR SET MASS OF Z_SSM\n      // $MODEL         = example/example.conf\n      $MODEL         = 2000\n\n\n      //ANALYSIS PARAMETERS\n      $PROC          = 1\n      $EBEAM         = 8000\n      $LUM           = 20.3  \n      $BINS          = analyses/arXiv_1405_4123/bins.dat\n      $EFFICIENCIES  = analyses/arXiv_1405_4123/eff_el.dat\n      $LIMITS        = analyses/arXiv_1405_4123/el_lims\n```\nIt needs as input parameter the path to a valid settings file, which contains the main parameters needed for running. A minimum example file is shipped with the ZPriMATE package and is \nfound under\\\\\n($ZPriMATE)/example/settings. In essence, the parameters can be grouped into three blocks. The first block \nof program parameters  concerning the \nrun behavior of ZPriMATE is optional and will not be discussed here.\n\n###Model parametrization\n \n The second block consists of a single variable called $MODEL. This variable can take two types of values:\n \n- A floating point number: If a single number is specified the program automatically chooses the SSM as the \ntested model and interprets the number as the mass M_{Z'_{SSM}} of the SSM Z'. \n- A string: Alternatively the variable can be assigned a path to a full model file defining all model parameters.\n\n```\n---------------------------------------\n---------------------------------------\n\nMODEL PARAMETERS:\n\n---------------------------------------\n---------------------------------------\n\n$GENERAL\nmzp =1000 # Mass \ngx = 0.1 # Gauge coupling\nchi = 1.1 # kinetic mixing\nwhid = 100 # hidden width\ndm = 200 # bare mass mixing (not yet supported)\n$END\n\n$DOWNL\n0.1 # dd~ coupling\n0.1 # ss~\n0.1 # bb~\n0.0 # ds~ / sd~\n0.0 # db~ / bd~\n0.0 # sb~ / bs~\n$END\n```\n###LHC Analysis\n\nThe last block of parameters in the settings file are the analysis parameters. The information that ZPriMATE needs for \nrunning is\n\n- $PROC: The final state id (1=dielectron, 2=dimuon)\n- $EBEAM: The center of mass energy $\\sqrt{s}$ in GeV\n- $LUM: The integrated luminosity $L$ at which data has been taken in fb$^{-1}$\n- $BINS: The file containing the bins of invariant mass used in the anlaysis\n- $EFFICIENCIES: The file containing acceptance $\\times$ efficiency of selected final state\n- $LIMITS: The directory containing the limitfiles\n\nSo far, one ATLAS analysis for \ndilepton resonances at $\\sqrt{s}=8$ TeV ([arXiv](http://arxiv.org/abs/1405.4123)) has been implemented. The corresponding files are part of \nthe ZPriMATE package and are stored under ($ZPriMATE)/analyses/arXiv_1405_4123}. \n", 
  "id": 30452709
}