{
  "read_at": 1462552107, 
  "description": "", 
  "README.md": "# Description\nPRAgMaTIc (Parallel anisotRopic Adaptive Mesh ToolkIt) provides 2D/3D\nanisotropic mesh adaptivity for meshes of simplexes. The target\napplications are finite element and finite volume methods although\nit can also be used as a lossy compression algorithm for 2 and 3D data\n(e.g. image compression). It takes as its input the mesh and a metric\ntensor field which encodes desired mesh element size\nanisotropically.\n\nThe toolkit is written in C++ but also provides interfaces for Fortran. It \nhas been integrated with [FEniCS/Dolfin](http://fenicsproject.org) and\nintegration with PETSc/DMPlex is planned.  One of the design goals of PRAgMaTIc\nis to develop highly scalable algorithms for clusters of multi-core and\nmany-core nodes. PRAgMaTIc uses OpenMP for thread parallelism and MPI for\ndomain decomposition parallelisation.\n\n# Publications\n*A thread-parallel algorithm for anisotropic mesh adaptation*\nUnder review: [arXiv:1308.2480](http://arxiv.org/abs/1308.2480)\n\n*Hybrid OpenMP/MPI anisotropic mesh smoothing*\nDOI: [10.1016/j.procs.2012.04.166](http://dx.doi.org/10.1016/j.procs.2012.04.166)\n\n*Accelerating Anisotropic Mesh Adaptivity on nVIDIA's CUDA Using Texture Interpolation*\nDOI: [10.1007/978-3-642-23397-5_38](http://dx.doi.org/10.1007/978-3-642-23397-5_38)\n\n# Build\n$ cmake .\n$ make\n\n# Testing\n$ make test\n\n# Install\nIf you want to install to a specific location then specify the\nargument --prefix=/target_location for ./configure. The default\nlocation is /usr/local.\n\n$ make install\n\n# RPM\nA RPM spec file is provided in the source root directory. Typically\nyou need to create a tar ball of the source directory and then execute\nrpmbuild, e.g.:\n\n$ rpmbuild -ta pragmatic-0.1.tar.gz \n\nSee rpmbuild documentation for more details.\n\n# DEBIAN\n\nA Debian package is provided. To build a deb simply cd to the source\ndirectory and execute:\n\n$ dpkg-buildpackage -us -uc\n", 
  "id": 30672132
}