{
  "read_at": 1462552136, 
  "description": "MC-SPAM is an algorithm to generate limb-darkening coefficients from models that are comparable to transit photometry according to the formalism described in Espinoza & Jordan (2015)", 
  "README.md": "# mc-spam\n\nMC-SPAM (Monte-Carlo Synthetic-Photometry/Atmosphere-Model) is an algorithm to generate limb-darkening coefficients \nfrom models that are comparable to transit photometry according to the formalism described in Espinoza & Jordan (2015), \nwhich improves the original SPAM algorithm proposed by Howarth (2011) by taking in consideration the uncertainty on \nthe stellar and transit parameters of the system under analysis.\n\nIf you use this code for your research, please consider citing Espinoza & Jordan (2015; http://arxiv.org/abs/1503.07020).\n\nDEPENDENCIES\n------------\n\nThis code makes use of three important libraries:\n\n        + Numpy.\n        + Scipy.\n        + Pyfits.\n\nAll of them are open source and can be easily installed in any machine.\n\nINSTALLATION\n------------\n\nBecause this code uses transit modelling to obtain the MC-SPAM limb-darkening coefficients, it needs an implementation \nof the Mandel & Agol (2002) transit modelling in order to run. For this, a Fortran implementation of the code is under \nthe \"main_codes\" folder, which in turn is called by our Python routines. In order for this link to be made, you \nneed to \"install\" the package by simply running:\n\n\t\tpython install.py\n\nWhich will automatically generate the needed files for the transit code to run.\n\nUSAGE\n-----\n\nIn order to run, the code needs to know the following parameters of a given system:\n\n        p:              The planet-to-star radius ratio, Rp/R_*.\n\n        i:              The inclination of the orbit (in degrees).\n\n        aR:             The semi-major axis to stellar radius ratio (a/R_*)\n\n        e:              The eccentricity of the orbit.\n\n        omega:          The argument of periastron (in degrees).\n\n        Teff:           Effective temperature of the host star (in Kelvins)\n\n        logg:           Log-gravity of the host star.\n\n        MH:             Metallicity of the host star (~[Fe/H]).\n\n        vturb:          Microturbulent velocity of the host star (in km/s).\n\n\nThese parameters can be either estimated, in which case you need the associated uncertainties, \nfixed or obtained through an MCMC chain. If you have any data for your system that was estimated \nby previous works (or from you and for which you do not have an MCMC chain), you must input it \nunder the \"estimated_parameters\" folder; the \"planet_data.dat\" stores the parameters of the transit, \nwhile \"star_data.dat\" stores the parameters of the host star (note that the names of both systems \nmust match; see the files for example inputs). If a parameter is fixed by some reason, fix their \nupper and lower errors to zero. \n\nIf you want to use an MCMC chain for a given parameter, input any value for that parameter \nin the above mentioned files and modify the \"get_mcspam_vals.py\" file in order to input \nyour MCMC chains (see the example under lines 76 to 83 of the \"get_mcspam_vals.py\" code).\n\nAfter all of the above is set, you can edit the options in the top part of the \n\"get_mcspam_vals.py\" file and run it by simply doing:\n\n\t\tpython get_mcspam_vals.py\n\nThis will then generate the MC-SPAM estimates of the model limb-darkening coefficients.\n\nOUTPUTS\n-------\n\nThe program will generate an output folder with a user-defined name (the default is \"results\"), \nin which a folder for each system will be created along with a mc_spam_results.dat file that \nwill contain the 0.16, 0.5 and 0.84 quantiles (i.e., the median and the \"1-sigma\" errors) of \nthe distribution of both the model and the MC-SPAM estimates of the limb-darkening coefficients. \nInside each folder, the Monte-Carlo samples of both the original model and the estimated MC-SPAM \nlimb-darkening coefficients will be saved as FITS files. \n\n", 
  "id": 30924289
}