{
  "read_at": 1462552094, 
  "description": "Public repository for LASAGNA", 
  "README.txt": "i) About LASAGNA\r\nThis is a small note describing the installation of the code LASAGNA.\r\nLASAGNA was developed by Thomas Tram and Rasmus Sloth Hansen for solving\r\nthe Quantum Kinetic Equations for sterile neutrinos in the early Universe.\r\nHowever, one can also see LASAGNA as a generic differential equation \r\nsolver suited for large, stiff systems. If you use this code in a\r\nscientific publication, please cite the paper\r\n\r\narXiv:1302.7279\r\n\"Can active-sterile neutrino oscillations lead to chaotic behavior of \r\nthe cosmological lepton asymmetry?\"\r\n\r\nThe appendix of this paper also describes some of the algorithms involved,\r\nalthough not in great detail. If you depend on SuperLU for obtaining your \r\nresults, you must also cite the two SuperLU_MT_2.0 papers. \r\n(See arXiv:1302.7279 or the SuperLU homepage for the references)\r\n\r\nThe overall structure of the code, some of the macros and the parser for\r\nreading input files are adopted (with permission) from Julien Lesgourgues' \r\nBoltzmann code CLASS (http://class-code.net/).\r\n\r\nii) Installation\r\nIf you do not want to use SuperLU:\r\nSearch for \"use_superlu\" in the Makefile and set it to \"no\".\r\nThen, choose the C-compiler and corresponding compiler flags of your \r\nchoice.\r\nwrite make and you are done\r\nYou can run the code by writing\r\n./lasagna parameters.ini\r\n\r\nIf you plan to use SuperLU:\r\nDownload SuperLU_MT_2.0 from \r\nhttp://crd-legacy.lbl.gov/~xiaoye/SuperLU/#superlu_mt\r\nand extract it to some directory of your choice.\r\nCopy the file \"SuperLUpatch.tar.gz\" from the LASAGNA root directory\r\nto the SuperLU root directory and extract it. It overwrites a few files,\r\nmost notably \"make.inc\" in the root of the SuperLU directory. If you use\r\nIntel compiler suite and MKL, you should not need to change this file,\r\notherwise you might need to.\r\nwrite make to compile the SuperLU_MT library. Beware that on some systems\r\nthe SuperLU tests generate segmentation faults when they are executed by\r\nthe Makefile. These faults can be ignored, the library works well. (If it\r\nmakes you nervous, execute the test scripts manually after make is complete.)\r\n\r\nNow edit the Makefile in the LASAGNA directory:\r\nSearch for \"use_superlu\" in the Makefile and set it to \"yes\",\r\nand write the correct path for the SuperLU directory.\r\nwrite make and you are done\r\nYou can run the code by writing\r\n./lasagna parameters.ini\r\n\r\niii) Trouble shooting\r\nSuperLU contains a single file which is a symbolic link,\r\n/SuperLU_MT_2.0/TESTING/MATGEN/slu_mt_Cnames.h\r\nIf you are on a filesystem that does not support symbolic links\r\n(For instance VirtualBox shared folder), you have to make a hard copy\r\nof this file from /SuperLU_MT_2.0/SRC/slu_mt_Cnames.h.\r\n\r\nThe maximal amount of memory used by SuperLU must be set manually, and \r\na too low or a too high value might result in a segmentation fault.\r\nThe amount of allocated memory can be increased by changing case 6, 7 \r\nand 8 in SRC/sp_ienv.c on line 114 to 116. A value of (-100) was found\r\nappropriate for vres=3200 while (-200) was needed for vres=6400.\r\nRemember to recompile SuperLU after applying the changes.\r\n\r\niv) Bug reports\r\nPlease write any bug reports and comments to\r\nrshansen@phys.au.dk or\r\ntram@phys.au.dk\r\nalso feel free to ask about how to use the code, since a user guide \r\nis obviously missing. (If we get lots of emails we will probably be \r\nmotivated for writing one.)\r\n", 
  "id": 30963824
}