{
  "read_at": 1462552092, 
  "description": "", 
  "README.md": "ANAA-Dementia\n===================\n\nANAA-Dementia: Analysis of Narratives based on techniques of Automatic Alignment to support the Diagnosis of Dementia\n\nReferences\n----------\n\nMoore, Robert C. \"A discriminative framework for bilingual word alignment.\" Proceedings of the conference on Human Language Technology and Empirical Methods in Natural Language Processing. Association for Computational Linguistics, 2005.\n\nPrud'hommeaux, Emily T., and Brian Roark. \"Graph-based alignment of narratives for automated neurological assessment.\" Proceedings of the 2012 Workshop on Biomedical Natural Language Processing. Association for Computational Linguistics, 2012.\n\nYao, Xuchen, et al. \"A Lightweight and High Performance Monolingual Word Aligner.\" ACL (2). 2013.\n\nTamura, Akihiro, Taro Watanabe, and Eiichiro Sumita. \"Recurrent neural networks for word alignment model.\" Proceedings of EMNLP. 2014.\n\nBahdanau, Dzmitry, Kyunghyun Cho, and Yoshua Bengio. \"Neural machine translation by jointly learning to align and translate.\" arXiv preprint arXiv:1409.0473 (2014).\n\nAbstract\n----------\n\nContext: Increased life expectancy, provided by developments in medicine and improvements in quality of life, has also caused an increase in neurodegenerative disease rates in the elderly. Among the various types of dementia, Alzheimer's Disease (AD) is one of the most prominent, representing 50-75% of the cases. Another disease that has received attention in recent years is Mild Cognitive Impairment (MCI), considered a pre-clinical condition of AD, and thus of important early diagnosis. For the identification of dementia and other related diseases, tests are used to assess cognitive function and linguistic aspects. Some of these tests use narrative retellings as subtests. Gap: However, the main difficulty in the use of narratives is its demand of time, since it is usually a manually applied task that depends on the subjective assessment of a reviewer. Thus, the use of computational methods is necessary to both widen the use of this task, and to maintain the uniformity of alignment in a longitudinal analysis, for example. Objective: The goal of this doctoral project in the area of Natural Language Processing (NLP) applied to the medical field is the evaluation of methods to automate the Portuguese narrative retelling exam of the Arizona Battery for Communication Disorders in Dementia (ABCD). This research is about an NLP task called Automatic Monolingual Alignment, and its results may also be applied to other batteries that use retellings as an analysis tool, such as the Montreal Battery Communication Evaluation, and a subtest of the Wechsler Memory Test Logic I and II, in addition to other NLP tools and systems. Methods and Evaluation: Word alignment methods will be used, and a comparative study between generative, discriminative, and neural-network based methods will be carried out. The evaluation is based on the Alignment Error Rate and the F-measure metrics, comparing the aligners on the monolingual alignment task. Conclusion: This project will enhance collaboration between two USP units - ICMC and FMUSP - in the areas of NLP and neuroscience, will expand our understanding of episodic memory and attention, and will benefit the Automatic Monolingual Alignment research topic for the Portuguese language, since there is no research in this subject for this language.\n\nRequirements\n----------\n\nPython libraries:\n\n1. NLTK-3.0.1.\n2. numpy-1.9.2.\n3. python-Levenshtein-0.12.0.\n4. scipy-0.15.1\n5. OpenNLPTagger.\n6. deap-1.0.1.\n", 
  "id": 31269506
}