{
  "read_at": 1462552105, 
  "description": "mirror of Vanessa Wei Feng's RST-style discourse parser (Version 1.01 and 2.01)", 
  "README.txt": "DEVELOPERS\n~~~~~~~~~~~~~~~~~~~~\n* Vanessa Wei Feng\n  Department of Computer Science\n  University of Toronto\n  Canada\n  mailto:weifeng@cs.toronto.edu\n\n\n\nREFERENCES\n~~~~~~~~~~~~~~~~~~~~~~\n* Vanessa Wei Feng and Graeme Hirst, 2014. Two-pass Discourse Segmentation with Pairing and Global Features. arXiv:1407.8215v1. http://arxiv.org/abs/1407.8215\n\n* Vanessa Wei Feng and Graeme Hirst, 2014. A Linear-Time Bottom-Up Discourse Parser with Constraints and Post-Editing. In Proceedings of the 52th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies (ACL-2014), Baltimore, USA. http://aclweb.org/anthology/P14-1048\n\n\n\nGENERAL INFOMRATION\n~~~~~~~~~~~~~~~~~~~~~~\n* This RST-style discourse parser produces discourse tree structure on full-text level, given a raw text. No prior sentence splitting or any sort of preprocessing is expected. The program runs on Linux systems.\n\n* The overall software work flow is similar to the one described in our paper (ACL 2014). However, to guarantee further efficiency, we remove the post-editing component from the workflow, and remove the set of entity-based transaction features from our feature set. Moreover, both structure and relation classification models are now implemented using CRFSuite.\n\n\n\nDEPENDENCIES\n~~~~~~~~~~~~~~~~~~~~~~\nYou need to install the following third-party software first:\n\nIn order to run the software, you need to have the following components:\n1. Python 2.7.\n2. NLTK 2.0b9 (newer versions will not work because of the different interfaces in the tree modules).\n3. Java\n4. gcc\n5. Perl\n\n* The Stanford syntax parser is already included in this package. However, please do not try to replace the provided package with newer versions, since compatibility is not guaranteed in this case.\n\n\n\nSETUP CRFSUITE\n~~~~~~~~~~~~~~~~~~~~~~\nThe $gCRF_ROOT$ symbol in the commands below stands for the root directory of gCRF.\n\n1. Test if the binary file of CRFsuite-stdin is ready for use, by executing the following two commands:\ncd $gCRF_ROOT$/tools/crfsuite/\ncrfsuite-stdin tag -pi -m ../../model/tree_build_set_CRF/label/intra.crfsuite test.txt\n\nIf the following lines are printed, then the binary is usable on your platform, and thus you can skip the next step and go to the USAGE section:\n@probability    0.003834\nLEAF:0.063409\nElaboration[N][S]:0.958434\nLEAF:0.060318\n\n2. If the test in the Step 1 fails, you need to build the binary from source codes. To do so, you need to do the following three things:\na. Build LibLBFGS\n   cd $gCRF_ROOT$/tools/crfsuite/liblbfgs-1.10\n   ./configure --prefix=$HOME/local\n   make\n   make install\n\nb. Build CRFsuite-stdin\n   cd $gCRF_ROOT$/tools/crfsuite/crfsuite-0.12\n   ./configure --prefix=$HOME/local --with-liblbfgs=$HOME/local\n   make\n   make install\n\nc. Copy the crfsuite binary under $HOME/local/bin to tools/crfsuite and rename it as crfsuite-stdin\n   cp $HOME/local/bin/crfsuite $gCRF_ROOT$/tools/crfsuite/crfsuite-stdin\n   chmod +x ../crfsuite-stdin\n\nNow repeat the test in Step 1 and see if it works now.\n\n\n\nSOFTWARE USAGE\n~~~~~~~~~~~~~~~~~~~~~~\nUsage: parse.py [options] input_file/filelist\n\nOptions:\n  --version             show program's version number and exit\n  -h, --help            show this help message and exit\n  -v, --verbose         verbose mode\n  -s, --skip_parsing    Skip parsing, i.e., conduct segmentation only.\n  -D, --filelist        parse all files specified in the filelist file, one\n                        file per line.\n  -t, --output_dir      Specify a directory for output files.\n  -g, --global_features\n                        Perform a second pass of EDU segmentation using global\n                        features.\n  -l, --logging         Perform logging while parsing.\n  -e, --save            Save preprocessed document into serialized file for\n                        future use.\n\n     1) To produce the discourse parse tree for a single file, do the following:\n         python parse.py -t test ../texts/wsj_0607.out\n\n         If you omit the -t option, the result will be written to \"$gCRF_ROOT$/texts/results\", otherwise, it will create a sub-folder under \"$gCRF_ROOT$/texts/results\". So for the command above, the result \"wsj_0607.out.tree\" will appear in \"$gCRF_ROOT$/texts/results/test/\".\n\n     2) To produce discourse parse trees for a batch of files, do the following, where filelist is the name of the file where you store the absolute path of each file that you wish to process (one file per line):\n         python parse.py -tD test_batch filelist\n\n\t And the results will appear in \"$gCRF_ROOT$/texts/results/test_batch/\".\n\n     3) To enable two-pass segmentation (see our arXiv paper), use the -g option, in conjunction with other options (if any). However, enabling this option would largely slow the segmentation, but with higher segmentation accuracy.\n\n\n     4) To enable logging while processing texts, use the -l option. In this way, the time spent on preprocessing, segmentation, and parsing will be recorded individually.\n         For example, for the sample text, its log will look like the following:\n         ***** Parsing ../texts/wsj_0607.out...\n         Finished preprocessing in 2.99 seconds.\n         Finished segmentation in 1.07 seconds. Segmented into 15 EDUs.\n         Finished tree building in 0.52 seconds.\n         ===================================================\n\n     5) You may save a (partially) processed document to as a binary file, by using the -e option. This is particularly useful for processing large documents, as you might not want to repeat the preprocessing part (i.e., syntactic parsing, etc.), but wish to explore some different parsing configurations. There are three places where the serialized data will be saved: after preprocessing, after segmentation, and after discourse parsing.\n\n\n\nTROUBLESHOOTING\n~~~~~~~~~~~~~~~~~~~~~~\n* It seems that newer version of NLTK has a different interface for its tree objects. Our implementation was based on NLTK 2.0b9. So if you're experiencing with errors reported such as \"'function' object has no attribute 'parent'\", please either replace your NLTK version with 2.0b9, or go through the source codes under src/ folder, adding brackets to all *.parent, *.left_sibling, *.right_sibling, *.root, *.treepos, *.treepositions. (e.g., *.parent becomes *.parent())\n\n* We have included a script, santiy_check.py, to test a few key dependent components (CCGSsplitter, Stanford parser, and CRFSuite) of the tool. You may run the script for a quick diagnosis.\n\n\n\nBUGS AND COMMENTS\n~~~~~~~~~~~~~~~~~~~~~~\nIf you encounter and bugs using the program, please report the exception thrown by the program and the specific text file(s) you used for parsing, to weifeng@cs.toronto.edu. General comments about the program and the results are also welcome!", 
  "id": 31269082
}