{
  "read_at": 1462552047, 
  "description": "Topological inference of horizontal evolution from multiple sequence alignments", 
  "README.md": "# TARGet\n\nTARGet is a light-weight application for reconstructing non-vertical \nevolutionary histories from sampled genetic sequences. It makes use \nof persistent homology, a tool from topological data analisys, \nto infer information about the minimal set of reticulate events \n(recombination, re-assortment, etc) that are needed to explain a \nsequence alignment, under the assumption of no convergent evolution. \n\nIt requires the following free software in the system:\n\n- Python 2.7 (Python 3 is currently not supported.)\n- CMake\n- Boost C++ libraries, including Boost.Python\n- NetworkX package for Python.\n\nFor optimal visualization results it is recommended to have Graphviz \ntools and PyGraphviz installed, although they are not strictly required.\n\nOnce the above dependences are installed in the system, unpack and \nbuild TARGet by typing the following commands in a terminal:\n\n`tar -xvzf TARGet.tar.gz`\n\n`cd TARGet`\n\n`mkdir build`\n\n`cd build`\n\n`cmake ..`\n\n`make`\n\n* On Mac OSX, CMake often has issues finding the correct python path. \nIf that is the case, uncomment the following three lines in file \n`CMakeLists.txt`, replacing the directories for the appropriate ones \nin your system,\n\n`set        (PYTHON_EXECUTABLE /usr/local/bin/python2.6)`\n\n`set        (PYTHON_INCLUDE_DIR /usr/local/include/python2.6)`\n\n`set        (PYTHON_PATH /usr/local/lib/libpython2.6.dylib)`\n\nand run cmake and make again.\n\n* Some compiler versions may raise the following error:\n\n`error: unrecognized command line option \"-ftemplate-depth=256\"`\n\nIf that is the case, replace the following line in `CMakeList.txt`,\n\n`add_definitions             (-ftemplate-depth=256)`\n\nby,\n\n`add_definitions             (-ftemplate-depth-256)`\n\nand run cmake and make again.\n\n* It is important to run TARGet using the same version of Python that \nwas used to compile TARGet and Boost libraries.\n\nTARGet executable is in directory TARGet. You can check that TARGet \nhas been correctly installed by running it on any of the test or the \nexample FASTA files that come with the distribution, e.g.:\n\n`./TARGet test.fa`\n\nor\n\n`python TARGet test.fa`\n\nA detailed description of TARGet is found in the file `docs/Manual.pdf`.\n\nTARGet is distributed under the GNU General Public License (GPL v3). A\ncopy of license is included in the file `Copying.txt`. \n\nThis program heavily relies on [Dmitriy Morozov's Dionysus C++ library](http://www.mrzv.org/software/dionysus/) for persistent homology \ncomputations, the relevant parts of which are distributed together \nwith TARGet also under the terms of GPLv3 license.\n\nIf you use TARGet in your research, please include in your reference \nlist the following publication:\n\n##### Camara, P.G., Levine, A.J. and Rabadan, R. (2015), \"Inference of ancestral recombination graphs through topological data analysis\". [arXiv:1505.05815](http://arxiv.org/abs/1505.05815).\n", 
  "id": 31333340
}