{
  "read_at": 1462543276, 
  "description": "An annotated and lightly edited version of Mikhail Peslyak's paper, \"Model of pathogenisis of psoriasis\"", 
  "readme.md": "# What is this project? #\nAn attempt to make sense of a very interesting paper on [Psoriasis](http://en.wikipedia.org/wiki/Psoriasis) called \"[Model of pathogenesis of psoriasis](http://arxiv.org/abs/1110.0584)\", published first in Russian, and then in English.\n\nThe online version of these notes can be accessed [here](http://canadaduane.github.com/peslyak-psoriasis-paper/Peslyak-P1.html).\n\n## Is it a retranslation? ##\nNot really. While I have taken editorial liberties in making certain places sound more like colloquial English, I'm not really attempting a retranslation. For starters, I don't know Russian. And secondarily, I don't know the author. Rather, I want to be more of a student of Mikhail Peslyak's paper, and so this project is an attempt to understand enough of his paper so that I can make sense of it, and perhaps help anyone who has psoriatic symptoms (e.g. arthritic, epidermic, or otherwise).\n\n## What's your background? ##\nI don't have a degree in microbiology. In fact, I'm not a biologist. I'm a software developer. But I have taken classes in biology, microbiology and bioinformatics, so I have a very basic knowledge of concepts. The web is a wonderful thing, however, and I'm confident that I will be able to get through this paper with the help of external resources (Wikipedia, the apple of my eye--I donated to you last year!)\n\n## Can I contribute? ##\nOf course! If you care about this subject and are self-motivated, feel free to open \"issues\" if I have something wrong, and I'll correct it. Or add to the wiki if you would like to elucidate some concept, and then I can link to the expanded topic.\n\n## How did this start? ##\nI had an illness in Dec 2011 that looked like Psoriasis. It turns out it was Pityriasis Rosea. I'm curious and like to try to understand whatever is around me, so I began investigating the literature on Psoriasis. This paper (by Mikhail Peslyak) was on arxiv.org and seemed like a great jumping-off point into the science of immunity and Psoriasis in particular.", 
  "id": 3138936
}