{
  "read_at": 1462551915, 
  "description": "A set of scripts that simluates and evaluates the exact Master equation of the 3-atom gate, studied in [http://arxiv.org/abs/1501.00956].", 
  "Readme.md": "This set of codes were used in the research project \"3-atom gate\", in order to confirm the analytic results of the adiabatic theory by comparing it to exact numerical solutions of the Master equation.\n\nThe scripts here should be used in the following way\n\n1. Generate/Update \"Delta1.txt\" and \"Delta2.txt\" files\n(requires Matlab R2014a or higher)\n\n\t- edit C_list and beta_list variables of the \"optimize_detunings_script.m\" to your desired value\n\t\n\t- Run \"optimize_detunings_script.m\" with Matlab\n\t\n\t\n2. Define the running parameters\n\t\n\t- edit \"3atomgate_evolve.ini\", set the parameters to the desired values\n\t\n\t- for the meaning of 'default', see the code \"3atomgate_evolve_ramp.py\"\n\n\t- for a list of simulations, use the command line arguments, as shown in \"run.bat\" to set the values of the parameters that change from run to run\n\t\n\t- make sure that the values of C and beta match up with the values for which Delta1 and Delta2 have been optimized\n\t\n\n3. Run the simulation\n(requires Python 2.7 and installation of QuTip 2.0 or higher)\n\t\n\t- either run \"3atomgate_evolve_ramp.py\" directly (w/ command line arguments)\n\t(or call \"run.bat\" to run a set of simulation defined there)\n\t\n\t- note that consecutive runs produce output files labelled by an increasing registry number, which is read from \"reg.txt\" at the beginning of eahc run\n\t\n\n4. Analyze output\n(requires Python 2.7 and installation of QuTip 2.0 or higher and Matlab R2014a or higher)\n\t\n\t- run \"3atomgate_analyze.py\" with a single command line argument: the registry number of the output to be analyzed. This creates files with time series of the 4x4 density matrix of the qubits, succes probability, and entanglement, as well as plots of the later two.\n\t(see \"run.bat\" for sample usage)\n\t\n\t- check the plots to confirm that the evolution look as you expected\n\t\n\t- modify the list of registy numbers in the beginning of script \"calculate_fidelity_script.m\", to match the registry numbers of the outputs that have just been analyzed. \n\t\n\t- run \"calculate_fidelity_script.m\". This creates files containing the time series of fidelity.\n\t\n\t\n5. Select and summarize a group of outputs\n\t\n\t- edit the file \"findopt_schedule.txt\", such that the first line contains the name of your choice for a new summary file, the second line contains a text to be printed to the first line of the summary file, and the third line contains a series of registry numbers separated by spaces. \n\t\n\t- make sure that each registry number should refer to an already analyzed set of results.\n\t\n\t- you can schedule any number of summaries in the file \"findopt_schedule.txt\" by creating a similar 3 lines right after the first three. Leave no empty lines.\n\t\n\t- run \"findopt_beta.py\". This will create the summary files, containing the first line (as a descriptor), and a table of the maximal fidelity, and the value of entanglement and succes probability at the timepoint of maximal fidelity, for the values of beta\n\t\n\t\n\t\n\t\n\t\n\t", 
  "id": 31384835
}