{
  "id": 31592910, 
  "read_at": 1462544638, 
  "README.rst": "What is a quantum field state?\n==============================\n\nIntroduction\n------------\n\nThis is another experiment in open science. What you see here is the current latex source of a paper we have been writing answering the question: \"what is a quantum field state?\". This paper is \"mostly finished\", i.e., the basic idea and constructions are worked out, however much remains to be done. This paper should be readable by anyone with a background in quantum information theory, condensed matter theory, or quantum field theory. (In any event, you should know what a tensor product is and be fascinated by quantum field theory :) ) \n\nObjective\n--------- \n\nThe purpose of this experiment is to determine whether github could provide a solid collaborative basis for open science. To this end, coauthors are warmly invited to join in at any time to contribute to fixing and finishing the paper and adding new results. Think of it as a kind of \"mini polymath\".\n\nI will continue to edit and push commits. When the paper is ready, and after any pull requests and merges, the final version will be submitted to the arXiv and, eventually, a scientific journal for publication. \n\nGuidelines\n---------- \n\nPlease fork this repository if you are interested in contributing. If you fork this paper then please add yourself to the author list in your fork. If you make substantial contributions to the draft then I will merge your changes into the final version and include you on the final submission version author list.\n\n**What is a \"substantial contribution\"?** At the moment I define this to be a nontrivial calculation, e.g., working out the details of an example, sorting out some of the unfinished calculations, or similar. Another form of \"substantial contribution\" is writing one or more paragraphs of new material. Also, nontrivial figures and diagrams, e.g., graphs of interesting quantities, will be considered. Spelling, grammar, and/or stylistic changes do *not* count as \"substantial contributions\" (but are still welcome!). This definition is subject to change as the experiment proceeds. \n\n**Note**: the final author list will be in alphabetical order regardless of the number and form of contributions. ", 
  "description": "This is a project aimed at answering the question: \"what is a quantum field state?\" "
}