{
  "README": "    L-PICOLA v1.2, December 2015\n    Authors: Cullan Howlett & Marc Manera (UWA, Perth; UCL, London)\n\n    This code is L-PICOLA: A Lightcone-enabled Parallel Implementation \n    of the COLA (COmoving Lagrangian Acceleration) method, as described in \n    Howlett. C., Manera. M. & Percival. W. J. (2015). Please read this paper\n    for full details of how the code works and the efforts that have been made\n    to produce this code. We ask that any work making use of L-PICOLA \n    reference this paper.\n\n    We have included a comprehensive user guide with this distribution, \n    explaining the multitude of options available when using the code. We \n    have provided explanation of each of the various compilation options \n    and run parameters therein, however as a basic start please look at the \n    information on the webpage associated with L-PICOLA.\n    \n    You can find the User Guide and code paper in the directory 'Documentation'.\n    The source code is in the 'src' directory. Any files you may need to run \n    L-PICOLA, such as 'run_parameters.dat', are in the 'files' directory.\n    Finally, we have put a few short codes you may find useful in preparing,\n    and using the output from, L-PICOLA, in the 'utilities' directory.\n    \n    In L-PICOLA, The COLA method is applied to a PM-based N-body code as in the \n    public release of COLAcode (Dec 2012), albeit with many changes and \n    improvements. In this sense, L-PICOLA can be seen as an  amalgamation of \n    both COLAcode and 2LPTic where a substantial amount of  work has been \n    put in to both to make them compatible and simultaneously improve both. \n    Obviously this means that this work relies fundamentally on the work others \n    have put into creating the aforementioned codes, and so we kindly suggest \n    that any work using this code also reference the following papers on top \n    of the main code paper above:\n\n      Solving Large Scale Structure in Ten Easy Steps with COLA,\n      Tassev, S., Zaldarriaga, M. & Eisenstein, D. 2013,\n      JCAP, 6, 036, (arXiv:1301.0322).\n\n      Large-scale Bias and Efficient Generation of Initial Conditions for \n      Nonlocal Primordial non-Gaussianity\n      Scoccimarro, R., Hui, L., Manera, M. & Chan, K. C., 2012, \n      Phys. Rev. D, 85, 083002, (arXiv:1108.5512).\n\n", 
  "read_at": 1462544622, 
  "description": "A public repository for the code L-PICOLA", 
  "id": 31654590
}