{
  "read_at": 1462544841, 
  "description": "Adiabatic elimination of Gaussian subsystems in stochastic quantum dynamics", 
  "README.md": "# Adiabatic elimination of Gaussian subsystems in stochastic quantum dynamics\n\n## Author\n\nOndrej Cernotik\n\nInstitute for Theoretical Physics, Institute for Gravitational Physics (Albert Einstein Institute), Leibniz University Hannover, Germany\n\n## About this repository\n\nThis project deals with numerical simulations of conditional dynamics\nof composite quantum systems. The main goal is to compare the method of\nadiabatic elimination presented in Ref. [1] with exact numerical solution\nof the full stochastic master equation and with other adiabatic elimination\nmethods. The files in this repository simulate the dynamics of\nsuperconducting qubits coupled to harmonic oscillators in various settings,\nincluding the presence of thermal bath. The code can however be readily\nadapted to simulate other quantum systems under continuous monitoring.\n \nRefer to the list of files below and the individual IPython notebook\nfiles for more information.\n \nThe quantum dynamics is implemented using the QuTiP package [2,3].\n \nFor license terms, see LICENSE.\n\n### Files\n\n* Dispersive qubit readout.ipynb\n\nSimulates dispersive readout of a superconducting qubit using a cavity mode coupled to a thermal bath, as studied in Sec. III.A of Ref. [1]. The results obtained by approximate adiabatic elimination methods are compared with the exact solution by taking the trace distance between the exact and approximate solutions.\n\n* Jaynes-Cummings coupling.ipynb\n\nSimilar to 'Dispersive qubit readout.ipynb' but with the qubit-cavity coupling that takes the form of Jaynes-Cummings Hamiltonian.\n\n* Parity measurement.ipynb\n\nAnalyzes protocol for generating two-qubit entanglement by\nmeasurement, following the approach of Ref. [4]. Both qubits\ndispersively couple to a single cavity mode that is being measured.\nStarting from a suitable initial state and using postselection,\nthe two qubits can be found in an entangled state. Here we\ngeneralize the results of Ref. [4] by considering a cavity field\nthat is coupled to a thermal reservoir.\n\n* Two-oscillator transducer.ipynb\n\nHere we analyze the accuracy of approximate solution of a\ndispersive qubit readout by a system comprising two coupled\nharmonic oscillators. The first oscillator interacts with the\nqubit and couples to a thermal bath, while the second one\ninteracts with vacuum bath which is also used for the state\nreadout. This file uses the general formalism of Ref. [1],\nmaking it possible to apply the method to other quantum systems.\n\n* LICENSE.txt\n\nLicense terms. This work is published under the GNU GPL v2 license.\n\n* README.md\n\nThis file\n\n## References\n\n[1] O. Cernotik, D. Vasilyev, and K. Hammerer, *Adiabatic elimination of Gaussian subsystems in stochastic quantum dynamics*, [arXiv:1503.07484](http://www.arxiv.org/abs/1503.07484).\n\n[2] J. R. Johansson, P. D. Nation, and F. Nori, *QuTiP: An open-source Python framework for the dynamics of open quantum systems*, [Computer Physics communications **183**, 1760 (2012)](http://dx.doi.org/10.1016/j.cpc.2012.02.021).\n\n[3] J. R. Johansson, P. D. Nation, and F. Nori, *QuTiP2: A Python framework for the dynamics of open quantum systems*, [Computer Physics Communications **184**, 1234 (2013)](http://dx.doi.org/10.1016/j.cpc.2012.11.019).\n\n[4] C. L. Hutchison, J. Gambetta, A. Blais, and F. K. Wilhelm, *Quantum trajectory equation for multiple qubits in circuit QED: Generating entanglement by measurement*, [Canadian Journal of Physics **87**, 225 (2009)](http://dx.doi.org/10.1139/P08-140).\n", 
  "id": 31709088
}