{
  "read_at": 1462544801, 
  "description": "This is the Coherent Raman Imaging (CRI) Toolkit repository home.", 
  "README.md": "![CRIkit_Logo.png](https://github.com/CoherentRamanNIST/CRIkit/blob/master/CRIkit_Logo.png)\n\nThe Coherent Raman Imaging toolKit\n\nVersion: 1.02\n\n# README #\n\n###Summary ###\nThe CRIKit package offers utility methods for pre-processing coherent Raman spectral data. Currently,\nthis package contains a few key componenets:\n* Phase retrieval via the Kramers-Kronig relation\n* Asymmetric least square baseline detrending\n* Asymmetric reweighted penalized least squares\n\nThese represent but a small fraction of our developed software. For more information, see the contact info below.\n\n###Setup###\n\nMATLAB: Download source code to a folder and add to MATLAB path via \"Set Path\"\n\nPython: Download source code to a folder. Note: there is a IPython Notebook with the Python code. You may wish to place this\nin your local IPython notebook folder for easy accessibility.\n\n###Dependencies###\n\nMATLAB: MATLAB 2013a or newer (it may work on older versions as well).\n\nPython: (REQUIRED) Python >= 3.4; Numpy, SciPy. (RECOMMENDED) PyFFTW, CVXOPT (BETTER) or scikits.sparse.\n\n### NONLICENSE ###\nThis software was developed at the National Institute of Standards and Technology (NIST) by\nemployees of the Federal Government in the course of their official duties. Pursuant to \n[Title 17 Section 105 of the United States Code](http://www.copyright.gov/title17/92chap1.html#105), \nthis software is not subject to copyright protection and is in the public domain. \nNIST assumes no responsibility whatsoever for use by other parties of its source code, \nand makes no guarantees, expressed or implied, about its quality, reliability, or any other characteristic.\n\nSpecific software products identified in this open source project were used in order\nto perform technology transfer and collaboration. In no case does such identification imply\nrecommendation or endorsement by the National Institute of Standards and Technology, nor\ndoes it imply that the products identified are necessarily the best available for the\npurpose.\n\n### CITATION ###\nC. H. Camp Jr., Y. J. Lee, and M. T. Cicerone, \"Quantitative, Comparable Coherent Anti-Stokes Raman Scattering\n(CARS) Spectroscopy: Correcting Errors in Phase Retrieval,\" Journal of Raman Spectroscopy (2015). arXiv:1507.06543.\n\n\n### Contact ###\nCharles H Camp Jr: [charles.camp@nist.gov](mailto:charles.camp@nist.gov)\n", 
  "id": 31721775
}