{
  "read_at": 1462543902, 
  "description": "Organizational document for the Archival of Informal Astronomy Communications", 
  "README.md": "# Arceli\n\n## An archive of informal astronomy communications\n\nArceli was created in recognition that the Internet allows astronomers to publish useful material outside of traditional journals, yet there is no effective mechanism for these communications to be archived, indexed and cited (see [this Twitter conversation](https://storify.com/aaccomazzi/non-traditional-citations-in-astronomy) for Arceli's genesis).\nArceli acts as a facilitator for archiving communications on behalf of authors and providing a structure that NASA/SAO ADS can index.\n\nThis is a working document that specifies the vision for Arceli and how the project funcitons.\n\n## Overview\n\n- Arceli is an archive of informal astronomy communications;\n    * Arceli is partnered with the CfA Library, Zenodo, ScienceBetter, and ADS,\n    * Arceli is fundamentally a Zenodo curated community,\n    * ADS agrees to index the resources of this Zenodo community,\n    * [PressForward](http://pressforward.org/) is used to collect and discuss content\n    * Online Publishers (such as a blog) apply for affiliation with Arceli.\n    * Online publishers are given an account on Arceli in order to allow for self-moderation and community curation.\n- The Publisher posts their content to the web as usual. The Publisher retains all rights to their work, but the content must be licensed, either CC0 or CC-by, to allow for archiving.\n- Only if the Publisher deems the content to be relevant to scholarly astronomy discourse do they intentionally submit the content to the Zenodo community. This also implies that content can be retroactively submitted.\n    * Arceli accepts the submission automatically because the Publisher is affiliated (trusted) and has its own community. This reduces Arceli's operational cost.\n    * The Publisher gets a DOI for the content and it is up the Publisher to put this DOI into any online markup.\n- ADS indexes Arceli's resources.\n- If a Publisher is found to in breach of these guidelines, the Publisher may lose affiliate status and have their articles removed from the Zenodo community and ADS.\n\n![alt text](https://github.com/dbouquin/charter/raw/master/assets/arceli_workflow.png \"Arceli workflow\")\n\n## Governance\n\nArceli is under continuous development by a group of professional astronomers, librarians, and software developers. The Project is community-driven, with decisions generally made by consensus, but with oversight and organization provided be two project leads: ScienceBetter (Kelle Cruz) and CfA Library (Chris Erdmann). Press Forward, Zenodo, and ADS organization are project partners. The project leads work closely with representatives from the partner organizations to make functional, technical, and financial decisions.\n\nProject contributors are involved in all aspects of the project. Discussions among leads, partners, and contributors are held primarily in the Arceli Project Github organization and everyone affilitated with the project is encouraged to participate in these discussions.\n\n## Moderation\n\n[PressForward](https://github.com/PressForward/pressforward/wiki/User-Manual#using-the-all-content-page-how-to-read-nominate-and-add-comments-to-items) provides the platform for the editors to curate and discuss content.\n\nTBD: who will actually moderate and make final go to publish.\n\n## Topics\n### Accepted Topics\n\nAnything relevant to the astronomy community that doesn't have a home elsewhere.\n\n### Not Accepted Topics\n\nScientific results that could otherwise be published on the arxiv. See discussion in [#6](https://github.com/archive-of-informal-astronomy-comm/charter/issues/6).\n\n## Media\n### Accepted Media\n\nWe plan to accept:\n\n- blog posts that contain text and images\n- ipython or jupyter notebooks which contain explanatory text\n- videos - paper summaries, tutorials, etc.\n- animations and graphics - visuals which could be of use to wider community\n- talk slides - talk slides with relevance to the wider community.\n\n### Not Accepted Media\n\n- pre-print style journal articles that would otherwise go on arxiv.\n\n### Metadata Information\nThe current metadata crosswalk is accessible [here](https://docs.google.com/spreadsheets/d/1ti2ny9o0_fpA0ZgWe_F6o9ISmBApEjjDRTu0P7XLRd4/edit?usp=sharing).   \nDiscussion on metadata can be found in the repo issues [here](https://github.com/arceli/charter/issues/24).\n\n### Guidelines for Submission's content and format\n\nIt should be easily and openly readable, e.g., plaintext/markdown and images or an ipython or Jupyter notebook.\nIf appropriate, a PDF rendering is encouraged.\n[Something about URL and/or original blog.](https://github.com/archive-of-informal-astronomy-comm/charter/issues/5)\n\n## How ADS indexes Arceli\n\nPages processed by Arceli will appear like normal articles on ADS. You will see the normal fields filled with helpful data:\n\n- **Title** will be the Blog Post Title\n- **Authors** will be the Blog Post Authors\n- **Affiliations** will be the Blog Post Author's affiliations, if available\n- **Publication** will say\t \"BLOG TITLE, Aggregated by Arceli\"\n- **Publication Date** will be the blog post published date, not the Arceli archive date.\n- **DOI** will be filled in with the Zenodo-generated DOI\n- **bibstem** (the first part of the **Bibliographic Code**) will be `2016arcel..etc`\n", 
  "id": 31856942
}