{
  "read_at": 1462544730, 
  "description": "Kilobot simulator in C", 
  "README.md": "# Kilombo - C kilobot simulator\n\nAuthors: Fredrik Jansson, Matthew Hartley, Martin Hinsch, \n         Tjelvar Olsson, Ivica Slavkov, Noemi Carranza\n\nFor an extended list of those contributing to the simulator and related paper, see [here](contributors.md).\n\nContact: \nFredrik Jansson: fjansson@abo.fi\nMatthew Hartley: Matthew.Hartley@jic.ac.uk\n\n\nThis repository holds the code for Kilombo, a C based Kilobot\nsimulator. The simulator was developed in the [Swarm Organ\nproject](http://www.swarm-organ.eu), and is distributed under the MIT license\n(see the file LICENSE for details). Installation instructions follow\nbelow. For detailed usage instruction and programming documentation,\nsee `docs/manual.md` and the example bots in `examples/`.\n\nA preprint of an article about the simultator is available on\narXiv. If the Kilombo simulator is used for academic purposes, we\nwould highly appreciate citations of this article and the GitHub\nrepository.  [ArXiv 1511.04285](http://arxiv.org/abs/1511.04285)\n\nAny feedback on the simulator is welcome, contact the authors listed\nabove. If the simulator turns out to be useful for you, we would like\nto hear it - please write us a short mail to let us know.\n\n\n## Prerequisites\nYou'll need to have:\n- git\n- cmake\n- SDL 1.X (including headers for building, i.e. devel packages under linux)\n- the [Jansson library](http://www.digip.org/jansson/) (though it's in\n  many package managers. Again, get the development package)\n- the [Check unit testing library](http://check.sourceforge.net/)\n\nAdditionally, to compile the code for real kilobots as well, the following are needed:\n- avr-gcc (c compiler for the AVR microcontroller, to compile for the kilobot)\n- [Kilolib](https://github.com/acornejo/kilolib) (the official Kilobot library)\n\n\n### Debian-based Linux systems\n`sudo apt-get install build-essential git gcc-avr gdb-avr binutils-avr\navr-libc avrdude libsdl1.2-dev libjansson-dev cmake check`\n\n### OSX systems\n\nStandard development tools, includeing git and a c compiler, can be\nobtained by installing xcode.  In addition, several libraries are\nneeded, which can be obtained using the package manager brew.  A\ntutorial:\nhttp://hackercodex.com/guide/mac-osx-mavericks-10.9-configuration/\n\nWith brew installed, install the libraries.\n\ncmake:\n`brew install cmake`\n\ncheck library:\n`brew install check`\n\nSDL library:\n`brew install sdl`\n\nAVR toolchain, (Optional, needed for real kilobots):\n`brew tap osx-cross/avr`\n`brew install avr-libc`\n\nFor the brew-installed libraries to be found, the following lines can be\nadded to `.bash_profile`:\n`export C_INCLUDE_PATH=/usr/local/include/:$C_INCLUDE_PATH`\n`export LIBRARY_PATH=/usr/local/lib:$LIBRARY_PATH`\n\n\n## Build instructions\n\nMake a build directory:\n\n\tmkdir build\n\tcd build\n\nRun cmake:\n\n\tcmake ..\n\nInstall:\n\n\tsudo make install\n\nThis installs the kilobot simulator in a system-wide location, by default\nunder `/usr/local/lib` and `/usr/local/include`.\n\n\n## Compile and run examples\ncd examples\ncd orbit\nmake     # or make -f Makefile.osx on OSX\n./orbit -b start_positions.json\n\nThe example makefiles are set up to build the code for the simulator by default. By running\n    make hex\nthe same source code is compiled for the real Kilobot. This requires the avr-gcc toolchain\nand the official Kilolib to be installed (see prerequisites above). \n\n## Setup for compiling programs for the real Kilobots\n\n### Kilolib\n\n    git clone https://github.com/acornejo/kilolib\n    cd kilolib\n    make\n\nadd `export KILOHEADERS=/path/to/kilolib/` to `.bash_profile` or another suitable\nconfigureation file, or provide the path in the Makefile for the bot program.\nFor the setting to take effect, open a new terminal or `source .bash_profile`. \n\nTo compile the example programs for real robots:\n`cd examples/orbit`  # or another example \n`make hex`\n\n\n## Third-party code\nThe simulator uses the [SDL_GFX library](http://cms.ferzkopp.net/index.php/software/13-sdl-gfx)\nby Andreas Schiffler (distributed under the zlib license). The source\ncode for the sdl_gfx library is bundled with the simulator due to its\nunreliable availability in various Linux distributions. It is located in the\ndirectory src/gfx, and is automatically compiled with the rest of the\nsource code.\n\nThe simulator also includes the API definitions of kilolib, the C\nlibrary for the physical kilobot robot. These are located in the file\nsrc/kilolib.h, with minor, simulator-specific changes.\nThe full kilolib source code is here: https://github.com/acornejo/kilolib .\n", 
  "id": 31912159
}