{
  "read_at": 1462544810, 
  "description": "Implementation of netsimile Algorithm to detect anomalies in time series graphs. ", 
  "Readme.txt": "Implementation of Netsimile algorithm to detect anomalous graphs in Time series graphs. \nLink to paper: http://arxiv.org/pdf/1209.2684.pdf\n\n(a) Software that needs to be installed (if any) with URL's to download it from \nand instructions on how to install them.\n\nAnaconda Python 2.7: http://continuum.io/downloads\nDownload \"Windows 64-Bit Python 2.7 Graphical Installer\" from above link\n\nIGraph Python Module: http://www.lfd.uci.edu/~gohlke/pythonlibs/#python-igraph\nDownload the python-igraph-0.7.0.win-amd64-py2.7.exe file from the above link and install. \n\nwindows powershell\n\n\n(b) Environment variable settings (if any) and OS it should/could run on.\nThe program has been tested on Windows 8.0 (64bit)\nThe program is written in pycharm IDE and executed in pyCharm.\n\n\n\n(c) Instructions on how to run the program\nThe folder where the program is executed should have graph and anomalies folders as the program outputs the graph in graph folder and anomalies.txt in anomalies folder\n\nChange the directory to the project folder which has the Netsimile.py file , graph folder and anomalies folder.\n> cd <project directory>\n> ls\nNetsimile.py graph anomalies\nExecute the following command:\n>python Netsimile.py <path to input files> <name of output file>\nE.g. \n>python Netsimile.py C:/Users/Kristy/PycharmProjects/Netsimile/input_files enron_test\n\nThe above command will produce enron_test.txt in anomalies folder and enron-test.png on graph folder.\n\n(d) Instructions on how to interpret the results.\nThe results are saved in graph and anomalies folder\nThe output text files are stored in anomalies folder. The output file shows the threshold, number of anomalies and the anomalous time points on each line. \n\n(e) Sample input files are stored in input_files folder and output files are in anomalies folder while graphs are stored in graph folder in the zip file submitted.\n", 
  "id": 31972345
}