{
  "read_at": 1462543904, 
  "description": "", 
  "README.md": "## Nonparametric Estimation using Influence Functions\nThis is a Matlab Implementation of our Nonparametric Estimators using Influence\nFunctions. For more details, read our paper on Arxiv:\nhttp://arxiv.org/abs/1411.4342\n\n### Functionals \\& Features\n- Currently, our implementation covers the following functionals,\n    Entropies: Shannon Entropy, Conditional Shannon Entropy\n    Mutual Informations: Shannon MI, Conditional Shannon MI\n    Divergences: Chi-squared, Hellinger, KL Divergence, Tsallis, Renyi, \n      Conditional KL, Conditional Tsallis\n- In addition to the estimators, we also produce asymptotic confidence intervals\n  for the estimators.\n- Since all estimators are nonparametric, they work well only in under 4-6 \n  dimensions depending on the problem.\n\n### Installation and Getting Started\n- Run ifSetup.m with the path to the installation as the argument. This adds all\n  subdirectories to the matlab workspace and you are good to go.\n- To get started, see the demos directory. demos.m illustrates a very simple use\n  case.\n- demo1.m ... demo4.m illustrate all functionals in different settings. We re\n- See parseCommonParams for setting of hyperparameters. We recommend using the\n  default settings unless you are very familiar with the paper.\n\n### Citation\nIf you use this library in your academic work please cite our paper: \"Influence\nFunctions for Machine Learning: Nonparametric Estimators for Entropies,\nDivergences and Mutual Informations\", Kirthevasan Kandasamy, Akshay\nKrishnamurthy, Barnabas Poczos, Larry Wasserman, James Robins.\n\n### License\nThis software is released under GNU GPL v3(>=) License. Please read LICENSE.txt for\nmore information.\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n\"Copyright 2015 Kirthevasan Kandasamy\"\n\n\n#### Acknowledgements\nWe thank Zoltan Szabo from UCL for pointing out some bugs in a previous version of\nthis software.\n* Some of the above estimators also appear in the ITE toolbox: \nhttps://bitbucket.org/szzoli/ite/\n* For questions/ bug reports please email kandasamy@cs.cmu.edu\n\n\n", 
  "id": 31973896
}