{
  "read_at": 1462544635, 
  "description": "Automatically exported from code.google.com/p/bud-aida", 
  "README.md": "# bud-aida\n<b>Minimum bias vertex finder in high pile-up environment (minBiasVertexing).</b> <br>\n<i>Reference: F. Sikler: Study of clustering methods to improve primary vertex finding for collider detectors [http://dx.doi.org/10.1016/j.nima.2010.04.058 Nucl. Instrum. Meth. A 621 (2010) 526-533] [http://arxiv.org/abs/0911.2767 arXiv:0911.2767 (physics)]</i> <br>\nPrimary vertex finding for collider experiments is studied with the aim to detect all primary interactions. The efficiency and precision of finding interaction vertices can be improved by advanced clustering and classification methods, such as agglomerative clustering with fast pairwise nearest neighbor search, followed by Gaussian mixture model or k-means clustering. The results have been obtained with simplified simulation and Gaussian smearing, but insights on sensitivity to backgrounds are also given.\n\n<b> Gain calibration and energy loss estimation for silicon detectors (siEnergyLoss)</b> <br>\n<i>Reference: F. Sikler: A parametrisation of the energy loss distributions of charged particles and its applications for silicon detectors [http://dx.doi.org/10.1016/j.nima.2012.06.064 Nucl. Instrum. Meth. A 691 (2012) 16-29] [http://arxiv.org/abs/1111.3213 arXiv:1111.3213 (physics)]</i> <br>\nThe energy loss distribution of charged particles in silicon is approximated by\na simple analytical parametrisation. Its use is demonstrated through several\nexamples. With the help of energy deposits in sensing elements of the detector,\nthe position of track segments and the corresponding deposited energy are\nestimated with improved accuracy and less bias. The parametrisation is\nsuccessfully used to estimate the energy loss rate of charged particles, and it\nis applied to detector gain calibration tasks.\n\n<b>Event simulator + reconstructor and viewer (eventSimulator).</b> <br>\nTrack and cluster simulation + reconstruction module, general steering, control plots. Light event viewer in a web browser.\n\n<hr>\n\nWorks on these packages were supported by <a href=http://aida.web.cern.ch>AIDA</a> (Advanced European Infrastructures for Detectors at Accelerators).\n", 
  "id": 32135437
}