{
  "README": "General Info\n------------\nThis release of RoadTool includes the source for the program, as well as utilities for retrieving and processing the associated data (both input and output).\n\nThe primary input, road networks, are read from in the TIGER/Line UA 2k format. Networks for all 50 states can be found with some documentation (as well as tool for merging networks), at time of release, on this site: http://www.dis.uniroma1.it/~challenge9/data/tiger/\nThe original data files originate with US Census Bureau and can also be found here: http://www.census.gov/geo/www/tiger/tigerua/ua_tgr2k.html\n\nScripts are included to process POI data from either Census Bureau TIGER files (including an automated downloader) and generate POI input files for RoadTool. Run \"FetchTIGERChurchesAndSchools.py\" for more information.\n\nScripts are also included to process POI data from Garmin CSV files into a format suitable for input to RoadTool. Run \"GarminCSVtoRoadToolPOI.py\" for more information.\n\nOther script utilities included are for processing and visualization of output data. Some of these require the Python Imaging Library (PIL).\n\nBuilding\n--------\nRoadTool uses ant (http://ant.apache.org/) as a build tool, and includes a build.xml for ant. It should also be relatively straightforward to compile by hand for somewhere familiar with the JDK. Requires at least Java 1.5, and depends on the Java OpenGL (JOGL) libraries for the built-in map visualization features. A fully assembled jar file is available on the project website, this should run on any platform with JOGL and at least Java 5.\n\n\nUse Notes\n---------\nAssumes RoadTool is assembled into a JAR and that JOGL is available in the current working directory. Modify the specified paths as necessary.\n\nA minimal command line (assuming your classpath to access JOGL has been set via environment variables) to invoke RoadTool and display the help text looks like this:\n\tjava -jar RoadTool.jar\n\nA more realistic invocation looks something like this:\n\tjava -d64 -classpath jogl-1.1.1-macosx-universal/lib/jogl.jar:jogl-1.1.1-macosx-universal/lib/gluegen-rt.jar:RoadTool.jar -Xmx8192M RoadTool -i\\\n\t\t data/NH.tmp.gz -p poi/NH-schools.poi -p poi/NH-churches.poi -o serialized/NH-chandsch.stmp -n -m FLATPOL -dA \"Religious Institution\" \\\n\t\t-2 \"Educational Institution\" > data/NH-chandsch.txt &\n\nThe full set of switches for RoadTool are documented here:\njava -jar -Xmx[memory allocation] RoadTool.jar [options] -i inputfile\n-v [0-3]\t\tSet Verbosity. Defaults to 2\n\t\t\t0 is silent\n\t\t\t1 is errors only\n\t\t\t2 is normal\n\t\t\t3 is chatter\n-o filename\t\tWrite serialized RoadGraph to filename\n-r\t\t\tinputfile is an Internet URL computer\n-s\t\t\tinputfile is a serialized RoadGraph\n-n\t\t\tdon't attempt to display inputfile\n-p filename\t\tLoad POIs from filename\n-dA poiDescription\truns Djikstra and dumps information\n\t\t\tabout POI distribution\n-2 poiDescription\truns Djikstra with a second set\n\t\t\tof POIs (2 color). Requires -dA\n-d nodenumber\t\truns Djikstra with nodenumber as root\n-u\t\t\tdump the Djikstra tree to the console\n\t\t\timplies -d, by default node is set to 0\n\t\t\tunless specified otherwise by -d\n\t\t\tand ignored by -dA\n-t\t\t\tUse a static radius when\n\t\t\tanalyzing POI distribution\n\t\t\tignored if not used with -dA\n-w DISTANCE/TIME\tchooses between weighting the graph by DISTANCE\n\t\t\tand TIME. Defaults to TIME\n-m RECT/FLATPOL\t\tchooses between interpreting coordinates\n\t\t\tas a grid (FLATPOL) or converting them\n\t\t\tto rectangular coordinates (RECT)\n\nJava command-line switches of note: \n-d64 sets 64bit execution mode. This is necessary for large (>4GB) heap sizes.\n-Xmx8192M provides a maximum heap size of 8GB. RoadTool will happily eat whatever memory you throw at it, given a large enough input. 1.5GB-2GB is a minimum realistic allowance for the data set of a small state (VT, RI, HI).\n\n\nFor more information on this project, see: Dickerson, Dickerson, Goodrich, and Zhuo; \"Round-Trip Voronoi Diagrams and Doubling Density in Geographic Networks\"; Trans. on Comput. Sci. XIV, LNCS 6970 (2011): p.211-38. A preprint of this article is available free of charge at: http://arxiv.org/abs/1005.1053\n", 
  "read_at": 1462544866, 
  "description": "Automatically exported from code.google.com/p/roadtool", 
  "id": 32186491
}