{
  "README": "\nWritten by Patrick Kelly\n\nAn implementation of algorithms described in Kelly et al. 2014 (http://arxiv.org/abs/1208.0602) Updated 8/25/12\n\nAuthor List\nP. L. Kelly, A. von der Linden, D. Applegate, M. Allen, S. W. Allen, P. R. Burchat, D. L. Burke, H. Ebeling, P. Capak, O. Czoske, D. Donovan, A. Mantz, and R. G. Morris\n\n1-2% Color Calibration\nBig MACS is a Python program that estimates an accurate photometric calibration from only an input catalog of stellar magnitudes and filter transmission functions. The user does not have to measure color terms which can be difficult to characterize.\n\nSupplied with filter transmission functions, Big MACS synthesizes an expected stellar locus for your data and then simultaneously solves for all unknown zeropoints when fitting to the instrumental locus.\nUses a spectroscopic model for the SDSS stellar locus in color-color space and filter functions to compute expected locus.\nThe stellar locus model is corrected for Milky Way reddening.\nIf SDSS or 2MASS photometry is available for stars in field, code can yield a highly accurate absolute calibration.\n\nMagnitude calibration with 2MASS\nAutomatically match against 2MASS catalog (useful if 2MASS stars are not saturated in science exposures)\n\nIncorporate SDSS photometry\nAutomatically match against SDSS catalog\n\nExcellent for photometric redshifts\nSee accompanying paper\n\nAdvantages\nCalculates color transformation from SDSS to instrumental magnitudes automatically\nSimultaneously solves for all zeropoint simultaneously using new, simplified algorithm\nSDSS stellar locus is dereddened for Milky Way dust extinction\nImproved zeropoint accuracy\n\n<p><img src=\"http://farm9.staticflickr.com/8283/7613582508_cbccece26e.jpg\" /> </p>\n<p>Color calibration of photometry through nine Subaru SuprimeCam and CFHT MegaPrime filter \nbands of the RXJ1347-11 galaxy cluster field. We simultaneously vary eight zeropoints \nand hold one constant during the fit to maximize agreement between the instrumental stellar \nlocus and the model stellar locus. </p>\n\n<p><img src=\"http://farm8.staticflickr.com/7275/7723411818_8340373f95.jpg\" /> </p>\n<p>Photometric redshifts computed after calibration with Big MACS software.  </p>\n\n=========================================================================\n\nSet environmental variables: \n\n#1\n\nBIGMACS\nto the path of the installation directory\n\ne.g., setenv BIGMACS /Users/ronald/big-macs-calibrate/ (tcsh shell)\n      \n      BIGMACS=/Users/ronald/big-macs-calibrate/ (bash shell)\n      export BIGMACS  \n\n#2 \nadd installation directory to PYTHONPATH\n\ne.g., setenv PYTHONPATH $BIGMACS:PYTHONPATH (tcsh shell)\n\n      PYTHONPATH=$BIGMACS:PYTHONPATH\n      export PYTHONPATH  \n\n=========================================================================\n\nUsage:\n\nRun \"python fit_locus.py --help\" to get list of possible\ncommand line arguments \n\n=========================================================================\n\nRequired Python packages:\n\npylab\nscipy\nsqlcl.py copy included (queries SDSS database written by Tamas Budavari, JHU -- need version that searches at least DR8which is set by the astro_url and public_url variables) \n\n=========================================================================\n\nAcknowledgements:\n\nWe use the Munari SED to estimate extinction\n\n=========================================================================\n\nQuick Start:\n\nIngredients:\n\n    (1) FITS catalog with columns for stellar magnitudes and magnitude errors.\n    Include columns with RA and DEC if interested in automatically matching\n    against the SDSS or 2MASS catalogs. You will need to specify the names of the\n    RA and DEC columns (e.g., -r X_WORLD -d Y_WORLD) on the command line.\n\n    (2) Need to find/make totla transmission function for filters used in \n    observations. FILTERS folder contains examples for several telescopes.\n\n    (3) Create a configuration file. Here you will specify the names\n    of the magnitude and magnitude error columns in the FITS catalog. \n    You will need to specify whether to HOLD or VARY the zeropoint \n    for each filter. If you choose to HOLD the zeropoint for a filter,\n    you will need to specify any zeropoint offset you would like to \n    apply to the magnitudes for that filter during fit (generally 0 if\n    the magnitudes are calibrated). At least one filter will need to \n    have the zeropoint held fixed.\n\nExample:\n\n    1) CALIBRATE ONLY COLORS (no SDSS or 2MASS magnitudes): \n\n        python fit_locus.py --file ./EXAMPLES/MACS1423+24.stars.calibrated.cat --columns ./EXAMPLES/MACS1423+24.qc.columns --extension 1 --bootstrap 5 --l -s (run here from the installation directory) \n\n        This a catalog of Subaru SuprimeCam magnitudes where we hold the zeropoint of one of the bands constant. Here we include SDSS stars (only the faintest are not saturated) to \n        get an approximate absolute ZP. Colors should be calibrated with high accuracy.\n        \n        extension is the number or name of the extension of the table with the necessary magnitudes in the FITS file\n        liveplot is responsible for whether \n        (type python fit_locus.py for other arguments)\n\n    2) SDSS UNIT TEST \n\n        python fit_locus.py --file ./EXAMPLES/MACS1423+24.stars.calibrated.cat --columns ./EXAMPLES/MACS1423+24.qc.columns --extension 1 --bootstrap 0 --l -s -u (run here from the installation directory) \n\n        This unit test makes a catalog of all SDSS stars in field (not only those matched against) and then holds the z-band zeropoint fixed. \n\n    3) CALIBRATE ABSOLUTE ZP w/ 2MASS\n        python fit_locus.py --file ./EXAMPLES/kpno.fits --columns ./EXAMPLES/kpno.columns --extension 1 --bootstrap 5 -l -r ALPHA_J2000_reg2_i -d DELTA_J2000_reg2_i -j\n\n        This is a catalog of Kitt Peak photometry. Here we add 2MASS photometry to calibrate these magnitudes. A much smaller catalog than the Subaru catalog.  \n\n\n\n=========================================================================\n\nESSENTIAL TIPS:\n\n    Need to specify output directory (e.g., --output ~/) in order to save plots for fit\n\n    Set bad magnitudes equal to +-99 (flagged measurements, saturated stars etc.)\n\n    Be wary at low Galatic latitude and high extinction, especially when using all available SDSS\n    filters/magnitudes. Code uses extinction curve to estimate what the SDSS magnitudes would\n    be _behind_ the dust -- that assumption may not be correct.\n\n    A kink in the _observed_ locus is important for accurate calibration.  \n\n    Does not yet work for u-band calibration (ask Pat) \n\n    FILTER functions should not be in the optical\n\n    Yields an AB calibration (not Vega)\n\n    The 2MASS locus is not synthesized from the spectroscopic model. If you\n    would like to match against 2MASS then the name of the filter transmission\n    function needs to be J2MASS.res so that Big MACS can assign the correct locus.\n\n    Can only use 2MASS when there are enough 2MASS matches (problem is bright stars are saturated in science images)\n    \n    Make sure to exclude stars with saturated or non-linear measurements.\n\n    The spectroscopic model for the locus is only trustworthy to approximately 10500 Angstroms (the red limit of the SDSS z' filter), so synthesized magnitudes from near-IR filter functions are not likely to be correct. Therefore, near-IR observations need to be calibrated separately, although some work is ongoing to extend to templates to redder wavelengths.\n\n    The magnitudes, if any, that you hold \"FIXED\" need to be corrected for MW reddening along the line of sight.\n\n=========================================================================\n\nREMOVED MySQLdb dependence\n\n\n=========================================================================\n\nnot currently available in public release:\n    Generate a new spectroscopic locus:                                                              \n    \n    execute CasJobs_query \n    makes e.g., SLR_2MASS_pkelly50.fit which contains extinction-corrected stellar magnitudes\n    \n    first run measure_locus.py \n    measure running median of colors indexed by g'-i' color\n    makes lociCAS_2MASS (pickled Python object)\n    then run make_spectroscopic_locus.py \n    takes lociCAS_2MASS (pickled Python object)\n    makes spectra in LOCUS_SPECTRA  \n    \n    then run fit_locus.py \n    takes spectra in LOCUS_SPECTRA\n    makes expected locus for filter set\n\n", 
  "read_at": 1462544896, 
  "description": "Automatically exported from code.google.com/p/big-macs-calibrate", 
  "id": 32231114
}