{
  "README": "             SCTE - Software for Controlling Testing Equipment\n\n\nWhat is it?\n-----------\n\n  SCTE is a bundle of Perl scripts and a library, that aims to be a simple, yet\n  powerful, data acquisition system. It is designed to control instruments, such \n  as oscilloscopes and signal generators, that use the SCPI programming \n  language [1] for communication, and are interfaced through one of USB, Ethernet \n  (LAN), and RS-232 (serial) buses.\n\n  [1] SCPI - Standard Commands for Programmable Instruments.\n      http://www.ivifoundation.org/scpi/default.aspx\n\n\nThe Latest Version\n------------------\n\n  Details of the latest version can be found on the project page at\n  http://code.google.com/p/scte/\n  \n\nDocumentation\n-------------\n\n  The documentation available as of the date of this release is available\n  http://http://arxiv.org/abs/0906.4833. The most up-to-date documentation can\n  be found at http://code.google.com/p/scte/\n  \n  \nSCTE Components\n---------------\n\n  SCTE is comprised of two parts: SCTE-Instrument, and experiments.\n\n  o 'SCTE-Instrument' is a Perl module that controls and interfaces instruments\n    via USB, LAN, and RS-232 ports. It requires installation and is necessary in \n    order to run the 'experiments'.\n\n  o 'experiments' is a directory containing two experiment examples (sub-\n    directories experiment_1 and experiment_2) on how to use SCTE-Instrument \n    and develop a data acquisition system. The 'experiment_1' example, controls\n    one oscilloscope connected via USB. The 'experiment_2', controls two\n    instruments, one connected via USB and the other connected via RS-232. For\n    details about each experiment, refer to the README files under each\n    experiment directory, and consult the documentation (see Documentations\n    section).\n\n\nInstallation\n------------\n\n  SCTE-Instrument requires installation, please see the file called INSTALL\n  under 'SCTE-Instrument' directory.\n\n  The companion experiment scripts don't require installation, and can be run\n  directly, considering that it's dependencies have been met. Please see the\n  README file under 'experiments' directory.\n\n\nKnown Bugs\n----------\n\n  There are no known bugs at this time, if you find one please report it. It is\n  the only way we can correct it and improve SCTE stability and usability. For\n  reporting bug, see Contacts section.\n\n\nContacts\n--------\n     \n  For contacts and bug repots you can send an email to <lm.guidolin@gmail.com>.\n\n\nAuthors and Acknowledgments\n---------------------------\n\n  See THANKS for details.\n\n\nLicensing\n---------\n\n  SCTE bundle is free software; you can redistribute it and/or modify it under\n  the terms of the GNU General Public License as published by the Free Software\n  Foundation; either version 3, or (at your option) any later version.\n\n  SCTE bundle is distributed in the hope that it will be useful, but WITHOUT \n  ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS\n  FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more\n  details.\n\n  You should have received a copy of the GNU General Public License along with\n  SCTE; see the file COPYING.  If not, write to the Free Software Foundation,\n  Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.\n\n----------------------------------------------\n  __.-._\n   '-._\"7'\n    /'.-c   Use the force, read the source!\n    |  /T   \n   _)_/LI\n----------------------------------------------\n", 
  "read_at": 1462544848, 
  "description": "Software for Controlling Testing Equipment - moved from code.google.com/p/scte", 
  "id": 32347647
}