{
  "read_at": 1462544819, 
  "description": "Lecture notes on perverse sheaves and the decomposition theorem", 
  "README.md": "# Peverse sheaves and the decomposition theorem\n\n## Introduction\n\n[Mark Andrea A. de Cataldo](http://www.math.stonybrook.edu/~mde)\ndelivered a course on the decomposition theorem and its\napplications in representation theory in Spring 2015 at\nStony Brook. I was keeping some notes of his lectures.\n\n**UPDATE: Professor de Cataldo has finalized his own lecture notes and uploaded\nto arXiv.org**. A link to the pdf file can be found in his own homepage.\n\nThese are the LaTeX files of the notes of Mark's class. I have also\nadded something more that I feel useful for myself, which include:\ncomments, worked out examples, more detailed computations, exercises,\nextra sections on some fun topics that are not covered in the lectures,\netc.\n\nAlthough the course ~~is now on-going~~ has ended, some of the texts are still\nvery rough. Many sections are to be revised (e.g. although I have TeXed-up files\nfor the section on the cohomology of blow-ups, they are not polished enough, and\nare not presented here). I don't know when would I have the time and passion to\ndo so.\n\n## How to compile\n\nIn terminal, first `cd` to the directory containing these tex files. Then\n`pdflatex spr15mat691-main.tex`,  follwed by `bibtex spr15mat691-main`\nand pdflatex twice more to get the reference, hyperlink correct.\nOr simply compile in your IDE if you use any.\n\nI basically used no fancy packages, except\nsome commutative diagrams are drawn using `TikZ`.\n\n## Contents\n\nHere is a list of materials that are covered by these notes.\n\n1. __The decomposition theorem for smooth maps between nonsingular\n    varieties.__ After some brief discussion about Leray-Hirsch, blowing\n    up formula, and derived categories, we follow Deligne to prove the\n    splitting part of the decomposition theorem. We do not offer the\n    semisimplicity result as it requires mixed Hodge theory.\n2. __Introduction to perverse sheaves.__ We review the duality theory of\n    Poincare, Borel-Moore and Verdier. We then introduce perverse sheaves\n    via support condition. The basic properties of these objects are proved (?).\n3. __The theory of weights.__ We review Deligne's work on the Weil conjectures.\n    We prove the decomposition theorem (splitting, semisimplicity,\n    and purity of intersection complexes) in the realm\n    of l-adic etale cohomology for maps defined over algebraic closure of some\n    finite field.\n4. __Applications.__ We serve some applications of the decomposition theorem,\n    including: semismall maps, perverse filtrations, toric maps (?), and Springer\n    theory (?).\n\nThe erotemes refer to topics yet to be written.\n", 
  "id": 32479086
}