{
  "read_at": 1462544741, 
  "description": "Next generation input-output file format", 
  "README.md": "# ProMC\nNext generation input-output file format  for particle experiments\n\n\nProMC is a library for file input and output of Monte Carlo event records or any HEP structural data. The main features are:\n\n- Content-dependent compression. Event records are encoded using Google protocol buffers with variable number of bytes (\"varints\"). \n  This leads to 30% (and more) smaller file sizes compared to any known compression based on a fixed-length representation of numeric information.\n- Multiplatform. Data records can be read and can be written natively in C++, Java and Python.\n- Self-describing data format. Analysis source codes can be generated from ProMC files with unknown data layouts.\n- Forwards-compatible and backwards-compatible binary wire format.\n- Random access. Events can be read starting at any index.\n- Fast. No CPU overhead on decompression of events\n- Simplicity. No external dependence. The library is small and self-contained. The library has been deployed on BlueGene/Q.\n\n\n<h2>Description</h2>\nThe description of the file format is given in these two articles:\n\n- S.Chekanov, E.May, K.Strand, P. Van Gemmeren, \n  ProMC: Input-output data format for HEP applications using varint encoding, \n  ANL-HEP-PR-13-41, arXiv:1311.1229, Computer Physics Communications 185 (2014), pp. 2629-2635\n\n- S.Chekanov, \"Next generation input-output data format for HEP using Google protocol buffers\", \n  ANL-HEP-CP-13-32, Snowmass 2013 Proceedings. arxiv.org:1306.6675\n\n\nRead the manual: https://atlaswww.hep.anl.gov/asc/wikidoc/doku.php?id=asc:promc\n\n\n<h2>How to install</h2>\n\n1) Compile:\n  ./build.sh\n\n2) Install libraries and include files to a \n   given directory (must have permissions!):\n \n  ./install.sh [promc_dir] [hepmc_dir]\n\n (the location of HEPMC libraries are optional)\n\n\n3) Setup the ProMC as:\n\n   source  [promc_dir]/setup.sh\n\n\n<h2>Uninstall</h2>\n\n./uninstall.sh\n\nClear the build directory:\n\n./clear.sh\n\n\nExamples:\n========\nLook at the examples in $PROMC/examples directory\n\n\nS.Chekanov (ANL), E.May (ANL), P. Van Gemmeren (ANL) \n\nOctober 2014\n", 
  "id": 32553582
}