{
  "id": 32561472, 
  "read_at": 1462543979, 
  "README.rst": "======================\nrustle1314/Representation-based-Multilabel-Learning\n======================\nThis project provides representation-based learning methods for multi-label classification, even the number of labels is extremely large, include:\n\n* Web Scale Annotation by Image Embedding (WSABIE)\n\n  Weston, Jason, Samy Bengio, and Nicolas Usunier. \"Wsabie: Scaling up to large vocabulary image annotation.\" IJCAI. Vol. 11. 2011.\n\n* Low rank Empirical risk minimization for Multi-Label Learning (LEML)\n \n  Yu, Hsiang-Fu, et al. \"Large-scale multi-label learning with missing labels.\" arXiv preprint arXiv:1307.5101 (2013).\n\n\n\nData Format\n------------\nThe first line of the training data file is \"#num_feature={$1} num_label={$2}\", where $1 denotes the number of features and $2 denotes the number of labels. For example, if we have 20 features and 6 labels, the first line shall be \"#num_feature=20 num_label=6\".\n \nThe following lines denote training data. Each line denotes an instance. '1,2 1:4.5 2:3' denotes an instance with the 2-th and 3-th label. The weight of the 1-th feature is 4.5 and the weight of the 2-th feature is 3.\nThe index of feature and label starts with zero.\n\nHere is an example::\n\n    #num_feature=20 num_label=6\n    1,2 1:4.5 2:3\n    2,4 19:1 2:5\n    1,5 10:2 8:1\n\n\nTrain, Predict and Eval\n-----------------------\n1.1 Train\n\nYou can use train_wsabie.py and train_leml.py to train a model for a multi-label classification with many labels problem. Usage: \n\n  Usage: python train_wsabie.py(or train_leml.py) [options] train_file model_file\n\nIf you don't know how to set up the options, you just need \"python train_wsabie.py\" and the program will give detailed information.\n\n\n1.2 Predict\n\nYou can use predict.py to make predictions with a trained model.\n\n  Usage: python predict.py test_file result_file model_file\n\n1.3 Eval\n\nYou can use eval.py to evaluate the predictions\n\n  Usage: python eval.py result_file true_file\n\n\nRequirements\n---------------\nNow I only test the code with Python2.7 and I will test it with Python3 as soon as possible.\n\nTo run this code, you should installed the following modules::\n\n- numpy\n- scipy\n\n\nContributors\n------------\n- `lietal <https://github.com/rustle1314>`_i\n", 
  "description": "Representation based multi label classification with many labels"
}