{
  "read_at": 1462544876, 
  "description": "Java-based open-source and versatile simulation platform for education and research-driven experiments in evolutionary robotics (ER)", 
  "README.md": "JBotEvolver is a Java-based open-source and versatile simulation platform for education and research-driven experiments in evolutionary robotics (ER). JBotEvolver has been used in previous ER studies of our research group, from offline evolution to online evolution and learning, and from single to multi- robot systems, and in a number of undergraduate and graduate courses at ISCTE-IUL (http://iscte-iul.pt).\n\n![JBotEvolver Evolution Panel](http://miguelduarte.pt/media/jbotwiki/evolution.png)\n\nInformation about how to install and use the simulator can be found in the [wiki](https://github.com/BioMachinesLab/jbotevolver/wiki).\n\n# References\n* M. Duarte, F. Silva, T. Rodrigues, S. M. Oliveira, and A. L. Christensen (2014), \"JBotEvolver: A Versatile Simulation Platform for Evolutionary Robotics\", in Proceedings of the 14th International Conference on the Synthesis and Simulation of Living Systems (ALIFE), MIT Press, Cambridge, MA, pages 210-211.\n\n# Studies that use JBotEvolver\n\n## 2015\n\n* M. Duarte, V. Costa, J. Gomes, T. Rodrigues, F. Silva, S. M. Oliveira, A. L. Christensen (2016).\n\"Evolution of Collective Behaviors for a Real Swarm of Aquatic Surface Robots\". Preprint, url: http://arxiv.org/abs/1511.03154\n* F. Silva, L. Correia, and A. L. Christensen (2015). \"A Caseo Study on the Scalability of Online Evolution of Robotic Controllers\", in Proceedings of the 17th Portuguese Conference on Artificial Intelligence (EPIA), pp. 189-200, Springer International Publishing, Switzerland, 2015.\n* P. Romano, L. Nunes, A. L. Christensen, M. Duarte, S. M. Oliveira (2015). \"Genome Variations: Effects on the robustness of neuroevolved swarm controllers\", in Proceedings of the Iberian Conference on Robotics (ROBOT), Springer, Berlin, Germany.\n* M. Duarte, S. M. Oliveira and A. L. Christensen (2015). \"Evolution of Hybrid Robotic Controllers for Complex Tasks\", Journal of Intelligent and Robotic Systems, 78(3-4):463-484.\n* T. Rodrigues, M. Duarte, M. Figueiro, V. Costa, S. M. Oliveira, A. L. Christensen (2015). \"Overcoming Limited Onboard Sensing in Swarm Robotics through Local Communication\", Transactions on Computational Collective Intelligence, in press.\n* F. Silva, L. Correia, and A. L. Christensen (2015). \"R-HybrID: Evolution of Agent Controllers with a Hybridisation of Indirect and Direct Encodings\". In: International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2015). Accepted as full paper.\n* F. Silva, P. Urbano, L. Correia, and A. L. Christensen (2015). \"odNEAT: An Algorithm for Decentralised Online Evolution of Robotic Controllers\", Evolutionary Computation, 23 (3), pp. 421-449, 2015.\n* T. Rodrigues, M. Duarte, S. M. Oliveira, A. L. Christensen (2015). \"Beyond Onboard Sensors in Robotic Swarms: Local Collective Sensing through Situated Communication\", in Proceedings of the International Conference on Agents and Artificial Intelligence (ICAART), pp. 111-118, SCITEPRESS, Lisbon, Portugal\n* A. L. Christensen, S. Oliveira, O. Postolache, M. J. d. Oliveira, S. Sargento, P. Santana, L. Nunes, F. Velez, P. Sebastiao, V. Costa, M. Duarte, J. Gomes, T. Rodrigues, F. Silva (2015). \"Design of Communication and Control for Swarms of Aquatic Surface Drones\", in Proceedings of the International Conference on Agents and Artificial Intelligence (ICAART), SCITEPRESS, Lisbon, Portugal.\n\n## 2014\n\n* F. Silva, P. Urbano, and A.L. Christensen (2014). \"Online Evolution of Adaptive Robot Behaviour\", International Journal of Natural Computing Research, in press.\n* F. Silva, L. Correia, and A.L. Christensen (2014). \"Towards Online Evolution of Control for Real Robots with odNEAT\". In: 3rd International Workshop on the Evolution of Physical Systems (EPS 2014), held as part of the 14th International Conference on the Synthesis & Simulation of Living Systems (ALIFE 2014).\n* M. Duarte, S. M. Oliveira, and A. L. Christensen (2014), \"Hybrid Control for Large Swarms of Aquatic Drones\", in Proceedings of the 14th International Conference on the Synthesis & Simulation of Living Systems (ALIFE), MIT Press, Cambridge, MA, pages 785-792.\n* M. Duarte, S. M. Oliveira, and A. L. Christensen (2014), \"Evolution of Hierarchical Controllers for Multirobot Systems\", in Proceedings of the 14th International Conference on the Synthesis & Simulation of Living Systems (ALIFE), MIT Press, Cambridge, MA, pages 657-664.\n* F. Silva, M. Duarte, S. M. Oliveira, L. Correia, and A. L. Christensen (2014), \"The Case for Engineering the Evolution of Robot Controllers\", in Proceedings of the 14th International Conference on the Synthesis & Simulation of Living Systems (ALIFE), MIT Press, Cambridge, MA, pages 703-710.\n* F. Silva, L. Correia, and A.L. Christensen (2014). \"Speeding up Online Evolution of Robotic Controllers with Macro-neurons\", in Proceedings of the 16th European Conference on the Applications of Evolutionary Computation, Springer, Berlin, Germany, in press.\n* T. Rodrigues, M. Duarte, S. Oliveira, and A. L. Christensen, (2014), \"What You Choose to See is What You Get: An Experiment with Learnt Sensory Modulation in a Robotic Foraging Task\", in Proceedings of the 16th European Conference on the Applications of Evolutionary Computation, Springer, Berlin, Germany, in press.\n\n## 2013\n\n* F. Silva, L. Correia, and A.L. Christensen (2013). \"Dynamics of Neuronal Models in Online Neuroevolution of Robotic Controllers\", in Proceedings of the 16th Portuguese Conference on Artificial Intelligence (EPIA 2013). LNAI 8154, pages 90-101. Springer, Berlin, Germany.\n* P. Szczawinski, M. Duarte, S. Oliveira, and A. L. Christensen (2013), \"Toward Evolved Vision-based Control for a Quadrocopter\", in Proceedings of the 9th Conference on Telecommunications (CONFTELE), IT, Coimbra, Portugal, pages 153-156.\n\n## 2012\n\n* F. Silva, P. Urbano, and A.L. Christensen (2012). \"Adaptation of Robot Behaviour through Online Evolution and Neuromodulated Learning\", in Proceedings of the 13th Ibero-American Conference on Artificial Intelligence (IBERAMIA 2012). LNAI 7637, pages 300-309. Springer, Berlin, Germany.\n* F. Silva, P. Urbano, S. Oliveira, and A.L Christensen (2012). \"odNEAT: An Algorithm for Distributed Online, Onboard Evolution of Robot Behaviours\", in Proceedings of the 13th International Conference on the Simulation & Synthesis of Living Systems (ALIFE 13), pages 251-258. MIT Press, Cambridge, MA.\n* M. Duarte, S. Oliveira, A. L. Christensen (2012), \"Hierarchical Evolution of Robotic Controllers for Complex Tasks\", in Proceedings of the IEEE Conference on Development and Learning and Epigenetic Robotics (ICDL), IEEE Press, Piscataway, NJ, pages 1-6.\n* M. Duarte, S. Oliveira, A. L. Christensen (2012), \"Automatic Synthesis of Controllers for Real Robots Based on Preprogrammed Behaviors\", in Proceedings of the 12th International Conference on Adaptive Behavior (SAB), Springer, Berlin, Germany, pages 249-258.\n* F. Silva, P. Urbano, and A.L Christensen (2012). \"Continuous Adaptation of Robot Behaviour through Online Evolution and Neuromodulated Learning\", in Proceedings of the 5th International Workshop on Evolutionary and Reinforcement Learning for Autonomous Robots (ERLARS 2012), held as part of the 20th European Conference on Artificial Intelligence (ECAI 2012). N. Siebel, Berlin, Germany, pages 9-18, ISSN 2190-5576 (print), ISSN 2190-5746 (online).\n* M. Duarte, S. Oliveira, and A. L. Christensen (2012), \"Structured Composition of Evolved Robotic Controllers\", in Proceedings of the 5th International Workshop on Evolutionary and Reinforcement Learning for Autonomous Robot Systems, N. Siebel, Berlin, Germany, pages 19-25, ISSN 2190-5576 (print), ISSN 2190-5746 (online).\n* M. Duarte (2012), \"Hierarchical Evolution of Robotic Controllers for Complex Tasks\". MSc Thesis, University Institute of Lisbon (ISCTE-IUL), Portugal.\n* F. Silva (2012), \"Online Evolution of Robot Behaviour\". MSc thesis, University of Lisbon, Portugal.\n\n## 2011\n\n* S. Oliveira, L. Nunes, A. L. Christensen (2011), \"An Experiment in Mixing Evolving and Preprogrammed Robots\", in Proceedings of the 20th European Conference on Artificial Life (ECAL), Springer, Berlin, Germany, pages 605-612.\n* M. Duarte, A. L. Christensen, S. Oliveira (2011), \"Towards Artificial Evolution of Complex Behavior Observed in Insect Colonies\", in Proceedings of the 15th Portuguese Conference on Artificial Intelligence, Springer, Berlin, Germany, pages 153-167.\n* Andre Bastos (2011), \"Experiments in Evolutionary Collective Robotics\". MSc thesis, University of Lisbon, Portugal.\n", 
  "id": 32629728
}