{
  "read_at": 1462543975, 
  "description": "", 
  "README.md": "## CoddsDM: Comparing data from direct searches for Dark Matter\n\n### Description \n\nThis program is used to analyze the data produced by Direct Detection (DD) experiments. DD searches look for \nenergy deposited within a detector by the collisions between nuclei in a target material and \nWeakly Interactive Massive Particles (WIMPs) belonging to the dark halo of our galaxy. \nThe goal of this code is to compare data from various DD experiments and asses the compatibility between \nthem in a statistically meaningful way. \n\nThe underlying theory and description of the analysis can be found in many papers, a fraction of which are \nlisted under the References section below.\n\nThis program computes best-fit regions and upper limits as described in the references, and produces the figures.\n\nAt present, it contains the implementation of the analysis for the following types of WIMP interactions:\n\n- Spin-independent (SI) [[1](#1404.7484),[2](#1507.03902)], or spin-dependent (SD) interactions with axial-vector \n(AV) or pseudo-scalar (PS) coupling [[3](#1502.07682)]\n\n- Isospin-conserving or isospin-violating interactions\n\n- Elastic or inelastic scattering (both exothermic and endothermic) [[1](#1404.7484),[2](#1507.03902),[3](#1502.07682),[5](#1306.5273)]\n\n- Contact or long-range interactions (arbitrary mass of the mediator) [[3](#1502.07682)]\n\n- Form factors used: Helm form factor for SI, and the form factors computed by Fitzpatrick et al for SD interactions (for nuclides for which they are available) [[3](#1502.07682),[4](#1203.3542)]\n\nTypes of analyses implemented:\n\n- Analysis assuming the Standard Halo Model (SHM) [[1](#1404.7484),[2](#1507.03902),[3](#1502.07682)].\n\n- Halo-independent analysis [[1](#1404.7484),[2](#1507.03902),[3](#1502.07682),[5](#1306.5273)].\n\n- Extended maximum likelihood halo-independent analysis (EHI), a recent method for experiments with \npossible dark matter signals and unbinned data [[2](#1507.03902)]\n\nSo far, this code has been used to produce the figures from [[2](#1507.03902),[3](#1502.07682)].\n\n\n### References\nThe following represent only a few selected references, that contain the description of the analysis implemented in this code. See also references therein. \n\nImplementations of the data analysis had been previously done in Mathematica [[6](#Mathematica_code)], which has been used to produce the Figures in [[1](#1404.7484)], as well as other publications of E. Del Nobile, G. Gelmini, P. Gondolo, J. H. Huh. \n\nI have re-implemented the data analysis in the present Python code, which represents a restructured, generalized, extended and corrected implementation of the analysis methods described in the papers, while also incorporating new or recent methods.\n\n[1] <a id=\"1404.7484\"></a> G. B. Gelmini, A. Georgescu and J. H. Huh,\n  *Direct detection of light \"Ge-phobic\" exothermic dark matter,*\n  JCAP **1407**, 028 (2014) [arXiv:1404.7484 [hep-ph]](http://arxiv.org/abs/1404.7484). \n\n[2] <a id=\"1507.03902\"></a> G. B. Gelmini, A. Georgescu, P. Gondolo and J. H. Huh,\n  *Extended Maximum Likelihood Halo-independent Analysis of Dark Matter Direct Detection Data,*\n  [arXiv:1507.03902 [hep-ph]](http://arxiv.org/abs/1507.03902). \n\n[3] <a id=\"1502.07682\"></a> E. Del Nobile, G. B. Gelmini, A. Georgescu and J. H. Huh,\n  *Reevaluation of spin-dependent WIMP-proton interactions as an explanation of the DAMA data,*\n  JCAP **1508**, no. 08, 046 (2015) [arXiv:1502.07682 [hep-ph]](http://arxiv.org/abs/1404.7484).\n\n[4] <a id=\"1203.3542\"></a> A. L. Fitzpatrick, W. Haxton, E. Katz, N. Lubbers and Y. Xu,\n  *The Effective Field Theory of Dark Matter Direct Detection,*\n  JCAP **1302** (2013) 004 [arXiv:1203.3542 [hep-ph]](http://arxiv.org/abs/1203.3542). \n\n[5] <a id=\"1306.5273\"></a> E. Del Nobile, G. Gelmini, P. Gondolo and J. H. Huh,\n  *Generalized Halo Independent Comparison of Direct Dark Matter Detection Data,*\n  JCAP **1310**, 048 (2013) [arXiv:1306.5273 [hep-ph]](http://arxiv.org/abs/1306.5273). \n\n[6] <a id=\"Mathematica_code\"</a> A. Georgescu, P. Gondolo, J. H. Huh, \nData analysis code written in Mathematica [unpublished]\n\n\n### License\n\nCopyright 2015 Andreea Georgescu\n\nLicensed under GNU GPL version 2 or any later version\n\nhttp://www.gnu.org/licenses/\n\nPlease consider citing this program if it contributes to a project that leads to a scientific publication. \n\n    A. Georgescu, \"CoddsDM: Comparing data from direct searches for Dark Matter\", \n    GitHub repository (2015), https://github.com/Andreea-G/Codds_DarkMatter\n\nLaTeX:\n\n    \\bibitem{Georgescu:CoddsDM} \n      A.~Georgescu,\n      ``CoddsDM: Comparing data from direct searches for Dark Matter'',\n      GitHub repository (2015), \\url{https://github.com/Andreea-G/Codds_DarkMatter}\n\nBibTeX:\n\n    @misc{Georgescu:CoddsDM,\n     author={Georgescu, A.},\n     title=\"{``CoddsDM:~Comparing data from direct searches for Dark Matter''}\",\n     howpublished={GitHub repository},\n     year={2015},\n     note={\\url{https://github.com/Andreea-G/Codds_DarkMatter}}\n    }\n\n\n### Disclaimer\n\nThe experimental data found in the Data directory was obtained from the experimental publications cited within the references given here. Often times, this was done by extracting the data directly from their published figures. Since the data is constantly changing and evolving, the files in the Data directory serve only as examples. For any future publication, you are REQUIRED to obtain your own data directly from the latest experimental publications, and of course, you are REQUIRED to cite its origin. You may not cite this program as the origin of experimental data.\n", 
  "id": 32718024
}