{
  "read_at": 1462511917, 
  "description": "Automatically exported from code.google.com/p/mipa", 
  "README.md": "### Updates\r\n * The project is exported from googlecode on April 2015.\r\n * August 01, 2011, MIPA documentation updated. Part of the system design is provided in chapters in Part 2 of the documentation.\r\n * The _MIPA Documentation_ is under construction. The latest version is available at [here](http://cs.nju.edu.cn/yuhuang/huangyufiles/projects/mipa-development-documentation.pdf).\r\n\r\n### MIPA (Middleware Infrastructure for Predicate detection in Asynchronous environments)\r\nPervasive applications are undergoing changes as more and more mobile devices are augmented with sensing and controlling abilities, besides the basic abilities of computation and communication. We call such devices C^3^S (Computation, Communication, Control, and Sensing) devices. Examples of C^3^S devices include mobile robots patrolling in a chemical plant for safety management and smart phones equipped with a variety of sensors.\r\n\r\nC^3^S devices can provide rich context information for the applications, and pervasive applications are typically designed to be context-aware, i.e., intelligently adapting their behavior to the environment. However, enabling context-awareness through C^3^S devices is faced with severe challenges, as detailed below.\r\n\r\nThe contexts of interest to a pervasive application often span a geographically large area, and contain rich semantics. This is often beyond the ability of one single C^3^S device. Thus, a group of autonomous but also coordinating C^3^S devices should be deployed. Take a chemical plant scenario for example. A group of mobile robots are deployed to periodically patrol the plant for safety management. The robots need to proceed in certain formation to cover all possible spots of hazardous material leak. Appropriate spreading of multiple robots can also enable the robots to collect contexts with better quality, e.g., to sense the average temperature in the plant.\r\n\r\nThe coordination among the C^3^S devices is intrinsically asynchronous. There is no global clock available among the C^3^S devices. Constrained resources and task scheduling of the C^3^S devices (often embedded systems) may lead to unpredictable computation delay. The growing adoption of wireless communications, which are prone to bandwidth shortage, network congestion, unpredictable routings, and retransmission, leads to unpredictable communication delay. All these characteristics of the C^3^S devices and their communication networks lead to the intrinsic asynchrony among the contexts they collect.\r\n\r\nOne possible solution to cope with the asynchrony is clock synchronization. However, clock synchronization may not enable correct and fault-tolerant coordination among the autonomous C^3^S devices. Thus, it cannot enable context-awareness despite of the asynchrony in pervasive scenarios enriched of coordinating C^3^S devices. Specifically, each C^3^S device only has its own local clock, which cannot be perfectly synchronized. The uncertainty caused by the skew among the clocks may lead to incorrect behavior. Besides, clock synchronization schemes make assumptions on process execution speeds and communication delay. These assumptions may not be guaranteed for the autonomous C^3^S devices. A group of robots are prone to incorrect behavior even if one single assumption is violated. The inaccuracy of synchronization and the potential violation of assumptions make reasoning based on time and timeouts a delicate and error-prone undertaking. Furthermore, periodic clock synchronization may be unaffordable in terms of energy consumption, or be hampered due to device autonomy and administrative boundaries such as privacy concerns and security issues. Consequently, it is more practical to have few or, better, no synchrony assumption in scenarios of coordinating C^3^S devices.\r\n\r\nTo enable context-awareness for pervasive applications enriched with C^3^S devices, we introduce the predicate detection theory and propose the Predicate-Detection-based Context-Awareness (PD-CA) framework, which consists of three essential parts: \r\n  * Logical time is used to cope with the asynchrony among contexts collected from the asynchronous system of coordinating C^3^S devices. Temporal orders among asynchronous contextual events resulting from message causality are encoded and decoded via the logical vector clock. Global snapshot of the asynchronous system of C^3^S devices is redefined under the notion of logical time. Dynamic behavior of the C^3^S devices are modeled over sequences of global snapshots. \r\n  * Specification of predicates enables the applications to express their concerns on properties of the contexts. Based on the modeling above, the specification can delineate local contextual properties on local states of one C^3^S device, global contextual properties on snapshots of the system of C^3^S devices, and dynamic behavioral properties on sequences of snapshots. \r\n  * Context-awareness is enabled by detection of the specified contextual property at runtime. The detection is such a persistent process that new emerging contexts trigger the incremental detection of the specified property.\r\n\r\nUnder the guidance of the PD-CA framework, we develop the Middleware Infrastructure for Predicate detection in Asynchronous environments (MIPA). In context-aware computing scenarios, MIPA first receives contextual properties from the applications. It then decomposes the global contextual properties to local ones, with which MIPA instructs each C^3^S device to collect the related contexts. MIPA detects the specified contextual properties with the contexts in an online and incremental manner and informs the applications when the properties are satisfied. MIPA adopts a layered architecture to support this context processing process.\r\n\r\nMIPA can simplify the development of context-aware applications in asynchronous pervasive computing environments. Based on the PD-CA framework, the context-aware adaptation logic of the application is constructed in a condition-action manner. The contextual property serves as the condition of context-aware behavior.\r\n\r\nPlease refer to our research papers below and the [documentation](http://cs.nju.edu.cn/yuhuang/huangyufiles/projects/mipa-development-documentation.pdf) for more detailed discussions. If you have any comments or suggestions, please feel free to contact Yu Huang (http://cs.nju.edu.cn/yuhuang/).\r\n\r\n### Key Citations\r\n6. Yiling Yang, Yu Huang, Xiaoxing Ma, Jian Lu, Enabling Context-awareness by Predicate Detection in Asynchronous Pervasive Computing Environments, available on arxiv, [http://arxiv.org/abs/1310.3623 http://arxiv.org/abs/1310.3623].\r\n\r\n5. Yiling Yang, Yu Huang, Jiannong Cao, Xiaoxing Ma, Jian Lu, Design of a Sliding Window over Distributed and Asynchronous Event Streams, IEEE Transactions on Parallel and Distributed Systems, 25(10):2551-2560, Oct. 2014, [http://cs.nju.edu.cn/yuhuang/huangyufiles/papers/2013-LatWin.pdf].\r\n\r\n4. Yiling Yang, Yu Huang, Jiannong Cao, Xiaoxing Ma, Jian Lu, Formal Specification and Runtime Detection of Dynamic Properties in Asynchronous Pervasive Computing Environments, IEEE Transactions on Parallel and Distributed Systems, 24(8):1546-1555, Aug. 2013, [http://cs.nju.edu.cn/yuhuang/huangyufiles/Paper2012/Sequence-TPDS12.pdf].\r\n\r\n3. Yu Huang, Yiling Yang, Jiannong Cao, Xiaoxing Ma, Xianping Tao, Jian Lu, Runtime Detection of the Concurrency Property in Asynchronous Pervasive Computing Environments, IEEE Transactions on Parallel and Distributed Systems, 23(4): 744-750, Apr. 2012, [http://cs.nju.edu.cn/yuhuang/huangyufiles/Paper2011/CADA-TPDS11.pdf].\r\n\r\n2. Hengfeng Wei, Yu Huang, Jiannong Cao, Xiaoxing Ma, Jian Lu, Formal Specification and Runtime Detection of Temporal Properties for Asynchronous Context, In proc. of the International Conference on Pervasive Computing and Communications (PerCom), Mar. 2012. (full paper acceptance ratio: 16 out of 150, 11%) [http://cs.nju.edu.cn/yuhuang/huangyufiles/Paper2011/PerCom12.pdf]\r\n\r\n1. Yu Huang, Xiaoxing Ma, Jiannong Cao, Xianping Tao and Jian Lu, Concurrent Event Detection for Asynchronous Consistency Checking of Pervasive Context, in proc. of the 7th Annual IEEE Intl. Conf. on Pervasive Computing and Communications (PerCom), 2009, [http://cs.nju.edu.cn/yuhuang/huangyufiles/paper2008/percom09.pdf].\r\n\r\n### INSTALL\r\n  See more in ./INSTALL file.\r\n\r\n### Any Questions?\r\nFor more detail, please visit https://github.com/alg-nju/mipa\r\n", 
  "id": 33581366
}