{
  "id": 3363669, 
  "read_at": 1462547107, 
  "README.rst": "Citematic::Get uses EBSCOhost_, the `Library of Congress`_, IDEAS_ (i.e., RePEc_), and CrossRef_ to get bibliographic data for search terms. In the case of EBSCOhost, it also tries to get full-text URLs. It returns at most one result per invocation, so if you aren't looking for a specific item, you're probably better off with the web interfaces.\n\nThe actual output of the ``get`` function provided by Citematic::Get is a nested data structure of `Citation Style Language`_ 1.0 variables (as specified in `the input data schema`__, except that no ``id`` is provided). The included Python module \"quickbib\" uses citeproc-py_ to generate bibliographies from CSL data using `any CSL style you like`__ (but with special support for APA style). Citematic::QuickBib provides a Perl interface to quickbib, and the Perl script ``cite`` provides a handy command-line interface to the whole mess. Finally, Citematic::Get also has a function ``digest_ris`` for parsing `RIS`_, and the Python module \"citematic_coins\" has a function ``coins`` to generate `ContextObjects in Spans`_ (COinS) from CSL input data.\n\n.. __: https://github.com/citation-style-language/schema/blob/master/csl-data.json\n.. __: http://zotero.org/styles\n\nExamples\n============================================================\n  \n* ``$ cite 1983 tversky kahneman``\n\n    Tversky, A., & Kahneman, D. (1983). Extensional versus intuitive reasoning: The conjunction fallacy in probability judgment. <i>Psychological Review, 90</i>, 293-315. doi:10.1037/0033-295X.90.4.293\n\n* ``$ cite nisbett -t 'telling more than we can know'``\n\n    Nisbett, R. E., & Wilson, T. D. (1977). Telling more than we can know: Verbal reports on mental processes. <i>Psychological Review, 84</i>, 231-259. doi:10.1037/0033-295X.84.3.231\n\n* ``$ cite 10.1080/00224545.1979.9933632``\n\n    Zak, I. (1979). Modal personality of young Jews and Arabs in Israel. <i>Journal of Social Psychology, 109</i>, 3-10. doi:10.1080/00224545.1979.9933632\n\n* ``$ cite 'Yates, J. F., Veinott, E. S., & Patalano, A. L. (2003).'``\n\n    Yates, J. F., Veinott, E. S., & Patalano, A. L. (2003). Hard decisions, bad decisions: On decision quality and decision aiding. In S. L. Schneider & J. Shanteau (Eds.), <i>Emerging perspectives on judgment and decision research</i> (pp. 1-63). New York, NY: Cambridge University Press.\n\n* ``$ cite 2000 -t 'programming perl'``\n\n    Wall, L., Christiansen, T., & Orwant, J. (2000). <i>Programming Perl</i> (3rd ed.). Beijing, PRC: O'Reilly.\n\n* ``$ cite 9780521431460``\n\n    Huddleston, R. D., & Pullum, G. K. (2002). <i>The Cambridge grammar of the English language</i>. Cambridge, UK: Cambridge University Press.\n\n* ``$ cite arxiv:1504.00641``\n\n    Patel, A. B., Nguyen, T., & Baraniuk, R. G. (2015). <i>A probabilistic theory of deep learning</i>. Retrieved from http://arxiv.org/abs/1504.00641\n\nYou can put bounds on the year, rather than searching for an exact year, by using syntax like this:\n\n- ``1990..`` -- Items published in 1990 or later\n- ``..2000`` -- Items published in 2000 or earlier\n- ``1990..2000`` -- Items published between 1990 and 2000 inclusive\n\nSee ``cite --help`` for a description of command-line options. See ``Perl/test_citematic.pm`` for more examples of what Citematic::Get can find and ``Python/test_apa.py`` for more examples of what quickbib can format.\n\nInstallation\n============================================================\n\n#. Ensure you have the following Perl modules. You can install modules with ``sudo cpan install WWW::Mechanize`` or ``sudo cpanm WWW::Mechanize`` (using cpanminus_) or your package manager.\n\n   * Citematic::Get requires: Business::ISBN File::Slurp HTML::Entities HTTP::Cookies JSON LWP::Simple List::Util Text::Aspell URI::Escape WWW::Mechanize XML::Simple parent\n   * Citematic::QuickBib requires: IPC::Run JSON \n   * ``cite`` requires: File::Slurp Getopt::Long::Descriptive\n\n#. Install ``Get.pm``, ``QuickBib.pm``, and ``COinS.pm`` themselves, as by putting them in ``/etc/perl/Citematic``.\n\n#. Ensure you have Python 3, then get and install (as by putting it in ``/usr/lib/python3/dist-packages``) citeproc-py_ and its own dependencies, as well as the files ``quickbib.py`` and ``citematic_coins.py`` provided by Citematic. The version of citeproc-py with which this version of Citematic has been tested is commit cabe7a6e509a9bdd8ff781e4b5b8306e4b84821f (dated 21 Dec 2013).\n\n#. Download `apa.csl`_ (and, if you'll be running quickbib's one test for it, `mla.csl`_) and set the environment variable ``APA_CSL_PATH`` to where you put it (ditto ``MLA_CSL_PATH``).\n\n#. Copy the example configuration file to ``$HOME/.citematic`` and edit it. `Registering for CrossRef`_ is easy. Getting access to EBSCOhost is harder. There's a good chance that your school (if you're using Citematic, you must be a student or an academic, right? right?) or your local library has an institutional subscription that you can use from home. You may be able to log in with a single HTTP ``POST`` (the Firefox extension `Tamper Data`_ is helpful for figuring out how), in which case editing ``ebsco_login`` will be particularly easy. And if your IP address is already authenticated, then you don't need to log in at all, and you can set ``ebsco_login`` to a no-op like ``1``. (Perl programmers note that ``$_`` refers to a WWW::Mechanize object in this context.)\n\nRunning the tests\n============================================================\n\nFor quickbib, enter the Python directory and say ``py.test``. This requires `pytest`_.\n\nFor Citematic::Get, say ``perl test_citematic.pl`` and ``perl test_ris_input.pl``. This requires Test::More.\n\ncitematic_coins has no real test suite, but see ``coins_demo.py``.\n\nCaveats\n============================================================\n\nIf you look at the code of Citematic::Get, you'll see that a great many cases need to be covered in order to parse all the idiosyncratic record formats. You'd hope that all that data would be systematically structured, huh? It isn't really, hence regexes. I've done a pretty good job (if I do say so myself) of covering psychology articles (particularly those represented in PsycINFO and PsycARTICLES), but more regexes will no doubt be needed if you plunge further into the depths of, say, MEDLINE. And while I implemented support for IDEAS so I can get economics articles, fields like mathematics and chemistry will probably require more databases. In short, I wrote this program for my own use, so I took pains to support the sort of articles I read (in experimental social psychology and JDM), as well as books (the Library of Congress covers pretty much every book), but the further your interests are from mine, the more work you'd have to do to make Citematic::Get useful. Patches are more than welcome; I would love for Citematic to be as well-rounded in scraping as it is in formatting.\n\nAnother thing: every query is cached, but the cache never times out. You'll need to delete the cache file or edit it by hand (or in the case of EBSCO, use the ``-b`` option to ``cite``) in order to see any updates to the databases.\n\nWill I get in trouble for using this program?\n============================================================\n\nSo far as I can tell from `EBSCOhost's terms of use`_, `St. Louis Fed's legal-notices page`_, and `CrossRef's terms and conditions`_, no. You will notice that Citematic::Get does not use Google Scholar or Scirus, which forbid automated queries.\n\nThere may be some restrictions on what you can do with the data you get, which apply just the same as if you'd used the web interface (e.g., EBSCO's terms say something about \"non-commercial use\"), but given that fair-use laws apply, I doubt you'll have any problems.\n\nAnd, of course, since this is mostly done with web scraping, server-side changes could suddenly render Citematic::Get inoperable.\n\nWhy didn't you use Z39.50?\n============================================================\n\nI couldn't get it to work.\n\nWhy did you call it \"Sittymatic\"?\n============================================================\n\nIt's pronounced \"CITE-uh\", you numskull.\n\nLicenses\n============================================================\n\nCitematic contains some code in modified form to which the below copyrights and licenses apply. Citematic itself is licensed under the GPL >=3.\n\nLicense for citeproc-py\n----------------------------------------\n\nCopyright 2011-2012 Brecht Machiels. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nThe views and conclusions contained in the software and documentation are those of the authors and should not be interpreted as representing official policies, either expressed or implied, of the copyright holder.\n\nLicense for Connotea Code\n----------------------------------------\n\nCopyright 2005-2007 Nature Publishing Group.\n\nThis program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the `GNU General Public License`_ for more details.\n\nLicense for Citematic\n----------------------------------------\n\nCitematic is copyright 2011-2016 Kodi Arfer.\n\nCitematic is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\n\nCitematic is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the `GNU General Public License`_ for more details.\n\n.. _EBSCOhost: http://ebscohost.com/\n.. _`Library of Congress`: http://catalog2.loc.gov/\n.. _IDEAS: http://ideas.repec.org/\n.. _RePEc: http://repec.org\n.. _`Citation Style Language`: http://citationstyles.org/downloads/specification.html\n.. _RIS: https://en.wikipedia.org/wiki/RIS_%28file_format%29\n.. _`ContextObjects in Spans`: http://ocoins.info/\n.. _`apa.csl`: https://github.com/citation-style-language/styles/blob/master/apa.csl\n.. _`mla.csl`: https://github.com/citation-style-language/styles/blob/master/mla.csl\n.. _CrossRef: http://crossref.org/\n.. _`registering for CrossRef`: http://www.crossref.org/requestaccount/\n.. _`pytest`: http://pytest.org/\n.. _`EBSCOhost's terms of use`: http://support.epnet.com/ehost/terms.html\n.. _`St. Louis Fed's legal-notices page`: http://research.stlouisfed.org/legal.html\n.. _`CrossRef's terms and conditions`: http://www.crossref.org/requestaccount/termsandconditions.html\n.. _cpanminus: https://github.com/miyagawa/cpanminus\n.. _`Tamper Data`: https://addons.mozilla.org/en-US/firefox/addon/tamper-data/\n.. _citeproc-py: https://github.com/brechtm/citeproc-py\n.. _`GNU General Public License`: http://www.gnu.org/licenses/\n", 
  "description": "Get citations to journal articles and books"
}