{
  "read_at": 1462511921, 
  "description": "Approximate probabilistic verification of hybrid systems", 
  "README.md": "# Approximate probabilistic verification of hybrid systems\n## Introduction\nThis is a MATLAB implementation of an approximate probabilisic verification method for non-linear hybrid systems.\nThe system dynamics is described by a combination of discrete modes and continuous ordinary differential \nequations governing the temporal evolution of the state variables in each mode. The transitions between modes are \nlimited by guards, which are conditioned on the current value of the state variables. \n\nTo verify whether the model satisfies a bounded linear time temporal logic (BLTL) property, we use a probabilistic approximation\ntechnique, and construct a statistical mode checking (SMC) scheme relying on repeated trajectory simulations according to \nAlgorithm 1 of [1]. Whether the system satisfies the property is posed as a hypothesis test and decided according to \nAlgorithm 2 of [1].\n\n## Model construction\nA model is represented as a structure with the following fields. \n\n* nstates: the number of state variables of the model\n* nmodes: the number of modes of the model\n* mode0: the index of the initial mode (between 1 and nmodes)\n* x0: a matrix of size (nstates,2), each row of which contains the lower and upper bound for the initial condition of a state variable\n* modes: a vector of mode structures with nmodes elements\n\t* modes(i).ode: the function handle corresponding to the ODE equations governing the i-th mode\n\t* modes(i).guards: a vector of guards whose source is the i-th mode\n\t\t* modes(i).guards(j).target: the index of the target mode of the j-th guard\n\t\t* modes(i).guards(j).formula: the function handle corresponding to the evaluation of the guard condition. The j-th guard is enabled if the formula evaluates to true. \n\n## Property construction\nA property is represented as a structure with the following fields\n\n* formula: a function handle corresponding to the evaluation a trace with respect to the property\n* alpha: the precision of the hypothesis test in the SMC procedure\n* delta: the probability threshold parameter for the hypothesis test in the SMC procedure\n* dt: the length of the time step for the trajectory simulation\n* nt: the number of time steps to simulate\n* J: the number of guard evaluations within a single time step\n\n[1] BM Gyori, B Liu, S Paul, R Ramanathan and PS Thiagarajan, Approximate probabilstic verification of hybrid systems <http://arxiv.org/abs/1412.6953>", 
  "id": 33796609
}