{
  "read_at": 1462511692, 
  "description": "", 
  "README.md": "# Castle-Covert-Channel\n\nPLEASE NOTE:  0 A.D. is an open-source game which is still under development. One of the things in their TODO is to implement end-to-end encryption. So until that is done, Castle over 0 A.D. is NOT secure as described in the paper.\n\nHowever, Castle is secure as described in the paper when it is put to work on top of any other RTS game which does have encryption implemented. Anyone wanting to do this should be able to in a few hours given the code that we released. If 0 A.D. were to implement end-to-end encryption, Castle over 0 A.D. would be secure as claimed in the paper.\n\nRead the full paper here: http://arxiv.org/abs/1503.05904\n\nFor any Castle related help, you can send an email to castle@googlegroups.com\n\n\nCASTLE COVERT CHANNEL INSTALLATION GUIDE\n-----------------------------------------------------------------\n\n!!WARNING!!\nThis release of Castle currently only works with monitors of at least horizontal resolution 1600.\n\n\n1. Install 0ad, found at http://play0ad.com/download/\n\n2. Install at least Python 2.7 and make sure that you have it in your PATH\n\n3. Install AutoHotkey, found at http://www.autohotkey.com/\n\n4. Place the entire 0adProcessor folder into your C directory. Now, you should have C://0adProcessor\n\n5. Copy local.cfg from C://0adProcessor/Config into %appdata%/../local/0 A.D. alpha/binaries/data/config\n\n6. Copy Blank_Map.xml and Blank_Map.pmp from C://0adProcessor/Map into %appdata%/../local/0 A.D. alpha/binaries/data/mods/public/public.zip/maps/scenarios\n\n\n----------------------------------------------------------------\nTHINGS OF NOTE\n----------------------------------------------------------------\nThe correctness of Castle transmissions is heavily dependant upon the performance of 0ad. Castle pushes 0ad to its limits. Performance of 0ad will vary from machine to machine. Do not assume that a high-end processor alone will make 0ad performant; on-board graphics cards probably won't cut it for this. If you see 0ad visibly straining to keep up with the commands being input (selection boxes trailing behind the clicking cursor or game screen freezing momentarily), you can do several things to increase performance:\n\t-First, go into C://0adProcessor/Scripts/SendMove.ahk. On line 35, delete the leading semicolon. Be sure to recompile SendMove.ahk or the changes will not be made. Do this by right clicking SendMove.ahk and clicking compile script. This will uncomment the sleep before every click that the script will execute. It should be noted that out-of-the-box AutoHotkey cannot maintain sleep accuracy below ~20ms (meaning all sleeps below 20ms will last 20ms) but several methods for achieving precise sleep with AutoHotkey exist online.\n\t-Second, if your 0ad is still not performant enough, you can attempt to change the map to have fewer buildings in the game. The map with the release version of Castle has 800 buildings per player. The python script used to generate the map file is contained in C://0adProcessor/Map. If you do elect to change the number of buildings in the map, you will have to change some code. In C://0adProcessor/Encoder/encoder.py, change num_buildings on line 142. In the castle source, change num_buildings in stdafx.h\n\t\n\n----------------------------------------------------------------\nExtending Castle to work over other RTS-games\n----------------------------------------------------------------\n\nIf you wish to use Castle with RTS games which are not 0 A.D., you will have to put in a few hours of work.\n\nFirst, you must select your RTS of choice. This game must have a map editor, a replay feature, and there must \nbe a crack of some sort for the replay files, online.\n\nOnce you have selected your RTS game, you can make the map. You are immediately faced with two options when \nmaking the map; immobilized units or buildings. You want to select whichever takes up less screen space.  \nThis means finding the smallest building that can create a rally point in your given game and comparing it to \nthe smallest way to immobilize any unit in your game. Once you have selected units or buildings, you place a \ngrid of them for each player, filling as much of the screen as can be used. Keep in mind that some parts of \nthe game UI may expand to cover parts of the screen and thus, you cannot use those parts of the screen for \nunits/buildings. Once you have your grids layed out, you can save the map.\n\nNext, familiarize yourself with the replay format of the game that you have selected. The units/buildings \nshould have ascending IDs from when you placed them. They may not go up by 1 every time but they should go \nup linearly. Write down the lowest and highest ID for each player, you will use this for decoding. If you \nelected to place your grid boustrophedonically, your ID system will be wonky and you will have a bit of a \nheadache for encode/decode. I suggest having your grid be ordered by rank and file (this allows for simple \nmodular arithmetic to determine the location of an index in the grid).\n\nOnce your map is set up and you are familiar with your replay system, you can modify the SendMove.ahk script.  \nPlease try to familiarize yourself with AutoHotkey before attempting to change AHK scripts; AHK has some very \ninteresting syntax.\n\nGetting deeper into Castle, you can get into changing fundamental encode/decode within Castle. In theory, all \nthat you should need to change in encoder.py, is num_buildings and the maximum number of units that can be \nselected in an encoding. Note, we randomly decide, for a given encoding of a few bytes, how many units will \nbe sent. This more evenly distributes our packet sizes and looks more like an ordinary game. What is important \nto you is that we use a maximum unit selection of 200 (the max for 0AD) and that you can use whatever number \nyou would like. The 0adProcessor code for Castle is mostly file I/O and CLI but there are some things that you \nwill want to familiarize yourself with: how moves are being sent and received in AHKHandler and FileManager. \nParticularly in AHKHandler::SendMove, there are a lot of edge case handling checks that may seem unintuitive. \nFeel free to email if you have any questions.\n\nFinally, you can remove or modify the menuing scripts and CLI from Castle, which are 0 A.D. specific.\n\nWhen modifying Castle to work with different RTS games, take note of what gets recorded in your game's replay \nfile and what doesn't. Some games store every unit selection, which drastically speeds up moves.You no longer \nneed to select some subset of units and give a command; you can simply select units in turn, never giving any \ncommands. Also take note of the unique features of your given RTS that can be used to your advantage. If you \nare really interested in this project and have the time to devote, there are generally Trigger Systems \nintegrated in most RTS games and these limit your capabilities only by your imagination.\n\n\n", 
  "id": 33808396
}