{
  "read_at": 1462511882, 
  "description": "Reproducibility repository for paper on variable-step-size SSP linear multistep methods.", 
  "README.md": "Reproducibility repository for paper on SSPLMM with variable step size.\n=======================================================================\n\nCode to reproduce numerical tests from \"Strong stability preserving linear multistep methods with variable step size\".\n\nTo run these scripts, you should have **Clawpack 5.3**.\n\nTo install Clawpack, follow the setup instructions in [Clawpack 5](http://clawpack.github.io/doc/installing.html#).\n\nAll tested problems are modifications of Clawpack's examples.\n\nFiles:\n\n- **ssp_lmm_vss.py**: Main file containing scripts that produce the data and figures of the paper.\n- **overridden_fun.py**: Pyclaw's overridden classes and functions.\n- **advection_1d.py**: solves advection 1D equation.\n- **burgers_1d.py**: solves Burgers 1D equation.\n- **woodward_colella_1d.py**: solves Woodward-Colella blast wave problem.\n- **radial_shallow_water_2d.py**: Solves 2D shallow water equations.\n- **shock_bubble_interaction_2d.py**: solves Euler equations of compressible fluid dynamics in 2D.\n\nSubdirectories:\n\n- **data**: Solution data for convergence test (Table 1) and 1D/2D problems (Figures 1 & 2).\n- **figures**: Figures 1 & 2 (also a figure for the convergence test)\n\n(Figure names correspond to the arXiv version of the paper.)\n\nThe scripts and data in the data/ subdirectory can be used to reproduce all figures from the paper.\nDetailed descriptions of the main functions are included in *ssp_lmm_vss.py*.\n\nFor example, to reproduce solution data and Figure 1, in an ipython terminal run:\n\n    import ssp_lmm_vss\n    ssp_lmm_vss.fig2_createdata()\n    ssp_lmm_vss.plot_fig2()\n\nThis saves the solution data in a binary file (.pkl) in the data/ subdirectory and creates Figure 1 in the figures/ directory.\n\nProvided the data exists, you can also just plot the figure:\n\n    import ssp_lmm_vss\n    ssp_lmm_vss.plot_fig2()\n\nBy default, this uses data stored in the subdirectory data/.\n", 
  "id": 33993624
}