{
  "read_at": 1462511649, 
  "description": "", 
  "README.md": "#3DHEB\n\n3DHEB is a graph bundling algorithm that bundles edges of a graph to reveal connectivity patterns. \n3DHEB allows to tackle large graphs (tested on graphs with 5M edges) and has low computation times when compared to other bundling algorithms. \nIn addition, it enables to specify the bundling criteria. Here, a flow criteria based on edge orientation is included in addition to the default criteria based on edge proximity.\n\n## Algorithm description\nThe algorithm is described here: [arxiv.org/abs/1504.02687](http://arxiv.org/abs/1504.02687).\n\n## Implementation\nCurrently, a basic implementation of the algorithm is provided. The code is fully compatible with Processing (Java and JavaScript). \nThis code is a simplified version of the code used in the [paper](http://arxiv.org/abs/1504.02687). Features requiring Java libraries were not included \n(e.g. multi-threading, clustering and colour tables) as well as features that did not work well in JavaScript mode  \n(e.g. polylines with varying width and colour and hardware accelerated rendering). \nThus, this implementation is slower than the original and has not got as many features, but still enables to performance very nice bundles out-of-the-box! \n\n## Online App\nA [JavaScript app](http://dcmoura.github.io/3DHEB/) is provided for making your own graph bundles.\nYou may use one of the sample graphs or your own graph in GraphML format. \nThe app includes an option to generate high resolution images that you may include in your publications. \nIf you do so, please [cite me](http://adsabs.harvard.edu/cgi-bin/bib_query?arXiv:1504.02687). Thanks! \n\n[![Online app](http://dcmoura.github.io/3DHEB/img2/js_app.png)](http://dcmoura.github.io/3DHEB/)\n\n\n## Gallery \nSome images produced with this code, and an animation based on an extension of this code.\n\n* Animation based on 3DHEB:\n[![Animation based on 3DHEB](http://dcmoura.github.io/3DHEB/img2/video_poster_3dheb_2.png)](https://vimeo.com/danielcmoura/3dheb)\n\n* US Migrations Flow - 10K edges:\n![US Migrations Flow](http://dcmoura.github.io/3DHEB/img/migrations_flow.png)\n\n* US Airlines Flow - 1K edges:\n![US Airlines Flow](http://dcmoura.github.io/3DHEB/img/airlines_flow.png)\n\n* Pattern1 from the [University of Florida Sparse Matrix Collection](http://www.cise. ufl.edu/research/sparse/matrices/) - 5M edges:\n<img src=http://dcmoura.github.io/3DHEB/img/pattern1_1.png width=\"67%\" align=\"middle\"/> \n\n\n\n", 
  "id": 34014484
}