{
  "read_at": 1462511777, 
  "description": "Automatically exported from code.google.com/p/linloglayout", 
  "Readme.txt": "LinLogLayout is a simple program for computing graph layouts\r\n(positions of the nodes of a graph in two- or three-dimensional space)\r\nand graph clusterings for visualization and knowledge discovery.\r\nIt reads a graph from a file, computes a layout and a clustering, writes\r\nthe layout and the clustering to a file, and displays them in a dialog.\r\nLinLogLayout can be used to identify groups of densely connected nodes\r\nin graphs, like groups of friends or collaborators in social networks,\r\nrelated documents in hyperlink structures (e.g. web graphs),\r\ncohesive subsystems in software models, etc.\r\nWith a change of a parameter in the <code>main</code> method,\r\nit can also compute classical \"nice\" (i.e. readable) force-directed layouts.\r\n\r\nThe program is primarily intended as a demo of the use of its core layouter\r\nand clusterer classes MinimizerBarnesHut, MinimizerClassic, and\r\nOptimizerModularity.  While MinimizerBarnesHut is faster, MinimizerClassic\r\nis simpler and not limited to a maximum of three dimensions.\r\n\r\n\r\nUsage: java LinLogLayout <dim> <inputfile> <outputfile>\r\nComputes a <dim>-dimensional layout and a clustering for the graph\r\nin <inputfile>, writes the layout and the clustering into <outputfile>,\r\nand displays (the first 2 dimensions of) the layout and the clustering.\r\n<dim> must be 2 or 3.\r\n\r\nInput file format:\r\nEach line represents an edge and has the format:\r\n<source> <target> <nonnegative real weight>\r\nThe weight is optional, the default value is 1.0.\r\n\r\nOutput file format:\r\n<node> <x-coordinate> <y-coordinate> <z-coordinate (0.0 for 2D)> <cluster>\r\n\r\n\r\nExample:\r\njava -cp bin LinLogLayout 2 examples/WorldImport1999.el WorldImport1999.lc\r\n\r\n\r\nLinLogLayout optimizes LinLog and related energy models to compute layouts,\r\nand Newman and Girvan's Modularity to compute clusterings. For more information\r\nabout LinLog and Modularity, see\r\n\r\n[1] A. Noack: \"Energy Models for Graph Clustering\",\r\nJournal of Graph Algorithms and Applications, Vol. 11, no. 2, pp. 453-480, 2007.\r\nhttp://jgaa.info/volume11.html\r\n[2] M. E. J. Newman: \"Analysis of weighted networks\", Physical Review E 70,\r\n056131, 2004.\r\n[3] A. Noack. \"Modularity Clustering is Force-Directed Layout\",\r\nPreprint arXiv:0807.4052, 2008. http://arxiv.org/abs/0807.4052\r\n\r\nFor further documentation of LinLogLayout,\r\nsee the wiki at http://code.google.com/p/linloglayout/.\r\n\r\n\r\nIf you find LinLogLayout useful, please recommend it and cite the above papers.\r\nSuggestions, questions, and reports of applications are welcome.\r\nSend them to Andreas Noack, an@informatik.tu-cottbus.de.\r\n", 
  "id": 34291270
}