{
  "read_at": 1462511607, 
  "description": "", 
  "README.md": "[![Build Status](https://travis-ci.org/lejon/PartiallyCollapsedLDA.svg?branch=master)](https://travis-ci.org/lejon/PartiallyCollapsedLDA) \nPC-LDA\n=====\nRepo for our Partially Collapsed ParallelLDA implementation described in the article [arXiv:1506.03784](http://arxiv.org/abs/1506.03784 \"arXiv:1506.03784\"): \n\n```\n   @unpublished{MagnussonJonsson2015,\n      author = \"Mans Magnusson, Leif Jonsson, Mattias Villani, David Broman\",\n      title = \"Parallelizing LDA using Partially Collapsed Gibbs Sampling\",\n      note = \"http://github.com/lejon/PartiallyCollapsedLDA\",\n      year = 2015}\n```\n\nThe toolkit is Open Source Software, and is released under the Common Public License. You are welcome to use the code under the terms of the license for research or commercial purposes, however please acknowledge its use with a citation:\n  Magnusson, Jonsson, Villani, Broman.  \"Parallelizing LDA using Partially Collapsed Gibbs Sampling.\"\n\nThe dataset (in the datasets folder) and the stopwords file (stopwords.txt, included in the repository) should be in the same folder as you run the sampler.\n\nExample Run command:\n```\njava -cp PCPLDA-X.X.X.jar cc.mallet.topics.tui.ParallelLDA --run_cfg=src/main/resources/configuration/PLDAConfig.cfg\njava -jar PCPLDA-X.X.X.jar --run_cfg=src/main/resources/configuration/PLDAConfig.cfg\n```\n\n(PCPLDA-X.X.X.jar is created in the 'target' folder by the 'mvn package' command)\n\nFor very large datasets you might need to add the -Xmx60g flag to Java\n\nPlease remember that this is a research prototype and the standard disclaimers apply.\nYou will see printouts during unit tests, commented out code, old stuff not cleaned out yet etc.\n \nBut the basic sampler is tested and evaluated in a scientific manner and we have gone to great pains to ensure that it is correct.\nThe sampler that is referred to in the article as \"PC sampler\" or \"PC-LDA\" corresponds to the class 'cc.mallet.topics.SpaliasUncollapsedParallelLDA' in the code. The variable selection parts are implemented in the 'cc.mallet.topics.NZVSSpaliasUncollapsedParallelLDA' class.\n\nAn example of a \"main\" class is cc.mallet.topics.tui.ParallelLDA\n\n## Installation\n\n1. Install Apache Maven and run:\n\n```mvn package```\n\nin bash.\n\nOccationally some of the \"probabilistic\" tests fail due to random chance. This is ok in a statistical sense but not for a test suite so this should eventually be tuned. For now if the suite is re-run it should be ok.\n\n\n## Public DOI\n[![DOI](https://zenodo.org/badge/13374/lejon/PartiallyCollapsedLDA.svg)](http://dx.doi.org/10.5281/zenodo.18102)\n\n", 
  "id": 34328215
}