{
  "read_at": 1462511890, 
  "description": "A Python package to evolve hierarchical triples in the secular approximation", 
  "README.md": "# Kozai\n\nKozai is a Python package to evolve hierarchical triples in the secular\napproximation.  Hierarchical triples may be evolved either using the\nDelaunay formalism (Naoz et al. 2013b) or the vectorial formalism (Katz et\nal. 2011).  The quadrupole, octupole, and hexadecapole terms of the\nHamiltonian may be toggled to be included (or not) in the equations of\nmotion.  Post-Newtonian terms may also be toggled to include both\nrelativistic precession (PN 1) and gravitational radiation (PN 2.5) using\nterms from Blaes et al. (2002). \n\nThe package provides a TripleDelaunay object which may be integrated using\nthe Delaunay orbital elements and a TripleVectorial which may be integrated\nusing the eccentricity and angular momentum vectors.  This allows the\nintegration to occur within the context of an external Python program.\n\nThe underlying integrator is from the SciPy ODE package.  By default this\npackage uses VODE as its integration algorithm, but the algorithm may be\nchanged to any of the other integration algorithms supported by the SciPy\nODE package.\n\n## Installation\n\nThe Kozai package is available on PyPI and can be installed with pip:\n\n```\npip install kozai\n```\n\nOr, if you do not have the permissions to run the above:\n\n```\npip install --user kozai\n```\n\n## Tutorial\n\nAn IPython notebook tutorial is in the docs folder.  The tutorial can be\nalso be accessed online [here.][1]\n\n## Dependencies\n\n-  NumPy\n-  SciPy\n\n## References\n\n- [Antognini, 2015, ArXiv 1504.05957][5]\n- [Blaes, O., Lee, M.H., & Socrates, A., 2002, ApJ, 578, 775][2]\n- [Katz, B., Dong, S., & Malhotra, R., 2011, PhRvL, 107, 181101][3]\n- [Naoz, S., Farr, W.M., Lithwick, Y., Rasio, F.A., & Teyssandier, J., 2013b,\n  MNRAS, 431, 2155][4]\n\n[1]: http://nbviewer.ipython.org/url/www.astronomy.ohio-state.edu/~antognini/kozai_tutorial.ipynb\n[2]: http://adsabs.harvard.edu/abs/2002ApJ...578..775B\n[3]: http://adsabs.harvard.edu/abs/2011PhRvL.107r1101K\n[4]: http://adsabs.harvard.edu/abs/2013MNRAS.431.2155N\n[5]: http://arxiv.org/abs/1504.05957\n", 
  "id": 34411413
}