{
  "read_at": 1462547096, 
  "description": "Paper downloader is a simple chrome plugin which helps to download files from digital libraries with human readable file names. Feel free to ask to add support for your favorite site.", 
  "README.md": "# Paper downloader\nPaper downloader is a simple chrome plugin which helps to download files from digital libraries with human readable file names.\nFor example, when you download file from arxiv.org, you get something looks like \"1234.5678.pdf\".\nWith this plugin, you get file named \"%AUTHOR\\_NAME% - %PAPER\\_NAME%.pdf\" instead.\n\n## How it works\nPlugin adds it's own handler to \"onclick\" event on download link. When you click it, the file is downloaded to HTML5 Filesystem, and then it opens from thence.\n\nCommon functions for all sites are in **common.js** file. They are\n\n * ```download_file(nice_name, url, callback)```, where *nice_name* is name which file will get, *url* is url for original file, and *callback* is function, which will be called after downloading.\nNote, that if file will be opened instead of saving (for PDF, for example), this function wiil not be called.\n\n * ```process_link_click(authors, title, type, $link)```, where *authors* and *title* are strings, *type* is file extension, and *$link* is jQuery object for download link. This function adds \"(loading)\" to link text, and removes it after download.\nProbably, you should to use this function instead of call ```download_file``` directly, because in the second case you should manually to show user, that download is in progress.\n\n## How to write a script for another site\n1. Write a script for your site.\nProbably, it has to add an ```onclick``` event handler to download links, and call ```process_link_click``` for them.\nUsing jQuery for DOM traversing is recommended.\n\n2. Modify **manifest.json**: add your site to ```permissions```, and your site and script to ```content_scripts```.\n\n3. You can test it, using ```Load unpacked extension``` function in chrome. Read [chrome extensions tutorial](http://code.google.com/chrome/extensions/getstarted.html) for more information.\n\n4. (optional) Create a pull request with your script. In this case, file with your script should have name like *script_yoursite.com.js*. If you'll do it, your changes will appear in webstore after I'll check them.\n", 
  "id": 3444658
}