{
  "id": 3452220, 
  "read_at": 1462547073, 
  "README.rst": "###########################\nSelectedPapers.net Overview\n###########################\n\nOpen Scientific Sharing with No Walls\n-------------------------------------\n\n`SelectedPapers.net <https://selectedpapers.net>`_ \nlets you recommend papers, comment on them, \ndiscuss them, or simply add them to your reading list.  \n\nBut instead of \"locking up\" your comments within its own \nwebsite - the \"walled garden\"\nstrategy followed by other services - it explicitly shares \nthese data in a way that people *not* on SelectedPapers.net\ncan easily see.  Any other service can see and use them\ntoo.  It does this by using *existing* social networks \nsuch as Google+, so users of those social networks can see your\nrecommendations and discuss them, \neven if they've never heard of SelectedPapers.net.\n\nFor example, if you're a Google+ user, you post comments\non SelectedPapers.net using your usual Google+ identity\nand posting process,\nwith key hashtags automatically added to identify the\npaper you are discussing.  And of course your post will be\nseen by your usual Google+ audience -- in addition to people\nwho see it on SelectedPapers.net.\n\nSo: if you want to strip the idea down to one sentence, it's this:\ngiven that social networks already exist, all we need\nfor truly open scientific communication is a \n`convention on a consistent set of tags and IDs <http://docs.selectedpapers.net/hashtags.html>`_ for\ndiscussing papers.  That makes it possible to integrate\ndiscussion from *all* social networks -- big and small -- \nas a single unified forum.\n\nGetting Started\n---------------\n\nTo see how it works, take a look here:\n\nhttps://selectedpapers.net.\n\nUnder 'Recent activity' you'll see comments and recommendations\nof different papers, so far mostly on the arXiv.  \n\nRight now SelectedPapers.net works\nwith Google+.  Support for other social networks such as Twitter\nis coming soon.  But here's how you can use it now:\n\n* We suggest that you first create (in your Google+ account) a Google+ Circle \n  specifically for discussing research with (e.g. call it \"Research\"),\n  unless you already have such a circle.\n\n* Click **Sign in with Google** on https://selectedpapers.net or on  a paper discussion page.\n\n* The usual Google sign-in window will appear (unless you are already signed  in).   \n  Google will ask if you want to use the Selected Papers network,\n  and specifically for what Circle(s) to let it see the membership\n  list(s) (i.e. the names of people you have added to that Circle).\n  SelectedPapers.net uses this as your initial \"subscriptions\",\n  i.e. the list of people whose recommendations you want to receive.\n  You should include all Circles that contain researchers who work\n  in your field (including your new Research Circle, if you created one).\n\n  Note the only information\n  you are giving SelectedPapers.net access to is this list of names;\n  in all other respects SelectedPapers.net is limited by Google+\n  to the same information that anyone on the internet can see,\n  i.e. your *public* posts.  For example, SelectedPapers.net cannot\n  ever see your private posts within *any* of your Circles.\n\n* Now you can initiate and join discussions of papers\n  directly on any SelectedPapers.net page.\n\n* Alternatively, without even signing in to SelectedPapers.net,\n  you can just write posts on Google+ containing the hashtag **#spnetwork**,\n  and they will automatically be included within the SelectedPapers.net\n  discussions (i.e. indexed and displayed so that other people can\n  reply to them etc.).\n  Here's an example of a Google+ post example::\n\n    This article by Perelman outlines a proof of the Poincare conjecture!  \n\n    #spnetwork #mustread #geometry #poincareConjecture arXiv:math/0211159\n\n  You need the tag **#spnetwork** for SelectedPapers.net to notice your post.  Tags like \n  **#mustread**, **#recommend**, and so on indicate your attitude to a paper. Tags like **#geometry**, \n  **#poincareConjecture** and so on indicate a subject area: they let people search for papers\n  by subject.  A tag of the form **arXiv:math/0211159** is necessary for arXiv papers; \n  note that this does *not* include a # symbol.   \n\n  For PubMed papers, include a tag of the form **PMID:22291635**.  Other published papers usually\n  have a DOI (digital object identifier), so for those include a tag of the form **doi:10.3389/fncom.2012.00001**.\n\n  Tags are the backbone of SelectedPapers.net; you can read more about \n  them `here <http://docs.selectedpapers.net/hashtags.html>`_.\n\n* You can also post and see comments at https://selectedpapers.net.  This page also\n  lets you search for papers in the arXiv and search for published papers via their DOI \n  or Pubmed ID.  If you are signed in, the homepage will also show the latest recommendations \n  (from people you're subscribed to), papers on your reading list, and papers you tagged as \n  interesting for your work.\n\nPapers\n------\n\nPapers are the center of just about everything here.\nHere's what you can do with a paper:\n\n* click to see the full text of the paper via arXiv.org or\n  the publisher's website.\n\n* read other people's recommendations and discussion of the paper.\n\n* add it to your **Reading List**.  This is simply a private list\n  of papers -- a convenient way of marking a paper for further\n  attention later.  When you are logged in, your Reading list\n  is shown on the homepage.  No one else can see your reading list.\n\n* **share** the paper with others (such as your Google+ Circles or \n  Google+ communities that you are part of).\n\n* **tag** it as interesting for a specific topic.  You do this either\n  by clicking the checkbox of a topic (it shows topics that other\n  readers have tagged the paper), by selecting from a list of\n  topics that you have previously tagged as interesting to you,\n  or by simply typing a tag name.  These tags are public; that\n  is, everyone can see what topics the paper has been tagged with,\n  and who tagged them.\n\n* **post** a question or comment about the paper, or **reply** to\n  what other people have said about it.  This traffic is public.\n  Specifically, clicking the Discuss this Paper button\n  gives you a Google+ window (with appropriate tags\n  already filled in) for writing a post.  Note that in order\n  for the spnet to see your post, you **must** include Public in\n  the list of recipients for your post (this is an inherent limitation\n  of Google+, which limits apps to see only the\n  same posts that *any* internet user would see -- even when you\n  are *signed-in* to the app as yourself on Google+).\n\n* **recommend** it to others.  Once again, you **must** include Public in\n  the list of recipients for your post, or the spnet cannot see it.\n\n\n  We strongly suggest that you include a\n  **topic hashtag** for your research interest area.  E.g. if there\n  is a hashtag that people in your field commonly use for\n  posting on Twitter, use it.  If you have to make up a new\n  hashtag, keep it intuitive and follow \"camelCase\" capitalization\n  e.g. #openPeerReview.\n\n\nOpen Design\n-----------\n\nNote that thanks to our open design, you do not even need\nto create a SelectedPapers.net login.  Instead, SelectedPapers.net\nauthenticates with Google (for example) that you are signed in\nto Google+; you never give SelectedPapers.net your Google\npassword or access to any confidential information.  \n\nMoreover, even when you are signed in\nto SelectedPapers.net using your Google sign-in,\nit cannot see any of your private posts, only those\nyou posted publicly - in other words, exactly the same \nas what anybody on the Internet can see.  \n\n\n\n\n", 
  "description": "selected papers network web engine"
}