{
  "read_at": 1462511770, 
  "description": "Computing with Eigenvalue Distributions of Large Random Matrices of the Covariance Type", 
  "README.md": "# EigenEdge\nComputing with Eigenvalue Distributions of Large Random Matrices\n\nThe **EigenEdge** MATLAB package contains open source implementations \nof methods for working with eigenvalue distributions of large random matrices \nof the covariance type (known as general Marchenko-Pastur distributions). \n\n\n## Contents \n\n* a documentation with examples: `\\Readme\\readme.pdf`\n* the SPECTRODE method to compute the limit empirical spectrum of sample covariance matrices (equivalently: compute the Marchenko-Pastur forward map) \n* methods to compute moments and quantiles of the limit spectrum \n* optimal linear spectral statistics (LSS) for testing in Principal Component Analysis\n\n## Additional contents\n\nThis package also has the software to reproduce the computational results of the following papers of the author: \n* Dobriban. E,  *Efficient Computation of Limit Spectra of Sample Covariance Matrices*, Random Matrices: Theory Appl., 04, 1550019 (2015). http://arxiv.org/abs/1507.01649\n* Dobriban. E,  *Sharp detection in PCA under correlations: all eigenvalues matter*, http://arxiv.org/abs/1602.06896\n\n## Installation\n\nFor full notes on installing the package, please see the readme. \n\n##Additional notes\nThis package is work in progress. Suggestions and comments are welcome.\nAn R version is under development, and is available from https://github.com/dobriban/Spectrode-R/\n\n#Example\nA typical example eigenvalue distribution computed with this software looks as follows: \n![Alt text](https://github.com/dobriban/EigenEdge/blob/master/Experiments/Examples/Illustration_mixture_3.png?raw=true \"Optional Title\")\nThis example is explained in detail in the readme at `\\Readme\\readme.pdf`. The input is the distribution of population eigenvalues, which is a mixture of point masses and a uniform density. The output is the distribution of sample eigenvalues, which has a smooth density on several disjoint intervals. There is a close match with a Monte Carlo simulation.\n\n", 
  "id": 34600884
}