{
  "read_at": 1462511547, 
  "description": "The testing code for deep contour detector", 
  "readme.txt": "###################################################################\n#                                                                 #\n#    Deep Contour Detector                       #\n#    Wei Shen (wei.shen@t.shu.edu.cn)                          #\n#                                                                 #\n###################################################################\n\n1. Introduction.\nThis is the testing code for the Deep Contour Detector proposed in\n\nWei Shen, Xinggang Wang, Yan Wang, Xiang Bai, Zhijiang Zhang. \nDeepContour: A Deep Convolutional Feature Learned by Positive-sharing Loss for Contour Detection. \nIEEE Conference on Computer Vision and Pattern Recognition (CVPR), Boston, USA, 2015.\n\nThis code is modified from Piotr Dollar's Structured Edge Detection Toolbox [1,2].\n\n\n###################################################################\n\n2. License.\n\nPlease follow the license terms included in Structured Edge Detection Toolbox [1,2] and Caffe Deep Learning Toolbox [3].\n\n\n###################################################################\n\n3. Installation.\n\na) This code is written for the Matlab interpreter (tested with versions R2014a on Windows 7) and requires the Matlab Image Processing Toolbox and CUDA Toolkit (version 6.0 or later). \n\nb) First, download the binary dependencies from https://drive.google.com/file/d/0BwU2lgiGMpBmQmpGT3BudmV2Yms/view?usp=sharing and unzip them into the folder \"bin\".\n\nc) Additionally, Piotr's Matlab Toolbox and Piotr's Structured Edge Detection Toolbox are also required. They can be downloaded at:\n http://vision.ucsd.edu/~pdollar/toolbox/doc/index.html and https://github.com/pdollar/edges respectively.\n\nd) Finally, optionally download the BSDS500 dataset (necessary for evaluation):\n http://www.eecs.berkeley.edu/Research/Projects/CS/vision/grouping/\n After downloading BSR/ should contain BSDS500, bench, and documentation.\n\ne) A fully trained deep contour model (deep_contour_model) for RGB images is available as part of this release. The architecture of the used deep network is described in deploy_cov4.prototxt.\n\n###################################################################\n\n4. Getting Started.\n\n - Make sure to carefully follow the installation instructions above.\n - Please run \"Entry_DeepStructureEdge.m\". \n - The default parameter setting leads to 0.75 F-measure on BSDS500. \n   To achieve 0.76 F-measure, set \"model.opts.nTreesEval=10\" and \"model.opts.multiscale=1\" in \"edgesDLDemo.m\". Note that, the evaluation process under this setting is very time consuming.\n\n###################################################################\n\n5. Reference.\n\n[1] P. Dollar and C. L. Zitnick. Structured forests for fast edge detection. In Proc. ICCV, pages 1841-1848, 2013.\n\n[2] P. Dollar and C. L. Zitnick. Fast edge detection using structured forests. arXiv preprint arXiv:1406.5549, 2014.\n\n[3] Y. Jia, E. Shelhamer, J. Donahue, S. Karayev, J. Long, R. Girshick, S. Guadarrama, and T. Darrell. Caffe: Convolutional\narchitecture for fast feature embedding. arXiv preprint arXiv: 1408.5093, 2014.\n###################################################################\n", 
  "id": 34653257
}