{
  "read_at": 1462511912, 
  "description": "Relative data structures based on the BWT", 
  "README.md": "# Relative FM-index\n\nThis is an implementation of the Relative FM-index (RFM) and the Relative Compressed Suffix Tree (RCST). [The early implementatation](http://jltsiren.kapsi.fi/relative-fm) is available elsewhere.\n\nTo compile, install the [Succinct Data Structures Library 2.0](https://github.com/simongog/sdsl-lite) and set `SDSL_DIR` in the makefile to point to the SDSL directory. The implementation uses OpenMP, libstdc++ parallel mode, and C++11, so g++ 4.7 or newer is required.\n\n## Compilation options\n\nThe maximum resident size reported by `getrusage()` is in kilobytes in Linux and in bytes in OS X. By default, the implementation assumes Linux-like behavior. To get the correct memory usage reports in OS X, uncomment the line `RUSAGE_FLAGS=-DRUSAGE_IN_BYTES` in the makefile.\n\nBy default, the test programs will produce minimal output. To change this, add `-DVERBOSE_OUTPUT` and/or `-DVERBOSE_STATUS_INFO` to `VERBOSE_FLAGS` in the makefile. The first option will add more detailed output to `stdout`, while the second option prints additional status information to `stderr`.\n\nOther flags may or may not work correctly if changed from the defaults.\n\n## Test programs\n\nThe following programs generally depend on the output produced by the earlier ones in the list:\n\n* `mutate` creates synthetic document collections, as described in the paper. Example: `mutate source target 0.001`.\n* `build_bwt` builds the BWT for one or more input files. It can also be used to build the LCP array and to sample SA/ISA.\n* `index_dlcp` builds an index for the DLCP array of the reference, given its LCP array. The index is used when building the RLCP array.\n* `align_bwts` builds RFM and RCST. The relevant options are `-i` (build a full RFM instead of a basic RFM) and `-L` (also build the RLCP array).\n* `query_test` queries one or more indexes with the given pattern file, where the patterns are listed one per line. The most relevant index types are `sp` (SSA) and `rpp` (RFM index built with `align_bwts`). Tag `b` allows using other RFM types, while tags `L` and `L V` change the type of queries executed.\n* `cst_traverse` and `cst_compare` were used for the CST experiments (traversal and matching statistics) in the paper. These programs will reuse the SDSL compressed suffix trees and relative select structures built during earlier executions.\n\nThese programs are technical and/or obsolete:\n\n* `test_rlz` and `verify` can be used for verifying and/or timing various RLZ options and queries.\n* `build_rlzfm` and `lcs` have been abandoned and may not work at all.\n\n\"Base name\" is the name of the input file, \"ref\" is the base name of the reference sequence, \"seq\" is the base name of a target sequence, and \"paper\" refers to the RCST paper in subdirectory `rcst`. When different structures are stored on disk, extensions that depend on the type of the structure are appended to the base name.\n\n## Datasets\n\nThe following datasets have been used in the articles based on the relative FM-index:\n\n* The 1000 Genomes Project version of the GRCh37 assembly of the human reference genome: ftp://ftp-trace.ncbi.nih.gov/1000genomes/ftp/technical/reference/\n* The genome of a Han Chinese individual from the YanHuang project: ftp://public.genomics.org.cn/BGI/yanhuang/fa/\n* The genome of the 1000 Genomes Project individual NA12878: http://sv.gersteinlab.org/NA12878_diploid/\n* Read set `ERR019904_1` of the 1000 Genomes Project individual HG00122: ftp://ftp.1000genomes.ebi.ac.uk/vol1/ftp/data/HG00122/sequence_read/\n\n## Future development\n\n* RLZ pointer encoding: use the new generalized RLZ.\n  * Both for `RelativeLCP` and `RLZFM`.\n* Optimizations:\n  * In `RelativeFM::inverse()`, position *i-1* can provide faster access to *ISA[i]*, if it is an lcs-position.\n  * In `increasingSubsequence()`, we could use binary search (or an index) in the left/right match arrays, instead of storing the values in arrays `smallest` and `previous`.\n  * RLCP construction may not need separate LCP and DLCP arrays.\n  * Left and right matches do not have to be adjacent to the current suffix in the mutual suffix array. The original definition used the nearest suffix (of the target sequence) on one side and the adjacent suffix on the other side. Could we use the nearest suffix on both sides?\n  * Specialized `getComplement()` for `RLSequence`.\n  * Could it be more space-efficient to store the leaf values in the RLCP minimum tree relative to their parents?\n* Implementation:\n  * Clean up the code and remove unnecessary experimental ideas.\n  * Use class-specific `size_type` instead of `uint64_t` when possible.\n  * Add copy constructors, assignment operators etc. to the classes.\n  * Switch to SDSL structures as references.\n* RLZ bitvector:\n  * Not all structures are required for all queries. Try moving them to rank/select support structures.\n  * Implement full decompression.\n* Alternative solutions:\n  * `hyb_vector` could work well in LCS bitvectors, once it supports select queries.\n  * Gap encoded / run-length encoded bitvectors with Huffman coded gap lengths could be useful somewhere (see Nicola Prezza: A Compressed-Gap Data-Aware Measure for Indexable Dictionaries).\n  * Finding bwt-invariant subsequences using SA instead of CSA.\n  * A basic RFM index for *S* can be build directly by backward searching for *S* in the reference index.\n  * RFM index relative to GCSA.\n  * Relative CST-Sada: RLZ bitvectors for suffix tree topology and PLCP.\n  * A relative version of the rabge min-max tree used in the CST-npr for repetitive collections (see Andres Abeliuk, Rodrigo Canovas, and Gonzalo Navarro: Practical Compressed Suffix Trees).\n\n## References\n\nDjamal Belazzougui, Travis Gagie, Simon Gog, Giovanni Manzini, and Jouni Siren: **Relative FM-indexes**.\nProc. SPIRE 2014, Springer LNCS 8799, pp. 52-65, Ouro Preto, Brazil, October 20-22, 2014.\n[DOI: 10.1007/978-3-319-11918-2_6](http://dx.doi.org/10.1007/978-3-319-11918-2_6)\n\nChristina Boucher, Alexander Bowe, Travis Gagie, Giovanni Manzini, and Jouni Siren: **Relative Select**.\nProc. SPIRE 2015, Springer LNCS 9309, pp. 149-155, London, UK, September 1-3, 2015.\n[DOI: 10.1007/978-3-319-23826-5_15](http://dx.doi.org/10.1007/978-3-319-23826-5_15)\n\nTravis Gagie, Gonzalo Navarro, Simon J. Puglisi, and Jouni Siren: **Relative Compressed Suffix Trees**.\n[arXiv:1508.02550](http://arxiv.org/abs/1508.02550)\n", 
  "id": 34784961
}