{
  "read_at": 1462558586, 
  "description": "C++ library to pack and unpack vectors of integers having a small range of values using a technique called Frame of Reference (Goldstein et al. 1998).  It should run fast even though it is written in simple C++.", 
  "README.md": "# Frame of Reference (FOR) C++ library\n[![Build Status](https://travis-ci.org/lemire/FrameOfReference.png)](https://travis-ci.org/lemire/FrameOfReference)\n\n## What is this?\n\nC++ library to pack and unpack vectors of integers having a small\nrange of values using a technique called Frame of Reference (Goldstein et al. 1998). \nIt should run fast even though it is written in simple C++.\n\n##  Usage:\n\nTo run a simple benchmark, do \n     \n     make\n     ./test sampledata.txt\n\nwhere sampledata.txt is a text data file with one integer per line.\n\nFor a parallelized version, type\n\n     make testmp\n     ./testmp sampledata.txt\n\nThis requires OpenMP support however.\n\n## Requirements:\n\nThis was tested with GNU G++ and clang++ After suitable adjustments, it should\nbuild under most C++ compilers.\n\n\n## References\n\n* Goldstein J, Ramakrishnan R, Shaft U. Compressing relations and indexes. Proceedings of the Fourteenth International Conference on Data Engineering, ICDE '98, IEEE Computer Society: Washington, DC, USA, 1998; 370-379.\n* Daniel Lemire and Leonid Boytsov, Decoding billions of integers per second through vectorization, Software Practice & Experience 45 (1), 2015.  http://arxiv.org/abs/1209.2137 http://onlinelibrary.wiley.com/doi/10.1002/spe.2203/abstract\n* Daniel Lemire, Leonid Boytsov, Nathan Kurz, SIMD Compression and the Intersection of Sorted Integers, Software Practice & Experience 46 (6), 2016. http://arxiv.org/abs/1401.6399\n* Jeff Plaisance, Nathan Kurz, Daniel Lemire, Vectorized VByte Decoding, International Symposium on Web Algorithms 2015, 2015. http://arxiv.org/abs/1503.07387\n* Wayne Xin Zhao, Xudong Zhang, Daniel Lemire, Dongdong Shan, Jian-Yun Nie, Hongfei Yan, Ji-Rong Wen, A General SIMD-based Approach to Accelerating Compression Algorithms, ACM Transactions on Information Systems 33 (3), 2015. http://arxiv.org/abs/1502.01916\n", 
  "id": 34905043
}