{
  "read_at": 1462558713, 
  "description": "Entailment rules extracted from RTE datasets using a modified Robinson Resolution algorithm", 
  "README.md": "\nOverview\n----------------\nThis is a list of entailment rules that are extracted from the RTE part of the SICK dataset (http://alt.qcri.org/semeval2014/task1/). \nLogical inference + perfect predictions for these rules give near perfect score in SICK RTE. \nFor more details, check our paper: *Representing Meaning with a Combination of Logical Form and Vectors*. \n\n\nDownload\n----------------\nThe releases of this dataset can be downloaded from here: https://github.com/ibeltagy/rrr/releases\n\n\nCite\n----------------\nIf you use this dataset in your work, please cite our paper: \n\n    @article{beltagy:arxiv15, \n    title = {Representing Meaning with a Combination of Logical Form and Vectors}, \n    author = {Islam Beltagy and Stephen Roller and Pengxiang Cheng and Katrin Erk and Raymond J. Mooney}, \n    journal={arXiv preprint arXiv:1505.06816 [cs.CL]},\n    url=\"http://www.cs.utexas.edu/users/ai-lab/pub-view.php?PubID=127513\",\n    year={2015}\n    }\n\nLicense\n----------------\nThis data set is released under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 \nUnported License (http://creativecommons.org/licenses/by-nc-sa/3.0/deed.en_US)\n\n\nContents\n----------------\nThe dataset has 12,508 rules, 10,211 are unique. Rules are split into training and testing, extracted from the training and testing parts of SICK respectively. Rules have three types, Entail, Neutral and Contradict. \n\n\nFiles format\n----------------\nEach file has the following columns: \n\n- ruleID: an ID\n\n- pairIndex: ID of the RTE pair where the rule is extracted from\n\n- annotation: rule types: 1, 0 and -1 for Entail, Neutral and Contradict\n\n- ruleLhs: the LHS of the rule. Each word is followed with **-i** where **i** is the index of the word in the source sentence\n\n- ruleRhs: the RHS of the rule\n\n- text: the Text where ruleLhs is extracted from\n\n- hypothesis: the Hypothesis where ruleRhs is extracted from\n\n\nNotes and Future Work \n----------------\n\n- Some words are dropped from the rules, like {a, an, the, is, are, and}\n\n- Words in a rule are not necessary consecutive in the sentence, but most porbably connected syntactically\n\n- Few rules are wrong because of parsing errors and limitations in our Robinson Resolution algorithm\n\n- Some rules are duplicated. Few rules (around 100) are duplicated with different rule types. This is because of inconsistencies in the annotations of the SICK dataset (remember that most of the rules are automatically annotated using the gold standard annotation for the pair where the rule is extracted from). For example, the relation between \"flute\" and \"guitar\" could be Entail but in most cases it is Neutral.\n\n- Some rules are long and they can be split into multiple shorter and simpler rules. We leave that for future releases. \n", 
  "id": 35774880
}