{
  "read_at": 1462558696, 
  "description": "Main repository for sharing files and documents about OpenDreamKit", 
  "README.md": "===========================================================\nMain repository for the OpenDreamKit H2020 European project\n===========================================================\n\n- Website: [OpenDreamKit.org](http://www.OpenDreamKit.org)\n- Proposal files: [Proposal/](Proposal/)\n- Proposal evaluation: [ProposalEvaluation/](ProposalEvaluation/)\n- E-Concertation with other H2020 E-infrastructure projects: [EConcertation/](EConcertation/)\n- [![Join the chat at https://gitter.im/OpenDreamKit/discuss](https://badges.gitter.im/Join%20Chat.svg)](https://gitter.im/OpenDreamKit/discuss?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=badge)\n\n# Instructions for participants\n\n## General recommendations\n\n- Use existing infrastructure whenever possible (e.g. Sage's trac\n  server), and in particular when contributing to existing software.\n\n- Use ODK's github organisation for most public ODK specific\n  infrastructure.\n\n## Advertise ODK's activities\n\nAdd a post in the [news](http://opendreamkit.org/news/) or [activities](http://opendreamkit.org/activities/) pages of the website or an entry in the [events](http://opendreamkit.org//) section.\n\nTypically a talk at a conference goes in the activities section while an ODK workshop (or related workshop) goes in the events section.\n\n## Acknowledge ODK's support\n\nSee our [Acknowledgement web page](http://opendreamkit.org/acknowledge/)\n\n## Finance  best practice\n\nThe Commission attracts our attention to the most common errors identified in cost claims:\n\n- Costs claimed that are not substantiated or are not linked to the project\n- Third parties and sub-contracting\n- Depreciation\n- Indirect cost models\n- Indirect costs - Ineligible costs included in the pool of indirect costs\n- Personnel costs - Calculation of productive hours\n- Personnel costs - Charging of hours worked on the project\n- Personnel costs - Use of average personnel costs\n- Payment of salaries to owner/managers of SMEs\n- VAT (VAT IS INELIGIBLE!)\n\nFor the full version delivered by the Commission, click [here](avoid-finance-errors_en.pdf)\n\n## OpenAccess process\n\nThe Universite Paris-Sud published an information sheet on openaccess best practices. You can find the information, in French, [here](Horizon2020_et_OpenAccess_french.pdf).\n\nHowever an internal process has been set up (cf Data management Plan)\n\nPartners will be following the process explained below. The lead partner of the publication takes responsibility for the openaccess process for peer-reviewed publications.\n\n#### Publication in the journal of their choice:\n\nPartners must be keeping in mind the Commission asks not to accept more than 6 month embargo (to check the publishers' policies use http://www.sherpa.ac.uk/romeo/)\n\n#### Give openaccess to all peer-reviewed publications, with a max. of 6 months embargo.\n\n- Partners upload publications on http://arxiv.org/, or on another openaccess platform of their choice\n\n- Warn the Coordinator so that they keep list of publication of OpenDreamKit publications updated on the project website\n\n\n#### Data related to open access publications\n\nThe lead partner of a publication will send to the Project Manager all the data related to the peer-reviewed publication once it is given full openaccess. Data related to a publication are all the data needed to reexamine the research leading to the publication.\nThe Project Manager will publish the data linked to publications on http://zenodo.org/. Thanks to the publications' DOIs, the data will be linked to publications. \n\n#### Openaire\n\nOnce publications are published on an openaccess platform and their data published on Zenodo, the OpenAire website will be linkage between them. All OpenDreamKit published work will be present on this webpage: \nhttps://www.openaire.eu/search/project?projectId=corda__h2020::1930bdaa9032dd5b34f25841ebf3e8d1\n\nIn order for publications and data to appear on this website, one must state when completing forms on the openaccess paltform (such as ArXiv) and Zenodo websites that the concerned work is being financed by Horizon 2020 project number 676541.\n\n## Project discussions\n\n- The few private discussions (that involve for example nominative\n  information) should occur on the relevant private mailing list\n  (steering committee, coordination team, ...; see our\n  [contact web page](http://opendreamkit.org/follow/)).\n\n  Please make sure any private information is encrypted, especially\n  given that some of us use gmail.\n\n- Fine grained public discussions should go on github issues, with\n  notices to the appropriate teams and persons.\n\n- When an important such discussion is started, a notice shall be sent\n  to participants@opendreamkit.org.\n\nDesign goals:\n\n- As much as possible of the discussions is public, centralized,\n  easily searchable, linkable, etc.\n\n- People can keep a broad eye view on action happening in other work\n  packages, without being flooded by e-mail / notices.\n\n## Sharing and collaborating on documents\n\nYou can use this repository (or that of the web page when relevant) to\ncollaborate on public documents. There is a subdirectory for each work\npackage.\n\nPrivate documents can be shared using the private repositories of the\nrelevant body:\n\n- https://github.com/OpenDreamKit/Steering\n- https://github.com/OpenDreamKit/Site-leaders  # Do we need this one?\n- https://github.com/OpenDreamKit/Coordinator\n- https://github.com/OpenDreamKit/Coordination\n- https://github.com/OpenDreamKit/Advisory\n- https://github.com/OpenDreamKit/Participants\n\n## Progress tracking\n\nEach ODK task and deliverable is modelled by a public github\nissue. They are accessible from the sidebar of our web\npage. Furthermore each deliverable is attached to a milestone for\ntracking its deadline (Month xxx of the project).\n\nThe purpose of those issues is:\n\n- To keep track of our progress, both for ourselves, but also for\n  outsiders and for our *EU reviewers*.\n\n- To host discussions\n\nA first draft of each issue was created automatically using the\nmetadata produced in Proposal/final.pdata. It should be further edited\nand maintained.\n\nThe issue should be assigned to whoever will be leading it (by\ndefault: the work package leader).\n\nThe first comment of the issue should contain:\n- a description of the task (taken from the proposal) or deliverable\n- a brief status overview\n- crosslinks to the corresponding task/deliverables\n- todo list, sketch of plan, references to relevant resources on the\n  web, @mentions of people that could/should be involved.\n\n  Whenever possible, this includes creating issues/tickets on the\n  tracking systems of the relevant systems.\n\nFor examples, see #50, #87, #72.\n\nAlternatively, when natural, the issue can be just a pointer to an\nissue of the relevant software where the actual discussion happens.\nIn this case, only ODK specific info (link to task, delivery date,\n...) needs to be on the issue.\n\n## Submitting a deliverable\n\nFor each deliverable, a report should be written and submitted to the\nEU portal. Please write the report in latex in WPX/DY.Z/report.tex using\nthe our [style file](Proposal/LaTeX-proposal/deliverablereport.cls).\nFor deliverables that are not reports by themselves, and assuming the\nstatus and tracking information is properly written on the github\nissue, it's appropriate to have a very short report containing just a\nlink to that issue. The style file makes this trivial. See\n[WP1/D1.1/report.tex](WP1/D1.1/report.tex) for an example.\n\nTo submit, login on the [EU portal](http://ec.europa.eu/research/participants/portal/)\nand go to My Projects, Manage Project, Continuous Reporting Data, Deliverables.\nUploading a pdf failed for me with firefox (Nicolas); it worked with\nchromium, or with firefox by wrapping the pdf in a zip file.\nI haven't checked yet whether any participant can submit a deliverable\nor if it has to go through the coordinator.\n\nThen send a notice to participants@opendreamkit.org.\n\n## Organizing a workshop\n\n- Create an issue to discuss the organization of the workshop (choosing the date, ...)\n- Propose potential dates with potential participants using Framadate/Doodle or any likewise tool -> Send a first mail to participants@opendreamkit.org / community@opendreamkit.org announcing the plan to organize the workshop.\n- Decide the date as early as possible (at least 2 months before workshop) -> send a second mail when date is fixed\n- Build the agenda  thanks to the related github issue (Coordination Team and the organiser create the agenda for a steering committee meeting)\n- Send the agenda and an invitation to the event to all participants\n- Use the repository [http://OpenDreamKit.github.io/meetings/](http://OpenDreamKit.github.io/meetings/)\n  to host the web page and public documents about each meeting\n- Run regular oral status reports\n- Prepare a written report\n- Set up a survey at the end of each workshop to know how the next ones can be improved\n\nFor ODK, but also for all of those that are watching with hope over\nour shoulders, it's important to write useful reports on our work\nduring the workshops. To be productive, we should write those reports\ncollaboratively and on the fly.\n\nSuggested approach: initialize the report with the list of projects,\nand put it on a collaborative pad (e.g. framapad). Then, during each\nstatus report, display the report on the screen, and ask everybody to\ntake lives notes both on the plan and what's done, directly in a\nsynthetic project-by-project form. The goal is to have a couple\nparagraphs per projects, with links to the end results. And an overall\ndebriefing.\n\n## Recommendations of Collaborative software\n\n- Chat: [http://gitter.im](http://gitter.im)\n- Video conferences: [http://appear.in](http://appear.in), [http://hubl.in](http://hubl.in), or [https://rendez-vous.renater.fr/](https://rendez-vous.renater.fr/)\n- Temporary collaborative text editing: [framapad.org](framapad.org)\n- Polls: [http://framadate.org](http://framadate.org)\n- Anonymous votes: [http://adoodle.org](http://adoodle.org)\n- Surveys: [http://limesurvey.org](http://limesurvey.org)\n- Whiteboard?\n\n## Recommendations for organizing official meetings\n\nSend official e-mail invitations XXX days to all the meeting\nparticipants, with the agenda. Those e-mails are to be kept for later\naudits (proving that the attendance was necessary).\n\nFor meetings of 4-5 people, RPC-based video conferences as above can\npossibly do the job. For a larger number of people, this does not seem\nto scale. Here are some recommendations:\n\n- Prepare a signature sheet to collect attendance\n\n- Run a test, e.g. the day before, with the exact same setup as on the\n  day of the meeting, asking all remote participants to join briefly.\n\n- Request all participants to have a wired access (not wifi).\n\n- Plan for a backup solution so that participants can join by plain\n  phone.\n\n- [Renater's Rendez Vous](https://rendez-vous.renater.fr/) might be a\n  good option as it is supposed to provide a bridge with phone\n  lines. However, at this point (February 2016), only the latest\n  development version of firefox is supported.\n\n- Explore webcast solutions as an alternative to peer-to-peer video\n  conference, so that at least remote participants can follow what's\n  going on.\n\n- Steering committee meetings: in the appropriate git repository,\n  prepare for each site, a template file for the progress report, and\n  request all partners to fill in the file in advance.\n\n- Make sure that all the support material (e.g. slides of progress\n  reports, ...) is available in advance (e.g. posted online), linked\n  from the agenda, and read by all participants before the\n  meeting. This way it is sufficient to scan quickly through them\n  during the meeting, stopping only if some point raises a discussion.\n\n- Set up a pad (e.g. on framapad) for collaborative editing of the\n  minutes during the meeting. Initialize the pad with the agenda, and\n  links to all supporting material.\n\n- Set up a chat room (e.g. gitter) to let remote participants\n  interact. Explore if the framapad's chat is good enough for that.\n\n- After the meeting, move the content of the pad into a file in the\n  relevant git repository for later editing. Whenever appropriate,\n  make this file accessible online.\n", 
  "id": 35868316
}