{
  "read_at": 1462558962, 
  "description": "Gliders’ in-browser basic soccer monitor, a web based player for RoboCup log files", 
  "README.md": "# GIBBS\nGliders' in-browser basic soccer monitor, a web based player for RoboCup log files\n\n    rcg2html converter\n\n    version: 2.0\n    Authors: Edward Moore, Oliver Obst\n    Date:    05/05/13\n    License: GPL3\n\n***********************************************\n\n1. OVERVIEW\n===================\n\n\nThis is a set of scripts to help display rcg logfiles from RoboCup\nsoccer simulation league in a web browser. The idea of this HTML5\nlogplayer is to avoid the use of flash, since compiling the original\nflash converter by Thilo Girmann requires a proprietary library that\nis no longer available. \n\nIf you find these scripts useful, e.g., for showing matches on your\nweb page, please do cite our team description report in your papers\nand/or team descriptions. This report is an extended version of the\noriginal Gliders2012 team report, the reference is as follows:\n\n\nGliders2012: Development and Competition Results\nEdward Moore, Oliver Obst, Mikhail Prokopenko, Peter Wang, Jason Held\narXiv:1211.3882\nhttp://arxiv.org/abs/1211.3882\n\n\nIt's perfectly OK to modify and re-distribute modified versions of\nthis tool. If you do, please keep the message above intact. See also\nthe file LICENSE for details.\n\nIf you find bugs or have suggestions for improvements, or would like\nto contribute fixes or improvements, please send us an email\n(oliverobst@gmail.com). We will try to incorporate your patches and\nsuggestions in a next version.\n\n\n2. SETUP\n===================\n\nThere is a number of steps to follow initial installation of these\nscripts. Files can be installed on a web server by simply copying (run\nin a web browser).\n\nThe tool to convert log files into the *.replay files required by our\nlog player needs to be compiled first in order to be run.\n\n\n2.1 Compiling the Converter\n\nIn the \"converter\" subdirectory, there is a very simple Makefile that \nshould do the job. You will need the rcgbase installed that comes with\nthe server. Just do:\n\n    make\n\n2.2 Converting rcg[.gz] files \n\nTo convert .rcg(.gz) files into a .replay (converted game replay) is \nnow very simple:\n\n  The rcg2replay program will convert .rcg or gzipped rcg files into text, \n  e.g.,\n\n  rcg2replay 201203051705-TeamEI_8-vs-HELIOS_base_1.rcg.gz > 201203051705-TeamEI_8-vs-HELIOS_base_1.replay\n\n\nRepeat for all games you want to show on your web page.\n\n\n2.3 Installing the scripts on the web server\n\n - Copy all generated .replay files into some directory on your web\n   server (for minimal changes, retain the directory structure coming\n   with these scripts). \n\n - play.php is the main file that starts up the logplayer when invoked \n   using a browser.  Copy this file into the desired directory.\n\n   This file should be modified to include all the .replay files. If\n   you copied them into a different subdirectory, make sure to include\n   the correct path. See also online examples at\n   http://www.oliverobst.eu/research/robotics-gliders2012-simulation-league-robocup-team/robocup-2012\n\n - Copy the scripts directory and the *.css files. \n   play.php includes 3 javascript files, and 2 CSS style sheets. All 3\n   javascript files are expected in a subdirectory \"scripts\". This\n   subdirectory should be in the same directory as play.php. The 2 CSS\n   files are expected to be in the same directory as play.php. \n\n - Copy the images directory.\n   The style sheet jquery-ui.css expects some icons and graphics in\n   the \"images\" subdirectory (which again should be in the same\n   directory as play.php).\n\n\n3. PLAYING BACK\n===================\n\nThe example web page (play.php) gives you a drop-down menu to select\navailable games. To play back a game, it needs to be transferred to\nthe client side. Currently, the typical size of a replay file is\n4-5MB.  This transfer can take time and may make the browser seem like\nit has frozen. A notice to say that the file is being loaded would\nprobably be nice - feel free to add this or any other feature to the\nphp script. \n\n\n4. DEVELOPMENT\n===================\n\nFurther development of the rcg2html tool may change the format of\nreplay files to reduce size.\n", 
  "id": 35949503
}