{
  "read_at": 1462558698, 
  "description": "montecarlo sampling method to calculate metalicity from flux data", 
  "README.md": "[![DOI](https://zenodo.org/badge/doi/10.5281/zenodo.17880.svg)](http://dx.doi.org/10.5281/zenodo.17880) [![Code Health](https://landscape.io/github/fedhere/pyMCZ/master/landscape.svg?style=flat)](https://landscape.io/github/fedhere/pyMCZ/master)\n\nMC Metallicity\n====================\n\nThis code allows the user to calculate metallicity according to a number of <i> strong line metallicity diagnostics </i> from spectroscopy line measurements, and obtain uncertainties from the line flux errors in a Monte Carlo framework. If you use this code, <b> please cite our paper: the paper was accepted for publication on [Astronomy and Computing] (http://www.journals.elsevier.com/astronomy-and-computing/) (and a prepreint is available at http://arxiv.org/abs/1505.06213)!</b>\nThis code is released under MIT licence: see LICENSE.txt\n\n<b>Most recent stable release: v1.3</b>\n\n====================\nUsage:\n====================\nThis code requires ascii input files, their format is described below and examples are provided in the \\<input\\> directory in this package.  We provide an example dataset names 'exampledata', i.e. we provide input files 'exampledata_meas.txt' and 'exampledata_err.txt' are the input files. \n\nFrom the commandline simply use as:\n```\npython mcz.py <filename> nsample --path PATH \n```\n<b>\\<filename\\></b>: \\<filename\\> is the root name for the input as well as for all the output files: it could be for example the name of the supernova at the location of which HII regions have been measured (\\<filename\\> is 'exampledata' in our examples)\n\n<b>nsample</b>: the number of MC samples desired (for exampledata 2000 is an appropriate sample size. \n                       nsample must be >100 or it can be 0 to produce a single value, and no confidence region \n\nadditional command line arguments\n\n <b> --path PATH  </b>         the directory in which subdirectory \"input\" is located. If not provided, will default\n                        environmental variable MCMetdata that should be set to point to that directory. \n                        In our example the input directory is in pyMCZ (level 1).\n                        _err.txt _meas.txt must live in \\<path\\>/input\n                        \n <b> --md MD      </b>         metallicity scales to calculate. default is 'all',\n                        options are: D02, Z94, M91, M08, P05,P10, PP04, M13, D13, KD02,\n                        KD02comb, DP00 (deprecated), P01 (deprecated), C01 (deprecated)\n                        \n<b>  --unpickle    </b>        if it exists, a pickle file generated in a previous run for this \\<filename\\> and this \n                        number of samples is read in instead of recalculating the metalicity\n\n<b>  --binmode  BM  </b>         how to choose the number of bins for plotting the histogram:\n                            'd' is based on Doane's formula (wikipedia's version),  \n                            's' is the sqrt of number of data,        \n                            't' is on 2*n**1/3 , \n                            'kb' uses Knuth's block rule (default), \n                            'bb' uses bayesian blocks (must have astroML installed or it defaults to 'kb')\n                            'kd' is the kernel density, which requires sklearn installed and additioinally plots the                             histogram with 'kb' mode\n\n<b>  --clobber   </b>          If set to true, will overwrite existing output files without asking. Default False.\n\n<b>  --verbose   </b>          verbose mode. Default False.\n\n<b>  --nodust    </b>          don't do dust corrections (default is to do it)\n\n<b>  --noplot    </b>          don't plot individual distributions (default is to\n                        plot all distributions)\n\n<b>  --asciiout   </b>         write distribution medians and 68% inclusion regions in an ascii output (default is not\n                        to)\n                        \n<b>  --asciidistrib  </b>       write the entire distribution for every scale in an ascii file output (default is not to)\n                        \n                        \n<b>  --multiproc (--multi)  </b>         multiprocess, with number of threads nps=max(available cores-1, MAXPROCESSES)\n\n<b>  --log LOGFILE  </b>       outputting messages to a log file instead of standard output. disabled when multiprocessing\n\n\n====================\nInput file format\n====================\nFlux data for each object should be stored in the directory \\<input\\> that exists in the directory provided by the --path arg or by the environmental variable MCMetdata. Their ascii file names are expected to end by \"\\_meas.txt\" for the file containing the measurements, and \"\\_err.txt\" for the error file.\n\nwith common filename \\<filename\\>:\n\n\\<filename\\>_err.txt\n\n\\<filename\\>_meas.txt \n\nThe format for each of the txt files should be as follows, e.g.,\n\n\n;# galnum,[OII]3727,Hb,[OIII]4959,[OIII]5007,[OI]6300,Ha,[NII]6584,[SII]6717,[SII]6731,[SIII]9069,[SIII]9532\n       1     0.0     0.0     0.0     0.0     0.0   5.117   0.998     0.0     0.0     0.0     0.0\n       2     0.0     0.0     0.0     0.0     0.0   5.031   1.012     0.0     0.0     0.0     0.0\n       \n       \ngalnum is a sequential index\n\n\nThe first row is optional - it can contain more keys than columns, as long as the columns are listed in the same order as specified above, up to whichever line is of interest. Missing data should be filled in with 'NaN's.\n\nThe data should be in the above order, separated by any number of white spaces.\n\n\n====================\nOutput\n====================\nAll the results will be saved in the directory \"output/\\<filename\\>\" which will be creates in the directory provided by the --path arg.\n\nRead our paper, or the README.md file in the output directory in this package https://github.com/nyusngroup/pyMCZ/blob/master/output/README.md for more details on the output products.\n\n\n====================\nTests implemented\n====================\n\nA few tests are implemented to make sure your inputs are valid, and your outputs are robust. \nIn order to assess if the number of samples requested is sufficiently large, we provide the module testcompleteness.py. \n\nUse as, for example: \n\nimport testcompleteness as tc\n\ntc.fitdistrib(\\<path to pickle file\\>)\n\n\nThis reads in the pickle file generated by the code, and compares the cumulative distributions for 4 parameters: E(B-V), D02, Z94 and KD02comb_updated (the user can choose to use whichever scale of course!) (choosing subsets with minimal invalid outpus for each subset).  \n\nThe cumulative distribution for 1/10, 1/4, 1/2, 3/4 and the full sample generated by the code are compared with a KS tests and plotted. \n\nIf the number of samples is sufficient, you should expect the probability of the 3/4 sample and full sample to come from the same parent distribution to be close to 1, and generally the KD p-value to increase with the sample fraction (but not always it turns out...). More importantly though this can be used visually: the cumulative distribution should be nearly identical (and smooth). If all distributions overlap, then you are sure that you are well above the critical sample size that achieves smoothness (by a factor 10).\n\nThe figures below show an undersampled realization and a well- (possibly) over-sampled realization.\n\n\n\n\n![alt tag](https://github.com/nyusngroup/pyMCZ/blob/master/figures/exampledata_n200_testcomplete.png)\n\n\n![alt tag](https://github.com/nyusngroup/pyMCZ/blob/master/figures/exampledata_n2000_testcomplete.png)\n\n\n![alt tag](https://github.com/nyusngroup/pyMCZ/blob/master/figures/exampledata_n20000_testcomplete.png)\n\n\n \n====================\nKnown Issues and TODO\n====================\n\n\nPlot formatting is designed for a platform using latex and with Times New Roman serif font available to matplotlib. The module pylabsetup loaded early on assures that the matplotlib rcparameters are set up appropriately, including font choice, and in case of missing fonts an error message is streamed (but not paused upon). If your plots don't look good, change the necessary parameters in pylabsetup.py. This is an unfortunately common occurrence when not running on a Mac.\n\n\nNote that while a PDF version of our paper is included in the repository, the PDF does not render properly in github. To see the paper please go to the arxiv link (http://arxiv.org/abs/1505.06213) or compile it with pdflatex in the repo \"paper\" directory on your local machine.\n\n====================\nPackages required\n====================\nrequired packages:\n\nnumpy,pylab,matplotlib,scipy\n\ndesirable packages:\n\npickle,multiprocessing,itertools,csv,cProfile,pyqz\n\n===================\nSome figures from the paper as examples of code products\n===================\n\n\n![alt tag](https://github.com/nyusngroup/pyMCZ/blob/master/figures/pyMCZ_KD02distrib.png)\n\n\n![alt tag](https://github.com/nyusngroup/pyMCZ/blob/master/figures/pyMCZ_KD02distrib_KDE.png)\n\n\n![alt tag](https://github.com/nyusngroup/pyMCZ/blob/master/figures/pyMCZ_boxplot.png)\n\n", 
  "id": 35967196
}