{
  "read_at": 1462559012, 
  "description": "underdeveloped ideas for cosmological data analysis projects", 
  "README.md": "# ideas-for-the-taking\n\n*some underdeveloped ideas for cosmological data analysis projects*\n\nFeel free to use any of these ideas.  If one of them sticks, you can give me as little or as much credit as you'd like.  For some of these, I have additional notes and papers that might be useful, so ping me if interested.\n\n## Does the GHz radio excess come from z~0.5 structure?##\n\n<img src=\"https://github.com/rkeisler/ideas-for-the-taking/blob/master/images/boss_fan.png\" width=\"200px\"/>\n\n[Holder 2014](http://arxiv.org/abs/1207.0856) argues pretty convincingly that the GHz radio background/monopole (think ARCADE2) cannot originate from z<1 structure: if the excess radio signal *did* come from z<1 LSS, it would cluster at some level, and the observed GHz sky is too smooth.  However, as Gil points out, there are ways out.  The radio flux could be very puffy (10 Mpc radio halos or something), and would thereby evade the \"overly smooth\" ell~10000 anisotropy data that Gil used.\n\nThe idea of this project is to test this on larger scales (ell<2000), by cross-correlating ~GHz data (CHIPASS, Haslam, etc) with a well-calibrated tracer of z~0.5 LSS, namely the BOSS galaxy sample.  Something like:\n\n1. Construct a parameterized model for the redshift distribution of the GHz intensity (monopole), dI/dz.\n2. Assume that, on sufficiently large scales, the GHz anisotropy is a biased tracer of the matter anisotropy.  In fact, assume the linear bias is b=1.  The likely conclusion of this analysis --- you can't explain the radio background with z~0.5 structure --- is only stronger if b>1.\n3. Under the above assumptions, use the (non-linear) power spectrum and Limber theory to calculate the (delta x I) cross-spectrum, where delta is the projected fractional overdensity of BOSS galaxies, and I is the GHz radio intensity.  You'll need to know the bias of the BOSS sample, but that is sufficiently well known.\n4. Compare this theory (delta x I) cross-spectrum to the data cross-spectrum, i.e. calculate the likelihood of the parameters dI/dz model, given the observed (delta x I).\n5. Use MCMC to sample from this likelihood and thereby constrain the parameters of the dI/dz model.\n6. For each point in the chain, compare the model total GHz background, Int(dI/dz, dz), to the observed excess.  Can the model explain the observed monopole?\n7. Consider using several ~GHz radio surveys: [CHIPASS](http://www.atnf.csiro.au/people/mcalabre/CHIPASS/) @ 1.4 GHz, Haslam @ 0.4 GHz.  Eventually CBASS and CHIME could be interesting.\n\nI started working on this in 2013/2014, and there's [code here](https://github.com/rkeisler/radio_background).  It should be significantly easier (and more powerful) now that the final BOSS data is out.\n\n\n## kSZ with SDSS+Planck##\n\n<img src=\"https://github.com/rkeisler/ideas-for-the-taking/blob/master/images/ksz_template.png\" width=\"200px\"/>\n\nThe basic idea here is to measure the kSZ signal generated by z~0.5 linear structure (as modulated by few-arcminute-scale galaxy clusters).\n\n1. Use the BOSS (CMASS+LOWZ) spec-z catalog to estimate the 3d density field over the BOSS footprint.\n2. Take the (optimally filtered) gradient of the 3d density field to estimate the linear, 3d velocity field.\n3. Evaluate the 3d velocity field at the locations of SDSS clusters (e.g. redmapper).\n4. Project those velocities onto the line-of-sight, and use the redshift/richness info to construct a kSZ template.\n5. Estimate the amplitude of this signal in Planck CMB data.  I would use a harmonic space optimal filter, as in e.g. Keisler & Schmidt 2013.\n\nI got pretty far along with this in spring 2014, and there is [code here](https://github.com/rkeisler/vksz).  Using the pre-final BOSS and Planck data, I was seeing something at the 2-3 sigma level, and the analysis should be significantly better (and easier) with the full BOSS footprint and final Planck data.\n\n\n## the distribution of BOSS galaxies around redmapper clusters ##\n\n<img src=\"https://github.com/rkeisler/ideas-for-the-taking/blob/master/images/rm_boss.png\" width=\"200px\"/>\n\nI've done a quick measurement of the two-dimensional, two-point correlation function between redmapper clusters and BOSS galaxies.  This is basically the distribution of BOSS galaxies around redmapper clusters.\n\nThe image above shows a subset of the results, and you can see the features you'd expect to see: strong positive correlation extending out to ~100 Mpc, redshift-space distortions squashing the correlation on tens-of-Mpc scales, and fingers-of-god on ~1 Mpc scales.\n\nWith this data you might be able to:\n\n- do something similar to what was done in [this paper](http://arxiv.org/abs/1404.3742), which analyzed the anisotropic clustering of CMASS galaxies on quasi/non-linear scales to constrain (f*sigma8) at the redshift of the sample.\n- constrain the mass of the RM clusters.\n- test GR, as described in Fabian Schmidt's [paper](http://arxiv.org/abs/1202.4501).\n\nFabian Schmidt, Eduardo Rozo, and Eli Rykoff might be interested in getting involved in this, and in any case, they can provide some good advice.\n\n\n## optical depth anisotropy ##\n\n<img src=\"https://github.com/rkeisler/ideas-for-the-taking/blob/master/images/cmb.png\" width=\"200px\"/>\n\n\nTry to measure anisotropy in \"tau\", the optical depth to Thomson scattering for CMB photons.\n\nThe basic picture here is that degree-scale primary CMB gets screened by few-to-ten-arcminute-scale fluctuations in tau.  The primary CMB is measured well by Planck (just smooth Planck CMB map with a FWHM=10' gaussian.  this still has ~95% of the primary CMB variance).  Then, if the CIB map is a good LSS tracer out to some LMAX_LSS, you can try to look for the resulting signal in some \"fine-scale\" CMB data, which could be Planck, SPT, etc.  Something like:\n\n1. Spatially-filter a Planck 545 GHz map to isolate the CIB.\n2. Assume that, on sufficiently large scales, this map is proportional to delta_tau, the tau anisotropy.  This is a reasonable assumption for the post-reionization universe, which is where the CIB originates.\n3. \"Screen\" the Planck CMB map (e.g. Commander ruler) by the delta_tau map, i.e. multiply the two together.\n4. Look for the signature of this screening in the Planck CMB data, i.e. cross-correlate (CMB x (CMB x delta_tau)).\n5. This is similar to how [Hanson et al 2013](http://arxiv.org/abs/1307.5830) used the CIB and mostly-unlensed E-modes to construct a B-mode template, then looked for those B-modes in SPTpol data.\n\nOR\n\n1. There is a set of quadratic estimators that can be used to estimate tau using CMB data, just like there is for phi, the CMB lensing potential.  Use Planck CMB data to construct a QE estimate of tau.\n2. Cross-correlate that (noisy) tau map with a Planck CIB map (e.g. 545 GHz).  The idea is that the CIB traces z~2 LSS, and tau anisotropy will also follow the LSS.\n\nIn fact, because the redshift kernels for tau and phi are so similar in shape over the redshift range of the CIB, the relatively unknown redshift distribution of the CIB (dI/dz) *drops out* of the following ratio: (CIB x tau) / (CIB x phi).  If you assume that you know Omega_b and Omega_M from the CMB, then this provides a measurement of the linear bias of the tau anisotropy.  Alternatively, you can assume bias_tau=1, and use this as a measurement of (Omega_b/Omega_M).  Go find those missing baryons!\n\nSNR estimates for (CIB x tau) cross-spectrum:\n- Using Planck for the fine-scale CMB, I estimate a SNR of [5, 6.5, 7] for LMAX_LSS of [2000, 2500, 3000].\n- Using SPT-SZ for the fine-scale CMB, I estimate a SNR of [2,4,6.5] for LMAX_LSS of [2000, 2500, 3000].\n\n## other ideas ##\n\n<img src=\"https://github.com/rkeisler/ideas-for-the-taking/blob/master/images/crazy.png\" width=\"200px\"/>\n\n\n- Measure mass profile of voids on 20-100 Mpc scales using CMB lensing.  This may be particularly sensitive to neutrino mass.  Talk with Neal Dalal.\n\n- Measure tau-profiles (Thomson optical depth) of galaxies using ALMA + CMB.  I.e. select a bunch of galaxies that are sitting on peaks or troughs of the CMB, then image them with ALMA.  A quick SNR calculation with Yashar suggests this is not orders-of-mag insane, but still probably one order-of-mag too dim to be seen in a reasonable amount of time with ALMA.\n\n- Try to measure radio relics in SPT clusters, like in http://arxiv.org/abs/1409.2943 .  Could these make up a significant portion of the GHz radio background (the \"ARCADE2 excess\")?  Maybe you can use publicly available radio data from CHIPASS.\n\n- There's some idea of intergalactic dust that doesn't redden, it just attenuates: \"gray dust\".  Can't you look at inferred luminosity of CMASS galaxies as a function of angular distance from LOWZ galaxies (or something more clever), to limit this?\n\n- Will the gravitational potential at earth, relative to cosmic mean, be important for future astronomical measurements?  For instance, if you try to infer the photon-to-baryon ratio from a futuristic measurement of T_CMB (say, by PIXIE), I think you'll be wrong by an amount proportional to our local potential.  How big might this be?  An observer sitting within a massive cluster can see a ~30 km/s gravitational redshift = (1e-4)*c.  While 1e-4 isn't important for the COBE/FIRAS measurement of T_CMB (1e-3 fractional accuracy), it would be for more precise measurements.  How can we reliably estimate our local gravitational potential relative to cosmic mean?\n\n\n", 
  "id": 35973639
}