{
  "read_at": 1462558957, 
  "description": "Implementation of a highly specific test for periodicity of time series based on folding", 
  "README.md": "Quick and dirty introduction to usage\n=====================================\n\nFor an extensive description and explanation, see [arXiv:1506.01287](http://arxiv.org/abs/1506.01287).\n\nVery briefly, this test decides whether a given time series can be interpolated by a periodic function with the same number of local extrema as the time series, where only local extrema with a prominence higher than a given error allowance s are taken into account. The method also returns the period length. It is not intended for experimental but for simulated data.\n\nThe method has two parameters that can be chosen straightforwardly:\n\n* The **maximum allowed period length t<sub>max</sub>**: Choose this parameter reasonably low to limit the runtime and to avoid period lengths that are close to the length of the time series. Unless you know what you are doing, t<sub>max</sub> should at least be half the length of the time series.\n\n* The **error allowance s:** Choose this parameter to correspond to the maximum expected absolute numerical error of your simulation, e.g., the maximum absolute integration error of an adaptive integrator.\n\nInstructions for building\n=========================\n\nThe following describes how to use this source depending on how you want to use it:\n\nA. As a Python module\n---------------------\n\nBuild the module by running\n\n```sh\npython build.py Python\n```\n\nor \n\n```sh\npython build.py Python notest\n```\n\nif you want to skip the tests to speed things up.\n\nThis generates a Python module file called `periodicitytest.so`, which contains one function called periodicitytest. It can be loaded, e.g., as follows:\n\n```python\nfrom periodicitytest import periodicitytest\n```\n\nFor further documentation, see `periodicitytest`'s docstring.\n\nB. As a standalone program\n--------------------------\n\nBuild the program by running\n\n```sh\npython build.py C\n```\n\nor \n\n```sh\npython build.py C notest\n```\n\nif you want to skip the tests to speed things up.\n\nThis generates an executable called `standalone`. It takes the maximum period length t<sub>max</sub> and the error allowance s as an argument. The time series is read from STDIN.\n\nTake a look at `standalone.c` if you want to modify input and output.\n\nC. As a C library\n-----------------\n\nThe central function is contained and documented in `search.h`. For input and output it requires simple datatypes defined in `basics_standalone.h` and `interval.h`. It needs to compiled with `-DSTANDALONE`. Several costly assertions can be avoided by compiling with `-DNDEBUG`.\n", 
  "id": 36018806
}