{
  "read_at": 1462558859, 
  "description": "LIPS (Learning-based Indoor Positioning System)", 
  "README.md": "# LIPS\nLIPS (Learning-based Indoor Positioning System)\n\nPaper: (http://ieeexplore.ieee.org/xpl/articleDetails.jsp?reload=true&arnumber=7444919)\n\nLIPS is a hybrid fingerprinting-based approach to indoor localization using the sensors available in smartphones. For information about the research done involving this application, see http://arxiv.org/abs/1505.06125 (pdf at http://arxiv.org/pdf/1505.06125v1.pdf).\n\n# Machine Learning\nThe models in /assets were built using WEKA (Waikato Environment for Knowledge Analysis http://www.cs.waikato.ac.nz/ml/weka/). WEKA is also used in the code for predicting the user position in the TrackerActivity class. The WEKA website is a great resource for any issues there, as well as the WEKA mailing list. Documentation for the Java resources in WEKA is available at http://weka.sourceforge.net/doc.dev/ while instructions for using WEKA in Java code can be found at http://weka.wikispaces.com/Use+WEKA+in+your+Java+code and http://weka.wikispaces.com/Programmatic+Use. If there are problems, feel free to open an issue or send me an email.\n\n# Building\nBuilding the application and modifying it for usefulness in other buildings or areas of interest should be straightforward. Depending on the intended use of the application, much less code than this may be necessary. For help setting up an Android development environment, the documentation at http://developer.android.com/ is excellent. Regarding the code itself, comments are fairly liberal and variable names tend to be descriptive. Again, if you have any trouble, please open an issue here on Github or send me an email.\n\nThe main classes to change are MainActivity.java and TrackerActivity.java.\n\nThe MainActivity file contains the code for data collection. The only necessary changes should be adding a new list of WiFi BSSIDs to listen for.\n\nTrackerActivity will need the model built on your new dataset to predict a position.\n\n# Adding additional machine learning classifiers\nNotice the RBFRegressor jar in libs. This is because RBFRegressor isn't by default installed with WEKA. To add RBFRegressor for use in code:\n\nOpen WEKA\n\nClick the Tools tab, then Package Manager\n\nFind and install the RBFNetwork package\n\nThe jar will be in wekafiles/packages/RBFNetwork/RBFNetwork.jar\n\n![GPLv3](http://www.gnu.org/graphics/gplv3-127x51.png)\n", 
  "id": 36055146
}