{
  "read_at": 1462558867, 
  "description": "NIR spectroscopy of the Sun and HD20010 - NIR spectroscopy of the Sun and HD20010", 
  "README.md": "# Paper2015a\n\nPresentation for a yearly report on my PhD which overlap with the paper can be found [here](http://danielandreasen.github.io/Paper2015a/index.html#/)\n\nPaper can be found [here](http://adsabs.harvard.edu/abs/2015arXiv151008273A)\n\n\n# Abstract\n**Context:** Effective temperature, surface gravity, and metallicity are basic spectroscopic stellar parameters necessary to characterize a star or a planetary system. Reliable atmospheric parameters for FGK stars have been obtained mostly from methods that relay on high resolution and high signal-to-noise optical spectroscopy. The advent of a new generation of high resolution near-IR spectrographs opens the possibility of using classic spectroscopic methods with high resolution and high signal-to-noise in the NIR spectral window.  \n**Aims:** We aim to compile a new iron line list in the NIR from a solar spectrum to derive precise stellar atmospheric parameters, comparable to the ones already obtained from high resolution optical spectra. The spectral range covers 10000A to 25000A, which is equivalent to the Y, J, H, and K bands.  \n**Methods:** Our spectroscopic analysis is based on the iron excitation and ionization balance done in LTE. We use a high resolution and high signal-to-noise ratio spectrum of the Sun from the Kitt Peak telescope as a starting point to compile the iron line list. The oscillator strengths (log gf) of the iron lines were calibrated for the Sun. The abundance analysis was done using the MOOG code after measuring equivalent widths of 357 solar iron lines.  \n**Results:** We successfully derived stellar atmospheric parameters for the Sun. Furthermore, we analysed HD20010, a F8IV star, from which we derived stellar atmospheric parameters using the same line list as for the Sun. The spectrum was obtained from the CRIRES- POP database. The results are compatible with the ones found in the literature, confirming the reliability of our line list. However, due to the quality of the data we obtain large errors.\n\n# Credit/citation\nYou can cite this paper with the following snippet for your bibTeX file\n\n    @ARTICLE{Andreasen2015,\n       author = {{Andreasen}, D.~T. and {Sousa}, S.~G. and {Delgado Mena}, E. and \n\t    {Santos}, N.~C. and {Tsantaki}, M. and {Rojas-Ayala}, B. and \n\t    {Neves}, V.},\n       title = \"{NIR spectroscopy of the Sun and HD20010 - Compiling a new linelist in the NIR}\",\n     journal = {ArXiv e-prints},\n    archivePrefix = \"arXiv\",\n       eprint = {1510.08273},\n     primaryClass = \"astro-ph.SR\",\n     keywords = {Astrophysics - Solar and Stellar Astrophysics},\n         year = 2015,\n        month = oct,\n       adsurl = {http://adsabs.harvard.edu/abs/2015arXiv151008273A},\n      adsnote = {Provided by the SAO/NASA Astrophysics Data System}\n    }\n", 
  "id": 36217105
}