{
  "id": 36257970, 
  "read_at": 1462558837, 
  "README.rst": ".. -*- mode: rst; coding: utf-8 -*-\n\n==========================\n Path Similarity Analysis\n==========================\n\n|zenodo|\n\n:Author:    Sean Seyler\n:Year:      2015\n:License:   GNU Public Licence, version 3 (or higher)\n:Copyright: (c) 2015 Sean Seyler\n:Citation:  SL Seyler, A Kumar, MF Thorpe, O Beckstein. \n            *Path Similarity Analysis: a Method for Quantifying Macromolecular Pathways.* \n            ArXiv e-prints (2015). `arXiv:1505.04807`_ [q-bio.QM]\n            \n.. |zenodo| image:: https://zenodo.org/badge/13219/Becksteinlab/PSAnalysisTutorial.svg\n    :alt: doi: 10.5281/zenodo.17902\n    :target: http://dx.doi.org/10.5281/zenodo.17902\n\nSummary\n=======\n\nPath Similarity Analysis (PSA) comprises a computational framework designed to\nenhance the quantitative comparison of macromolecular transition paths [Seyler2015]_. \nThis tutorial provides two examples to demonstrate a simple comparison, using PSA, of\nclosed to open adenylate kinase (AdK) transition paths generated by a selection\nof various algorithms [Seyler2014]_. Hierarchical clustering is used as a\nsimple, but powerful approach to exploratory data analysis by construction of a\nheat map-dendrogram representation of the quantitative comparison.\n\n\nBackground\n==========\n\nPSA is based on measuring the geometric similarity of transition paths in\nconfiguration space using the Hausdorff and Frechet path metrics. PSA takes\nadvantage of MDAnalysis_ [Michaud-Agrawal2011]_ to provide a seamless interface\nto the Python and NumPy arrays, and a mechanism for performing path comparisons\nusing arbitrary atom selections. MDAnalysis also provides a format-agnostic\nframework for reading simulation trajectories, allowing rapid comparison of many\ndifferent computational methods. More information about the method can be found\nin [Seyler2015]_.\n\n\nUsage\n=====\n\nThis tutorial demonstrates a straightforward application of PSA to a set of\ntransitions of the enzyme adenylate kinase (AdK) generated by a selection of methods\n(for more background on this particular example see [Seyler2014]_). Two example scripts are\nprovided: a short version shows how to perform similarity analysis on a set of\ntrajectories that have been pre-processed for proper (frame-by-frame) structural\nalignment; a full version additionally demonstrates, using the PSA framework,\nhow an alignment procedure would be performed prior to similarity analysis.\n\nAnalysis is performed with the ``psa_short.py`` or ``psa_full.py`` scripts,\nwhich automatically read trajectories from the ``methods`` directory into a\nPSA object, perform trajectory alignment (in the case of ``psa_full.py``),\ngenerate discrete Frechet distance matrices, and produce a heat map-dendrogram\nplot representing the distance matrix after Ward hierarchical clustering.\n\nThe scripts can be run directly using\n\n    python psa_short.py\n\nor\n\n    python psa_full.py\n\nThe user can also try adjusting settings at the top of each file to change the:\n\n* path metric (default: discrete Frechet [``discrete_frechet``])\n* linkage algorithm for hierarchical clustering (default: ``Ward``)\n* name and location of the plot (default: ``df_ward_psa-[short/full].pdf``)\n\nThese examples serve as a sufficient basis for understanding PSA's framework.\nSome other techniques and analyses using PSA are described in [Seyler2015]_.\n\n\nHelp\n====\n\nIf you have questions or problems using the package then ask on\nthe MDAnalysis user mailing list:\nhttp://groups.google.com/group/mdnalysis-discussion\n\n\nImplementation in MDAnalysis\n============================\n\nIf you want to write your own code using PSA then use the ``MDAnalysis.analysis.psa``\nmodule, which is part of MDAnalysis_ (since release 0.10.0) and have a look at\nthe `documentation of the PSA module`_.\n\n.. _documentation of the PSA module: \n   http://devdocs.mdanalysis.org/documentation_pages/analysis/psa.html\n\n\nReferences\n==========\n\n.. Links\n.. -----\n\n.. _MDAnalysis: http://www.mdanalysis.org\n\n.. Articles\n.. --------\n\n.. [Michaud-Agrawal2011] N. Michaud-Agrawal, E. J. Denning,\n   T. B. Woolf, and O. Beckstein. MDAnalysis: A toolkit for the\n   analysis of molecular dynamics simulations. J Comp Chem,\n   32:2319-2327, 2011. doi:`10.1002/jcc.21787`_. http://www.mdanalysis.org\n\n.. _`10.1002/jcc.21787`: http://doi.org/10.1002/jcc.21787\n\n.. [Seyler2014] S.L. Seyler and O. Beckstein, Sampling large conformational\n   transitions: adenylate kinase as a testing ground. Mol Simul 40:855-877,\n   2014. doi:`10.1080/08927022.2014.919497`_\n\n.. _`10.1080/08927022.2014.919497`: http://dx.doi.org/10.1080/08927022.2014.919497\n\n.. [Seyler2015] S.L. Seyler, A. Kumar, M.F. Thorpe, and O. Beckstein, Path\n   Similarity Analysis: a Method for Quantifying Macromolecular Pathways.\n   `arXiv:1505.04807`_ [q-bio.QM], 2015\n\n.. _`arXiv:1505.04807`: http://arxiv.org/abs/1505.04807\n", 
  "description": "Quantify the geometric and atomistic similarity of conformational transition pathways"
}