{
  "read_at": 1462558924, 
  "description": "Prototype/demo implementation of algorithm described in Shuang Yang's \"Scale space theory for text\". See included paper for details and issues.", 
  "README.md": "Script overview\n=======\n\nNOTE: The text file names included in the script are\nabsolute filepaths and would need to be updated match\nyour file path in order to run.\nThe corpus used to build the initial pointwise\nmutual innformation(PMI) graph\nis not included and would need to be rebuilt \nusing the build_graph_script.\n\nThe paper describing this project is included in the\nrepo under the title scale_draft1.pdf.\nThe original paper is here: http://arxiv.org/abs/1212.2145\n\nThe main functions are separated into several modules.\nUse of the modules is demonstrated in the script\nfiles\n\n\nText files:\n------\ndidion.txt :\n     a clip from a book review\npaper_draft.txt :\n    a draft of the paper handed in with this project\n\nModules\n------\npreprocess: routines based on the\n    NLTK library for tokenizing and cleaning text.\n\nlanguage_model: functions used to build a semantic graph\n    based on pointwise mutual information.\n\ngauss_filter: is used for filtering or smoothing over\n    either 1D or 2D binary representations of text.\n\nkeyword: contains functions for building a list of\n    keywords from a filtered text.\n\n\nScripts\n-----\n\nbuild_graph_script.py\n    Demonstrates building a graph based on a text file.\n    It can take 10-20 minutes to build a graph based\n    on a moderate sized corpus\n\nsmall_vocab_test.py\n    Demonstrates filtering on a reduced vocabulary. This\n    enables the result to be visualized, since using\n    a full vocabulary would make the semantic axis\n    much greater than the spatial axis (x).\n\nkeyword_script.py\n    This script demonstrates extracting keywords from\n    a moderate-sized text\n\n\nData\n------\nIn the current scripts data is loaded from the semantic_graph.p\nfile which has around 82,000 bigrams with 16,000 unique words.\n\n", 
  "id": 36332618
}