{
  "read_at": 1462558890, 
  "description": "Mathematica implementation of wormhole ray tracing", 
  "README.md": "# Interstellar-Wormhole-Ray-Tracing\nAs part of a computational methods in physics class, my two team members and I created this Mathematica notebook which implements a ray tracing map for the light from a wormhole. Our approach was based on the paper by Kip Thorne et al. (http://arxiv.org/abs/1502.03809)\n\nWe have implemented parallelized and nonparallelized versions of the raytracing computation. The parallelized version leverages Mathematica's ParallelTable. Note that the notebook files have actually been saved as .txt files to prevent formatting errors arising from Mathematica metadata conflicting with GitHub. Simply rename them to .nb files or copy and paste into a new Mathematica notebook. To run the notebook, place files named \"GargantuaSide.jpg\" and \"SaturnSide.jpg\" in the same directory as the notebook file. These images will represent the two sides of the wormhole. To increase the accuracy of the algorithm at the cost of increased computation time, make the division size smaller in the ray-trace computation. For example, change the two instances of 512 in CreateMap to 1024. One can adjust the location of the camera by adjusting theta_c, phi_c, and l_c. One can also adjust the wormhole's lensing width, mass, diameter, and length. These parameters are more fully described in the aforementioned paper. \n\nOne can use the images provided by Double Negative VFX (http://www.dneg.com/dneg_vfx/wormhole/) to render images which resemble the wormhole from Interstellar.\n\nWe used the following star field image and Saturn image:\n\n![](https://github.com/lrudolph1/Interstellar-Wormhole-Ray-Tracing/blob/master/Images/InterstellarWormhole_Fig10.jpg)\n\n\n![](https://github.com/lrudolph1/Interstellar-Wormhole-Ray-Tracing/blob/master/Images/InterstellarWormhole_Fig6a.jpg)\n\nWith these images and our ray tracing implementation (with 1024 divisions), we obtained the following image:\n\n![](https://github.com/lrudolph1/Interstellar-Wormhole-Ray-Tracing/blob/master/Images/1024%20division%20render.jpg)\n\nThis rendering simulates the perspective of a camera at the star field location looking into a black hole which leads to Saturn.\n\n", 
  "id": 36450224
}