{
  "README": "This package contains code, help and examples for robust estimation of sparse precision-matrices, as described in \"On estimation of the diagonal elements of a sparse precision matrix\" by Samuel Balmand and Arnak S. Dalalyan (posted as http://arxiv.org/abs/1504.04696) and in \"Convex programming approach to robust estimation of a multivariate Gaussian model\" (posted as http://arxiv.org/abs/1512.04734).\n\nContributors:\n\nArnak Dalalyan <Arnak.Dalalyan@ensae.fr>\nSamuel Balmand <Samuel.Balmand@ensg.eu>\n\n---------------\n\nThis package contains the following methods:\n\n   DESP_MST \t\tEstimation of DESP using minimum spanning trees\n   DESP_PML \t\tEstimation of DESP by penalized likelihood minimization\n   DESP_RML \t\tEstimation of DESP by likelihood maximization\n   DESP_RV \t\t  Estimation of DESP by residual variance\n   DESP_SPT \t\tEstimation of DESP using shortest path trees\n   DESP_SRL_B \tEstimation of the coefficient matrix\n   sqR_Lasso\t\tSolve the square-root LASSO\n   scsSOCP\t\t  Solve a second-order cone program using SCS\n   desp         Robust estimation of a sparse precision matrix\n   desp.cv      Selection of the tuning parameters of desp by v-fold cross-validation\n\nThe functions not prefixed by \"DESP_\" would be most convenient for most of the uses. \n\n---------------\n\nRequirements:\n\nThe open source solver SCS is already available in this package (see https://github.com/cvxgrp/scs), but to use the convex optimization proprietary software MOSEK or GUROBI that have an R interface, one has to install them separately. We highlight that the use of MOSEK and GUROBI solvers should be considered as deprecated. Their support will be removed in future versions of this package.\n\nFor estimating the coefficient matrix with the square-root Lasso with the MOSEK solver, DESP needs a working version of the Rmosek package that requires MOSEK and a MOSEK license (see http://rmosek.r-forge.r-project.org/).\n\nFor estimating the coefficient matrix with the square-root Lasso with the GUROBI solver, DESP needs a working version of the gurobi package that requires GUROBI and a GUROBI license (see http://www.gurobi.com/documentation/6.0/refman/r_api_overview.html).\n\nTo make the best use of this package, we recommend to use a compiler that supports OpenMP (see http://openmp.org).\n", 
  "read_at": 1462558870, 
  "description": ":exclamation: This is a read-only mirror of the CRAN R package repository.  DESP — Estimation of Diagonal Elements of Sparse Precision-Matrices  ", 
  "id": 36498322
}