{
  "read_at": 1462558666, 
  "description": "ScatNetLight for fast classifications of signals via Scattering Networks", 
  "README.md": "ScatNetLight v0.1 - June 2015\n-------\n\nScatNetLight is a MATLAB implementation of the Scattering Networks optimized for image classification on complex datasets. The software 'scatnet_light' and a classification pipeline are included in this version.\n\nSee homepage of the Scattering Networks:\nhttp://www.di.ens.fr/data/scattering\n\nSoftware used in the paper:\nDeep Roto-Translation Scattering for Object Classification, Edouard Oyallon, Stephane Mallat, accepted to CVPR 2015, http://arxiv.org/abs/1412.8659\n\nAuthor contact: Edouard Oyallon, edouard.oyallon@ens.fr\nContributor: Matthew Hirn, matthew.hirn@ens.fr\n\n\nInstall ScatNetLight + Classification pipeline\n---------------\n\n- launch 'load_path_software' from matlab shell\n\n[optional] : add the following two lines to your startup.m file\nso that matlab does the addpath automatically when it starts: \n\n\n    addpath /path/to/scatnet;\n    load_path_software;\n\nQuickstarts\n-----------\n\nSee 'quick_tutorial.m' in the main folder or the 'tutorial' folder in scatnet_light.\n\nYou will have to modify the function 'create_config_caltech_101', 'create_config_caltech_256', 'create_config_cifar_10' and 'create_config_cifar_100'. The dataset will also have to be downloaded and put in separate folders. The software is outputting intermediary features that can take a consequent size on a harddriver. Also, a server with at least 256go of memory is recommended for most of the experiments, if you want to use the dimensionality reduction algorithm.(it can be removed by setting option.Classification.nAverageKernel and option.Classification.D equal to -1)\n\nCopyright\n----------\n\nThis code is mainly based on the implementation of ScatNet v0.2 done by Laurent Sifre and Joakim Anden\n\nThe code for the Selesnick wavelet filters was written by Shihua Cai, Keyong Li, and Ivan Selesnick. It has been included in ScatNet with their permission.\n\nThe supervised algorithm of feedforward selection based on OLS has been written by Xiu Cheng for the class specificic part, Matthew Hirn for the selection of variable algorithm.\n\nThe SVM's code is an extension of libsvm written by Joakim Anden.\n\nThe code to compute kernel has been written by Jordi and Gustavo Camps and is included with their permission.\n\n", 
  "id": 36557275
}