{
  "read_at": 1462558959, 
  "description": "HEP physics library with kT jet algorithms from ", 
  "README.md": "# HePhysics\nData analysis for high-energy physics (HEP). \n\n<h1>Introduction</h1>\n\nHePhysics package is a Java library used for various data analysis tasks in  high-energy particle physics (HEP), which complements FreeHep and extends it for future pp collider experiments. It is a third-party module of \n<a href=\"http://jwork.org/dmelt/\">DataMelt</a>.\nIn particular, it includes various Lorentz-type particles and transformations for high-energy physics applications, Java implementation of the longitudinally invariant kT,  anti-kT and Cambridge/Aachen clustering algorithms using the recombination\nmethod.<br>\nExamples are:\n<ul>\n<li>\nKTjet - uses pseudorapidity and float values. A fast light-weight implementation\n</li>\n\n<li>\nSCJet - uses rapidity for merging of particles and double values. \n</li>\n\n<li>\nSCJet - uses rapidity for merging of particles and double values.\n</li>\n\n<li>\nJetN2 - Java implementation of the jet algorithm by I.Pogrebnyak using the N^2 FastJet approach.\n</li>\n\n</ul>\n\nStand-alone kT algorithms using the above codding, together with Java and C++ implementations, can be found in the \n<a href=\"https://github.com/chekanov/hepjet/\">HepJet project</a>. \n\n<h1>Current usage</h1>\n\nHePhysics  is a contributed package to the <a href=\"http://jwork.org/dmelt/\">DataMelt</a> data-analysis environment and can be used in Java, Jython and Groovy.  It also used for vonline alidation analysis scripts by the <a href=\"http://atlaswww.hep.anl.gov/hepsim/\">HepSim</a> Monte Carlo database for current and planned particle experiments.\n\nIf you have noticed bugs and  made changes, please  inform  dmelt@jwork.org .\nIn this case, your changes will be included to the next SCaVis release.\n\n<h1>How to compile and test</h1>\n\nYou need to install Java 7 JDK (or above) and Athe ANT tool  to build the package. Then compile and run a simple test as:\nTo compile, copy the \"lib\" directory from the <a href=\"http://jwork.org/dmelt/\">DataMelt</a>.\nThen:\n\n<pre>\nant\nant run\n</pre>\n\nThis will run a simple test: the anti-kT jet algorithm using the input file jets/single-event.dat.\nThe main code in hephysics/jet/SCJet.java\nThe implementation is closely follows the description in  the paper \"The anti-k_t jet clustering algorithm\n\" M.Cacciari, G.Salam,  G.Soyez, http://arxiv.org/abs/0802.1189\n\nThe input data jets/single-event.dat for this test is taken from the official  FastJet http://fastjet.fr/ web page. The C++ code is also included (in the directory \"jets\").\n\n<h1>Java API</h1>\n<ol>\n<li><a href=\"http://jwork.org/dmelt/api/doc.php/hephysics/jet/package-summary\">kT-type jet algorithms</a>\n</li>\n<li><a href=\"http://jwork.org/dmelt/api/doc.php/hephysics/particle/package-summary\">Lorentz particles</a>\n</li>\n<li><a href=\"http://jwork.org/dmelt/api/doc.php/hephysics/hepsim/PromcUtil\">package to fill  particle array from ProMC format</a>\n</li>\n</ol>\n\n", 
  "id": 36625491
}