{
  "read_at": 1462547154, 
  "description": "Line of sight mass reconstruction in the Universe", 
  "README.md": "# Pangloss\n\nPangloss is software module for reconstructing all the mass within a light cone\nthrough the Universe.  Understanding complex mass distributions like\nthis is important for accurate time delay lens cosmography, and also for\naccurate lens magnification estimation. It aspires to use all available\ndata in an  attempt to make the best of all mass maps. However, this\nproblem is sufficiently difficult that we are mostly spending our time\ncultivating a garden of toy models and baby steps.\n\nIf you are interested in the ongoing investigation of this interesting\nproblem, you should:\n* Read our first paper, [_\"Reconstructing the lensing mass in the universe from photometric catalogue data;\"_](http://arxiv.org/abs/1303.6564)\n* [Browse the wiki](https://github.com/drphilmarshall/Pangloss/wiki) \nto see what our current plans are;\n* [Fork the code](https://github.com/drphilmarshall/Pangloss) and play around with it;\n* Contact us! [Phil](mailto:dr.phil.marshall@gmail.com) and [Tom](mailto:tcollett@ast.cam.ac.uk) are keen to hear from other researchers in the field who would like to coordinate and/or collaborate.\n\n## License\n\nPangloss is distributed under the Gnu Public License (GPL) v2, a copy of\nwhich is delivered with this code. This basically means you can do\nanything you like with it, as long as you keep propagating the license\ninformation.\n\nHowever, when reporting on your use of Pangloss, we do ask that you include:\n* A citation to: **[Collett et al. (2013), MNRAS, 432, 679, arxiv/1303.6564](http://adsabs.harvard.edu/abs/2013MNRAS.432..679C)**\n* An acknowledgment including a link to this repo, such as:\n_\"This work made use of the Pangloss code, written by Tom Collett and\nPhil Marshall, which is freely available at https://github.com/drphilmarshall/Pangloss.\"_\n\n## Installation\n\nAfter cloning or forking the repository, \nadd the following lines (or similar) to your .login file:\n\n    setenv PANGLOSS_DIR ${WORK_DIR}/Pangloss\n    setenv PYTHONPATH ${PANGLOSS_DIR}/Pangloss:${PYTHONPATH}\n    setenv PATH ${PATH}:${PANGLOSS_DIR}\n\nThen \"import pangloss\" from python should just work, and the command\nline scripts should too. However, you will need to have the following packages\ninstalled as well:\n\n    import atpy,asciitable,pyfits\n    import numpy,scipy,getopt,matplotlib\n\nMost (if not all) are available via pip and/or homebrew.\n\n\n## Example use\n\nRight now, there are three main scripts that carry out Pangloss's\nfunctions:\n\n* **[Drill.py](https://github.com/drphilmarshall/Pangloss/blob/master/Drill.py)**: \nfrom an input catalog of galaxies (either real or\nsimulated), drill out a narrow lightcone (or set of lightcones) centred\non some sky position of interest, and save the resulting smaller\ncatalog (or catalogs).\n* **[Reconstruct.py](https://github.com/drphilmarshall/Pangloss/blob/master/Reconstruct.py)**:\nread in a lightcone catalog (or set of catalogs), and\nassign dark matter mass to the galaxies within, probabilistically. Each\nlightcone yields its own Pr(kappah|D), where kappah is the total\ngravitational lensing convergence at the centre of the lightcone - this\nquantity is of great relevance to the strong lens time delay distance in\nparticular.\n* **[Calibrate.py](https://github.com/drphilmarshall/Pangloss/blob/master/Calibrate.py)**:\n kappah is (at the moment) a fairly crude approximation\nto the \"true\" convergence kappa - but we have shown that one can recover\na better approximation by considering Pr(kappah,kappa|C), where C is\nlarge set of lightcone catalogs drawn from a cosmological simulation.\nThe resulting PDF Pr(kappah|D,C) contains the assumption that this\nsimulation is an accurate representation of our real Universe - but\nwe're working towards relaxing this.\n\nThey all take, as their sole input, the same configuration file, an\n[example of which is given here](https://github.com/drphilmarshall/Pangloss/blob/master/pangloss/example_catalog.txt).\n\nIn the calib directory we include the means to obtain the halo catalog \nfor a 1x1 square degree patch of Millennium Simulation sky, and its\nassociated ray traced convergence map, for making the calibration\nlightcones. A small mock observed galaxy catalog is included in the\nexample directory, for testing.\n\nTo get the test data, please do the following:\n\n    cd calib\n    Fetch.csh\n\nThe Fetch script uses wget. \nAdditional galaxy catalogs and ray-traced convergence maps from the\nMillenium Simulation are available from Stefan Hilbert on request.\n\nYou should then be able to execute the following example analysis:\n\n    cd example\n    Drill.py example.config\n    Reconstruct.py example.config\n    Calibrate.py example.config\n    \nAnalysing from start to finish will take some time. Be patient! \n(Drill ~2 mins, Reconstruct ~10 mins)\n\nFor more details of what the Pangloss scripts are doing, [start reading the code here.](https://github.com/drphilmarshall/Pangloss/wiki/Code-description)\n\nAlso, check out Tom's flowchart that describes the process of data simulation and testing carried out in Collett et al (2013):\n\n![Collet et al 2013 flowchart](https://github.com/drphilmarshall/Pangloss/blob/master/doc/flowchart.png?raw=true)\n\n## PDFs based on overdensities\n\nThe [original \nPangloss](https://github.com/drphilmarshall/Pangloss) has been \nmodified so that it can be used to find convergence and \nmagnification pdfs for any given group of fields based on \ncomparing overdensities of the observed fields with simulation \nlightcones.\n", 
  "id": 3673302
}