{
  "README": "-----------------------------------------------------------------------------\n-                                                                           -\n-   Copyright (C) 2014 Alex Bailey                                          -\n-                                                                           -\n-   'FIIOFS' is free software: you can redistribute it and/or modify it     -\n-   under the terms of the GNU General Public License as published by       -\n-   the Free Software Foundation, either version 3 of the license, or       -\n-   (at your option) any later version.                                     -\n-                                                                           -\n-   'FIIOFS' is distributed in the hope that it will be useful, but         -\n-   WITHOUT ANY WARRANTY; without even the implied warranty of              -\n-   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the           -\n-   GNU General Public License for more details.                            -\n-                                                                           -\n-   A copy of the GNU General Public License is available in the file       -\n-   'COPYING'; or for later versions see <http://www.gnu.org/licenses/>.    -\n-                                                                           -\n-   You can contact the author through the website:                         -\n-   alexanderbailey.github.io                                               -\n-                                                                           -\n-----------------------------------------------------------------------------\n\nThis is the README file for 'FIIOFS'. The project website is located at:\n\nalexanderbailey.github.io/software\n\n'FIIOFS' is mathematical software for computing Finite (Rees) Index Ideals Of Free Semigroups. Background material, pseduo-code and justification of the algorithms can be found in the paper [arxiv.org/abs/1409.2444].\n\n--------\nContents\n--------\n\nAfter extraction, the folder FIIOFS should contain the directories\n\n  ideals\n  ideals/n-2\n\nthe source code files\n\n  next_index_ideal.cpp\n  join_ideal.cpp\n  parallel_join_config_ideal.cpp\n  parallel_join_ideal.cpp\n  get_poly_ideal.cpp\n  read_file_ideal.cpp\n\nthe data files\n\n  ideals/n-2/n-2-k-1-i-1.bit8\n  ideals/n-2/n-2-k-2-i-1.bit8\n\nthe license file COPYING and this README file.\n\n----------------\nGeneral comments\n----------------\n\nThis functions in exactly the same way as 'FISOFS' except it calculates ideals instead of subsemigroups.\nSee the README file for 'FISOFS' for descriptions and examples of running the code.\n\nTo optimise space, the encoding of the files for ideals is slightly different than for subsemigroups, so any attempt to read subsemigroup data files instead of ideal data files will fail.\n\nPlease feel free to email me any bugs, questions or comments etc.\n\n\n", 
  "read_at": 1462549538, 
  "description": "Mathematical software for computing cofinite ideals of free semigroups", 
  "id": 37063744
}