{
  "read_at": 1462549628, 
  "description": "Computes lex minimizers / absolutely minimal Lipschitz extensions in graphs", 
  "README.md": "YINSlex\n=======\n\nThis contains the code used in the experiments from the paper\n  \"Algorithms for Lipschitz Learning on Graphs\" by Rasmus Kyng, Anup Rao, Sushant Sachdeva and Daniel Spielman,\n  COLT 2015.  \n  The paper is also available at http://arxiv.org/abs/1505.00290\n  \nThis repository presently contains code for computing lexicographic minimizers in undirected and directed graphs.\nThe code is written in java, and is meant to be called either from Matlab or from the command line.\n\nA jar file has been included, so it should not be necessary to compile the code.\n\nTo use the code from Matlab, type \"init\" in the main directory.\nThe two main routines in Matlab are compLex and compLexDirected.\ncompLex takes as input the adjacency matrix of a graph, followed by two vectors where and what giving the fixed voltages.  Where should be a vector of integers between 1 and the number of vertices, indicating which vertices have fixed values.  What indicates the values to which they are fixed.\nHere is an example with a 6-by-6 grid graph.\n\n```\n>> a = grid2(6);\n>> where = [1 6]; what = [0 1];\n>> v = compLex(a,where,what);\n>> reshape(v,6,6)\n\nans =\n\n         0    0.1429    0.2449    0.3178    0.3698    0.4070\n    0.2000    0.2857    0.3469    0.3907    0.4219    0.4442\n    0.4000    0.4286    0.4490    0.4636    0.4740    0.4814\n    0.6000    0.5714    0.5510    0.5364    0.5260    0.5186\n    0.8000    0.7143    0.6531    0.6093    0.5781    0.5558\n    1.0000    0.8571    0.7551    0.6822    0.6302    0.5930\n```\n\nIt is also possible to call the code directly from the command line. \nIn Unix-like environments, one can even do this from Matlab using the function\nlexFromFiles.\nIt has the advantage of allowing the java VM more memory than Matlab usually provides.\n\nTo invoke the code directly from the command line, one must provide it with a graph,\na description of the boundary conditions, and the name of the file to which it should write the output.\n\nAn example of a graph is in data/grid3.txt.\nThe first line contains two integers: the number of vertices and the number of edges.\nEvery successive line contains one edge given as two integers indicating the vertices followed\nby a float giving the length of the edge.\nNote that vertices are indexed from 0, and longer lengths indicate looser connections.\n\nAn example of a file giving the boundary conditions is in data/boundary.txt.\nThe first line consists of one integer indicating how many vertices are on the boundary.\nEach succesive line consists of an integer indicating the number of a vertex followed by its real number voltage.\n\nYou may run the code like:\n\n```\njava -cp out/YINSlex_jar/YINSlex.jar CompLexMinimizer data/grid3.txt data/boundary.txt voltages.txt\n```\n\nThe output file, voltages.txt, contains one float on each line giving the voltage\nat the corresponding vertex.\n\nThere are also versions of this code for directed graphs.\nThe matlab routines are compLexDirected and lexDirectedFromFiles.\nThe command line interface is CompLexDirected.\n\nThe most important thing to know about CompLexDirected is that in the listing\nof edges in its input graph, the destination vertex comes before the source vertex.\nHere is an example of the output of the code on a graph with 5 vertices and the voltages fixed at the endpoints.\n\n```\n$ cat data/path.txt\n5 4\n1 0 1.0\n2 1 1.0\n3 2 1.0\n4 3 1.0\n\n$ cat data/pathBdry.txt \n2\n0 1\n4 0\n$ java -cp out/YINSlex_jar/YINSlex.jar CompLexDirected data/path.txt data/pathBdry.txt voltages.txt\n$ cat voltages.txt \n1.0\n0.75\n0.5\n0.25\n0.0\n$ cat data/pathBdry2.txt \n2\n0 0\n4 1\n$ java -cp out/YINSlex_jar/YINSlex.jar CompLexDirected data/path.txt data/pathBdry2.txt voltages.txt\n$ cat voltages.txt \n0.0\n1.0\n1.0\n1.0\n1.0\n```\n\n", 
  "id": 37074544
}