{
  "read_at": 1462547136, 
  "description": "SARDONICS and Adaptive MCMC ", 
  "README.txt": "This package includes code for the SARDONICS sampler, the Intracluster Moves sampler as well as code for adapting these samplers by using Bayesian Optimization (aka GP-bandits).\n\n\n===================================\nBACKGROUND:\n===================================\nFor detailed background information, please refer to the 2 references cited below. This package also contains the code of a modified version of the Swendsen-Wang sampler by Iain Murray. For detail please refer to the folder 'swendsen_wang'.\n\n\n===================================\nINSTALLATION:\n===================================\n\nThis package was compiled on a Linux machine. But it should be easily modifiable to run on a Macintosh. This package requires several python packages including 'numpy', 'scipy', 'matplotlib', and 'pytalbes'. For the ease of installation, it is recommanded to install enthought which includes all the aformentioned packages. For simple installation, just run setup.sh. In case of an compilation error, please go through setup.sh and modify the relevant make files as needed. The code contains both c and python. If there is any problem compiling the code, please contact the author Ziyu Wang at ziyuw@cs.ubc.ca\n\n\n===================================\nKNOW ROUGH EDGES:\n===================================\nCurrently, due to memory allocation issues, the code crashes on some graphs sizes. \n\n\n\n===================================\nREFERENCES:\n===================================\n\n@article{hamze2011self,\n  title={Self-Avoiding Random Dynamics on Integer Complex Systems},\n  author={Hamze, F. and Wang, Z. and de Freitas, N.},\n  journal={Arxiv preprint arXiv:1111.5379},\n  year={2011}\n}\n\n@article{mahendran2011bayesian,\n  title={Bayesian optimization for adaptive MCMC},\n  author={Mahendran, N. and Wang, Z. and Hamze, F. and de Freitas, N.},\n  journal={Arxiv preprint arXiv:1110.6497},\n  year={2011}\n}", 
  "id": 3721371
}