{
  "read_at": 1462549333, 
  "description": "CL2QCD is a Lattice QCD application based on OpenCL, applicable to CPUs and GPUs.", 
  "README.md": "CL2QCD\n======\n\nCL2QCD is a Lattice QCD application based on OpenCL, applicable to CPUs and GPUs.\nIt provides the following executables:\n * `hmc` -- Generation of gauge field configurations for Nf=2 (Twisted Mass) Wilson type fermions\n * `su3heatbath` -- Generation of gauge field configurations for SU (3) Pure Gauge Theory\n * `rhmc` -- Generation of gauge field configurations for staggered type fermions\n * `inverter` -- Measurements of fermionic observables on given gauge field configurations\n * `gaugeobservables` -- Measurements of gauge observables on given gauge field configurations\n\nCL2QCD has been heavily optimized for AMD GPUs, providing world-class performance, but can also be used on NVIDIA GPUs and x86 CPUs.\n\nInstallation\n------------\n\nSee [INSTALL](INSTALL) for installation instructions.\n\nLicense\n-------\n\nCL2QCD itself is licensed under the GPLv3.\nHowever some bundled third-party code is licensed under different licenses.\nSee [COPYING](COPYING) for details.\n\nPublications\n------------\n\nThere have been a range of publications on CL2QCD.\nIf you use CL2QCD for your work please be so kind to cite one of our papers:\n\n* M. Bach, O. Philipsen, C. Pinke, and A. Sciarra \"CL2QCD - Lattice QCD based on OpenCL\", in The XXXII International Symposium on Lattice Field Theory, Lattice2014, 2014, http://arxiv.org/pdf/1411.5219.pdf.\n* M. Bach, V. Lindenstruth, O. Philipsen, and C. Pinke, \"Lattice QCD based on OpenCL\", Comput. Phys. Commun., vol. 184, no. 9, p. 19, Mar. 2013, http://pos.sissa.it/archive/conferences/187/032/LATTICE%202013_032.pdf.\n* M. Bach, V. Lindenstruth, C. Pinke, and O. Philipsen, \"Twisted-Mass Lattice QCD using OpenCL\", in The XXXI International Symposium on Lattice Field Theory, Lattice2013, 2013, http://arxiv.org/abs/1209.5942.\n* C. Pinke, O. Philipsen, C. Schafer, L. Zeidlewicz, and M. Bach, \"LatticeQCD using OpenCL\", 2011, http://arxiv.org/abs/1112.5280.\n\nMany technical details on CL2QCD and the optimizations included can be found in the PhD Thesis of Matthias Bach:\n\n* M. Bach, \"Energy- and Cost-Efficient Lattice-QCD Computations using Graphics Processing Units\", PhD Thesis, Goethe Universistat Frankfurt am Main, 2014, http://publikationen.ub.uni-frankfurt.de/frontdoor/index/index/docId/37074.\n\n", 
  "id": 37427285
}