{
  "read_at": 1462549402, 
  "description": "", 
  "README.md": "# addGP\nBayesian Additive GP regression\n\nGP is self-regulatory, i.e., it imposes some penalty on large rho.  The discrete grid choice of lambda also imposes regularization.  Additional penalty could be imposed by setting lp.lam.f and/or lp.rho.f to positive values (not used in existing simulated or real-data experiments).\n\nNote: Variaible selection for addGP can be performed by either \"Toggle\" and \"pMTM\".  These correspond to specific stochastic search variable selection schemes via Metropolis Hastings.  Both allow for adaptive MCMC via the updating of predictor propensity scores (i.e., \"varp\"); pMTM is a multiple-try analogue of Toggle, wherein multiple (i) add-remove, (ii) remove-add, and (iii) swap-swap paired moves are considered at each MCMC iteration.\n\n\n1. gp.c gives an implementation written completely in C.  This implementation allows for an optional low-rank approximation.  The default \"max-rank\" value is set at n = #training samples.  Consider reducing this for larger training data.  A potential rule of thumb is (2 * log(n))^2.\n\n2. gp.R gives an implementation written mostly in C, wrapped by R.  The C code draws helper functions from mydefs.c and spchol.c.  Additional description of input arguments to addGP are provided within.  To compile you must run:\n        ```\n        R CMD SHLIB gp.c mydefs.c spchol.c qsort.c\n        ```\n\n3. simu_gp.R runs addGP for simulated regression examples.  Specific options for pMTM include (a) pmtm.budget: neighborhood budget across \"ncomp\" components.  When pmtm.budget = 0, the implementation defaults to \"Toggle\" moves.  A reasonable default for the maximum number of components is sqrt(p), with a small per-component pMTM budget (e.g., 5); and (b) varp.update = {0, 99} (default: 99, adaptation is disabled; '0' will update using a basic diminishing adaptation scheme, see [arXiv-preprint](http://arxiv.org/abs/1411.7009) for details; additional \"similarity\" based updating may be implemented).\n\n\nInput / Ouput summary for addGP                                                                                                          \n====\n1. ARGUMENTS\n    * xvar - the predictor matrix as a column major vectors\n    * yvar - the response vector\n    * pincl - inclusion probability\n    * dim - integet vector of problem dimensions:\n        * n = # training samples\n        2. p = # predictors\n        3. ncomp = # compomponents\n        4. max_rank = # max low rank\n        5. nlam = length of discrete lambda grid\n        6. nrho = length of discrete rho grid\n        7. nsweep = #MCMC iterations\n        8. nburn = #mcmc burn-in\n        9. budget = pMTM neighborhood budget\n    * lamsqR - grid of lam^2 values, length = nlam\n    * rhosqR - grid of rho^2 vales, length = nrho\n    * hpar - (a, b) of the gamma(a,b) prior on 1 / sigma^2\n    * lplamR - log-prior over lam^2 grid\n    * lprhoR - log-prior over rho^2 grid                                                                                                              \n    * pmove -  move probabilities, 4*(p + 1) vector of (p.add, p.remove, p.swap, p.refresh) for comp size = 0, 1, ..., p\n    * lpenalty - log-penalty score for knots selection\n    * tolchol - tolerance levels for Cholesky factorizations                                                                                                 \n\n2. OUTPUTS\n    * nprop - tally of different moves proposed                                                                                                            \n    * nacpt - acceptance counts by move types\n    * varp - variable importance vector\n    * ix_store - Markov chain sample of inclusion\n    * par_store - Markov chain sample of covariance parameters\n    * active_store - Flags for active components\n    \nDisclaimer\n====\nThis open-source implementation is not for commerical use. Codes here may be used as-is or modified as needed. However, we ask that work making use of 'addGP' or its concepts provide citation to the following article:\n\nQamar, S. and Tokdar, S. T. (2014). Submitted. \n  Bayesian Additive Gaussian Process Regression. arxiv.org/abs/1411.7009\n\nFeel free to email me about bug finds or inquiries -- I'll do my best to respond.\n", 
  "id": 37539349
}