{
  "read_at": 1462549640, 
  "description": "An IDL wrapper to automate TiRiFiC", 
  "README.md": "# Fully Automated TiRiFiC (FAT)\n=====\n\nIntroduction\n------------\n\nThe Fully Automated TiRiFiC is an IDL wrapper around the tilted ring fitting code  (TiRiFiC) that aims to fully automize the process of fitting tilted ring models to line emission cubes. This code is still very much in the development phase and hence errors and bugs are to be expected. Nevertheless the code has extensively been tested and the results and a more extensive description of the code are documented in Kamphuis et al. 2015 (http://arxiv.org/abs/1507.00413) \n\nRequirements\n------------\nThe code requires full installation of:\n\n    IDL 7.0 or higher with astrolib\n    TiRiFiC v2.2.3 or higher (http://gigjozsa.github.io/tirific/download_and_installation.html)\n    SoFiA v 0.4.0 or higher  (https://github.com/SoFiA-Admin/SoFiA)\n    Standard unix commands pwd, mkdir, rm, cp, ls, python\n    \nIDL needs to be able to exececute tirific, sofia, rename and the standard unix commands from a spawn command. All other dependencies should be in IDL and available with the normal IDL distributions. \n\nInstallation\n------------\n\nUnpack the zip file in a desired directory and you are ready to run FAT from this directory under IDL. \nThe rename command might have to be aliased to rename -s, as this depends on which exact rename command and their are many versions available the code excutes the command \"rename originalstring replacestring filesonwhichtoexecute\" make sure that this is what the rename command does in the shell that is run by IDL.\n\nYou will also have to make a softlink in the Support directory to file sofia_pipeline.py in the sofia distribution i.e.:\n\n        cd Support/\n        ln -s pathtosofiainstallation/sofia_pipeline.py sofia_pipeline.py\n\nRunning FAT\n-----------\nFAT is currently run under IDL. It is called as a regular IDL program, i.e. in IDL:\n\n    IDL >.r FAT_vx.x\n\nwhere x.x is the version number\n\n    IDL >FAT,configfile='pathtodir/configfile.config',support='pathtosupportfilesdir'\n    \nAll information that the code needs about output directories fitting steps and input parameters are taken from the configfile.\nIf a config file is not given it will look for the file 'FAT_INPUT.config' in the directory from which FAT is run.\nThe default support directory is /Support however you can specify an alternative directory with the keyword support.\n\nConfiguration File\n------\n\nA configuration file will require the following parameters:\n\n        catalogue=Path_to_catalog_dir/Catalog.txt\n\nThe code requires a catalog with input sources to know which cubes to fit and where they are (See Below). There is no default for this.\n\n        maindir=Path_to_dir_with_input/\n\nThis is the path where the directories for all galaxies are stored. As FAT is still very much in a development state it still produces quite some output (e.g. Models for each step, xvdiagrams, Fitting logs). In order to keep this managable each galaxy requires its own directory. There is no default for this.\n\n        outputcatalogue=Path/nameofresult.txt\n\nThe code will write a summary of the succes of the fit for each galaxy in this file. No default\n\n        new_output='y'\n\nDo you want to write a new output catalogue. If set to 'n'  the existing log file will be appendended. Default ='y'\n\n        startgalaxy=0\n\nThe catalog number at which the code should start. The default is 0 which is the first line\n\n        endgalaxy=-1\n\nThe catalog number at which the code should stop. The default is -1 which means that it should run until the end of the catalog.\n\n        outputlog=fitlog.txt\n\nThe name of a log file that will trace the iterations and steps that the code is executing for each galaxy. This file is written into the galaxy directory. If left out no log file will be written and additional output will be printed to the terminal.\n\n        new_log='y'\n\nDo you want to write a new log file. If set to 'n'  the existing log file will be appendended. Default='y'\n\n        velocity_resolution=1\n\nThe velocity resolution of the data cubes. If set to zero the code assume that the instrumental dispersion is equal to a (1.2 x channel)/(2 x SQRT(2ln2)) otherwise (1+vresolution) x channel/(2 x SQRT(2ln2)). That is, if set to 1 it assumes Hanning smoothing. Default=1.\n\n        maps_output = 2\n\nA parameter to control the amount of outpur created by FAT.  0.= all possible output (This is a lot), 1= all steps model + maps + def files, 2 = Final model + maps + def files for steps + logs, 3 = Only final model def + logs. Default = 2\n\n\nThe following parameters are predominantly set for testing the code and normally best left to their defaults, i.e. unset.\n\n        testing=0\n\nparameter to skip certain steps of the fitting for testing. If set to 1 it will skip the flat disk fitting and assume all necessary files for step 2 are in place. Default= 0\n\n        allnew=1.\n\nParameter for setting the type of input for the initial guesses. possible setting are 0, 1, 2 \n0) use initial guesse produced by FAT in a previous run. This is not recommended but can slightly speed up the start of the fitting. However it can lead to mismatches if slight changes have occured between runs.\n1) FAT produces all initial input. Default\n2) Pre-produced SoFiA output should be used for the initial guesses. These need to be specified in the input catalog (See input catalog)\n\n        finishafter=2.\n\nParameter for finishing the fitting process early. if set to one the program finishes after fitting the flat disk. Default = 2\n\n        opt_pixelbeam=4.\n        \nThe amount of pixels in the FWHM of the minor axis. Default = 4.\n\n    \n\nA default config file (FAT_INPUT.config) is included in the distribution.\n\nInput Catalog\n-----------\n\nThe input catalog should have at least 4 columns named as \n\n        number|distance|directoryname|cubename\n\nand seperated by |\nThe number is an easy identifier to keep track of which galaxy is being fitted.\nthe distance is the distance to the galaxy in Mpc. This is used to make some initial guesses for the structure of the galaxy. If it is unknown it should be set to 1.\nThe directory name is the name of the directory of the galaxy to be fitted. This directory should be located in the specified maindir in the config file.\ncubename is the name of the cube to be fitted. This should be without the fits extension.\n\nAn example catalog is included in the distribution. This also gives examples for how to set up a cataog when using pre-made sofia input, i.e. allnew=2\n\n\n\n", 
  "id": 37632453
}