{
  "README": "XXX there are more notes in net.c++\nXXX conjectures about polyhedra with all face planes unit distance from origin\n\n\nNOTES ON SHEPHARD'S CONJECTURE\n\nTrying to organize all the conjectures and counterexamples I know\nrelated to Shephard's conjecture, roughly in order of strength,\nstrongest (false) to weakest (true).\nI'm mainly interested in trivalent polyhedra at this point,\nso I'll stick to those.\n\n\nCONJECTURES ABOUT SPECIFIC STRONGER UNFOLDINGS THAT FOLLOW A PATTERN:\n\n* For every trivalent convex polyhedron,\n  the sharpest-dihedral-sum spanning cut tree is the cut tree of an unfolding\n  [false, since it implies the next one which is false]\n\n* Every trivalent convex polyhedron has an unfolding in which\n  the sharpest edge at every vertex is a cut.\n  [false. counterexample: netless9, i.e. hexes spiral]\n\n* For every trivalent convex polyhedron,\n  the dullest-dihedral spanning fold tree is a good unfolding\n  [false, since it implies the next one which is false]\n\n* Every trivalent convex polyhedron has an unfolding in which\n  the dullest edge at every face is a fold.\n  [false, counterexample: CannedThingHexesSpiralOther]\n\n* Every trivalent convex polyhedron has an unfolding in which\n  the dullest edge at every vertex is a fold.\n  [false, easy counterexample: just take a regular pentagonal prism\n  (jittered slightly so trivalent),\n  or a slightlys squashed regular tetrahedron,\n  or a regular 7-gon in the plane with edges going straight out\n  from the center-- those spokes can't all be folds.]\n\n* Every trivalent convex polyhedron has an unfolding in which\n  the sharpest edge at every face is a cut.\n  [false, easy counterexample: take a finely tesselated sphere,\n  and intersect it with a half-space that retains about half of it.\n  the edges around the big face can't all be cuts]\n\n[similar conjectures about unfoldings which cut dullest edges\nor fold sharpest edges omitted, since they seem unlikely]\n\n[similar conjectures about unfoldings that cut shortest edges\nor fold longest edges should be included, though]\n\n[also some sort of weighted combinations of longest-dullest\nor shortest-sharpest criteria would be interesting]\n\n\nCONJECTURES ABOUT STRONGER UNFOLDINGS INVOLVING SWEEPS:\n\n* For every trivalent convex polyhedron,\n  for every sweep direction, there is an unfolding\n  in which the cut tree follows the sweep direction\n  [false, counterexample: sweepKiller, or sweepKiller1]\n\n* For every trivalent convex polyhedron,\n  there is a sweep direction and an unfolding\n  in which the cut tree follows the sweep direction\n  [false, counterexample: something with lots of little sweepKillers\n  at different angles, to thwart every possible sweep direction.\n  angle delta just needs to be small enough so that turning that much\n  doesn't move any edge past horizontal.)\n\n* For every trivalent convex polyhedron,\n  for every sweep direction, there is an unfolding\n  in which the faces and folds follow the sweep direction\n  [unknown, implies the following]\n\n* For every trivalent convex polyhedron,\n  there is a sweep direction and an unfolding\n  in which the faces and folds follow the sweep direction\n  [unknown]\n\n\n\n\n\nCONJECTURES ABOUT REFINEMENTS:\n\n* Given any unfolding F of a trivalent convex polyhedron P,\n  and a trivalent convex polyhedron P' which refines P\n  (i.e. is obtained from P by intersecting with one or more additional\n  face plane halfspaces),\n  there is an unfolding of F' of P' that refines F\n  (i.e. for each edge e of P and e' of P' such that e' is part of e,\n  e' is a cut in F' iff e is a cut in F).\n  [false, counterexample: netless8]\n\n* There is a function f from trivalent convex polyhedra to unfoldings,\n  such that for every trivalent convex polyhedron P, f(P) is an unfolding\n  of P, and for every P and P' such that P' is a refinement of P\n  (i.e. formed by intersecting with more face places),\n  f(P') is a refinement of f(P).\n  [unknown, implies planar-trivalent-shephard's.\n   Note that blindly picking an arbitrary unfolding that refines\n   all previously chosen unfoldings doesn't work,\n   since it leads to a dead end, as shown in previous conjecture]\n\n\nCONJECTURES ABOUT ALGORITHMS:\n\n* There is an algorithm for producing an unfolding\n  of every trivalent convex polyhedron whenever one exists,\n  that only makes local decisions (i.e. the decision of whether\n  to cut an edge depends on examining only a fixed bounded graph distance\n  away)\n  [unknown]\n\n* There is a polynomial time algorithm\n  for producing an unfolding of every trivalent convex polyhedron\n  whenever one exists.\n  [unknown]\n\n* There is a nondeterministic polynomial time algorithm\n  for producing an unfolding of every trivalent convex polyhedron\n  whenever one exists.\n  [true, since a proposed unfolding can be checked in polynomial time]\n\n* There is a polynomial time algorithm\n  for proving there is no unfolding of a given trivalent convex polyhedron,\n  when there isn't\n  [unknown, trivalent shephard's implies this trivially]\n\n* There is a nondeterministic polynomial time algorithm\n  for proving there is no unfolding of a given trivalent convex polyhedron,\n  when there isn't\n  [unknown, trivalent shephard's implies this trivially]\n\n\n* The problem of finding an unfolding of a trivalent convex polyhedron\n  if one exists is NP-hard (which is equivalent to saying it's NP-complete,\n  since the problem is obviously in NP)\n  [unknown]\n  [XXX generally I've tried to state all conjectures as\n  \"for all polyhedra there exists an unfolding...\"\n  or \"there exists an algorithm\", however this one is backwards...\n  maybe this conjecture should be replaced with its negation]\n\n\nCONJECTURES ABOUT SINGLE CRACKS:\n\n[XXX need to explain exactly what I mean by infinite planar polyhedron\n and crack]\n\n* In any trivalent \"infinite planar\" polyhedron,\n  for every vertex v and edge e incident on v,\n  there is an infinite crack whose head is v\n  and whose first edge is e.\n  [false, counterexample: crackkiller]\n\n* In any trivalent \"infinite planar\" polyhedron,\n  For every pair of vertices v0,v1,\n  there is an infinite tree with at most one fork\n  whose heads are at most v0 and v1\n  and which contains the sharpest edge at v0 and v1 respectively.\n  [unknown, implies the following]\n\n* In any trivalent \"infinite planar\" polyhedron,\n  For every vertex v, there is an infinite crack\n  whose head is v and whose first edge is the sharpest\n  edge at v.\n  [unknown]\n\n* In any trivalent \"infinite planar\" polyhedron,\n  For every pair of vertices v0,v1,\n  there is an infinite tree with at most one fork\n  whose heads are at most v0 and v1.\n  [unknown, implies the following]\n\n* In any trivalent \"infinite planar\" polyhedron,\n  For every vertex v, there is an infinite crack\n  whose head is v.\n  [unknown]\n\n* In any trivalent \"infinite planar\" polyhedron,\n  For every pair of vertices v0,v1,\n  there is an infinite crack\n  containing v0 and v1.\n  [unknown, probably false, probably not very useful, implies the following]\n\n* In any trivalent \"infinite planar\" polyhedron,\n  For every pair of vertices v0,v1,\n  there is an infinite tree with at most one fork\n  containing v0 and v1.\n  [unknown, implies the following]\n\n* In any trivalent \"infinite planar\" polyhedron,\n  For every vertex v, there is an infinite crack\n  containing v.\n  [unknown]\n\n\nCONJECTURES ABOUT UNFOLDINGS ON INFINITE PLANAR POLYHEDRA WITH 3 INFINITE EDGES:\n\n* For every trivalent planar polyhedron with exactly 3 infinite edges,\n  for each of those infinite edges, there is an unfolding\n  in which that infinite edge is a cut and the other two are folds\n  [false, counterexample: netless8]\n\n* Every trivalent planar polyhedron with exactly 3 infinite edges\n  has an unfolding in which its sharpest infinite edge\n  is a cut and the other two infinite edges are folds\n  [unknown, implies the next one which implies planar-trivalent-shephard's]\n\n* Every trivalant planar polyhedron with exactly 3 infinite edges\n  spaced regularly\n  has an unfolding in which exactly 1 of the 3 infinite edges\n  is a cut\n  [unknown, implies planar-trivalent-shephard's]\n\nOTHER CONJECTURES ABOUT INFINITE PLANAR POLYHEDRA:\n* Every trivalent planar polyhedron has an unfolding\n  in which every subtree has a center of curvature\n  no higher than the vertex it hangs from, if the edge it hangs from\n  is oriented vertically\n  [trivalent shephard's is equivalent to this,\n  I believe, although definitions need to be nailed down]\n  [see observations, down below]\n\n\n\n\n\n\nSHEPHARD'S CONJECTURE:\n\n* Shephard's Conjecture: every convex polyhedron has an unfolding.\n\n* \"Trivalent Shephard's Conjecture\":\n  Every trivalent convex polyhedron has an unfolding.\n  (This is apparently weaker than Shephard's conjecture.\n   But if shephard's is false and this is true,\n   that would mean there is a non-trivalent polyhedron\n   that is not unfoldable, but every infinitesimal perterbation of it\n   into a trivalent polyhedron is unfoldable-- which means\n   every unfolding of such a perturbation of it\n   must have a fold on one of those infinitesimal introduced edges,\n   which seems unlikely.)\n\n- Every convex polyhedron with planes all unit distance from origin\n  has an unfolding.\n  (in plane, these correspond to voronoi diagrams)\n\n- Every trivalent convex polyhedron with planes all unit distance\n  from origin has an unfolding.\n  (in plane, these correspond to non-degenerate voronoi diagrams)\n\n\n\nCONJECTURES ABOUT HIGHER DIMENSIONS:\n\n* 4d shephard's: Every convex polychoron (4d polytope) has an unfolding.\n\n* 4d tetravalent shephard's: Every tetravalent convex polychoron (4d polytope)\n  has an unfolding.\n  [unknown - I think I had the impression at one time\n   that this was easy though--\n   obviously true, or there is an easy counterexample?]\n\n\n\n\n\n\n============================================================================\n\nOBSERVATIONS ABOUT INFINITE PLANAR POLYHEDRA (TILINGS):\n\nI believe that deciding Shepard's conjecture\nboils down to a question about planar tilings,\n(i.e. certain certain degenerate convex polyhedra).\n\nThat is, I believe that if Shephard's conjecture in the plane\nis shown to be true using an algorithm, then that algorithm can be made\nto work on actual polyhedra,\nand if Shephard's conjecture in the plane is false,\nthen a counterexample to it can be easily modified\n(by projecting onto a sufficiently large sphere or paraboloid) to form\na polyhedron counterexample to Shephard's conjecture.\n\nMaybe that conjecture can be proved formally, independently\nof any of the others, that is:\n    If Shephard's conjecture is false,\n    i.e. if there's a netless convex polyhedron,\n    then there's a netless convex polyhedron\n    where the impossible part is arbitrarily close to flat.\n    (Maybe even with same structure as the original?)\n\nRestricting our attention to planar tilings\nsimplifies some details so that there is less to think about,\nand we get some nice duality properties.\n\nAs usual, I'm restricting my attention to trivalent tilings.\nFurthermore when I say \"trivalent planar tiling\", I mean one\nthat is the limit of a process in which\npart of the surface of a polyhedron becomes flatter and flatter.\nSo this excludes planar tilings which don't arise as such a limit,\ne.g. a regular polygon with all the spokes emanating from it\ntwisted slighly counterclockwise\n(more on the impossibility of this case in (6) below).\n\n[XXX to be precise, I want to restrict attention\nto tilings of the whole plane, consisting of a finite number of vertices,\nedges, and convex cells, with some of the edges and cells infinite.\nNeed to give this class of tilings a good clear name.]\n\n[XXX and note that when I say cut tree or forest,\nI mean a cut tree or forest that produces an unfolding tree,\noverlapping or not...\ni.e. the cut forest must be a spanning forest, and every tree in it has exactly one\ninfinite edge (less than one: unfolding would be cyclic;\nmore than one: unfolding would be disconnected)\nThink whether there is a better crystal clear definition for this.\nShow examples of the various cases and near misses.]\n\nThe following observations are stated without proof;\nthey become evident from playing with planar tilings:\n\n(1) Every infinite trivalent planar tiling has a dual triangulation,\n    which is unique up to translation and scale\n    (obtained as the limit of the spherical-reciprocal polyhedra\n    of the sequence of polyhedra whose limit is the tiling),\n    although many trivalent planar tilings map to the same dual triangulation.\n    The original tiling is fully specified by its dual triangulation\n    and an infinitesimal \"height above the sphere\"\n    for each dual vertex (or, equivalently,\n    an infinitesimal depth below the sphere\n    for each face plane in the original tiling).\n\n    When all these heights-above-the-sphere are zero,\n    the tiling is a Voronoi diagram\n    and the dual triangulation is a Delaunay triangulation,\n    and in that case each Voronoi vertex is the circumcenter\n    of the corresponding dual Delaunay triangle.\n    This is the limiting case of the\n    analagous condition for polyhedra,\n    which is that the primal trivalent polyhedron has an insphere\n    and the dual polyhedron (whose faces are all triangles) has a circumsphere.\n\n    [XXX pictures of simple examples]\n\n    Note that if we omit the trivalent condition,\n    we do *not* necessarily get a unique dual.\n    [XXX picture of simple example]\n    Since uniqueness of the dual is what allows us to\n    compute gaussian curvatures (as will be explained below),\n    this is the main reason we avoid non-trivalent tilings.\n\n(2) The edge curvatures (i.e. the infinitesimal values\n    pi minus dihedral angle of an edge)\n    are proportional to dual edge lengths in the dual triangulation\n    (so they are independent of the height-above-the-sphere values;\n    i.e. pushing face planes in and out without changing the structure or angles\n    does not change dihedrals; this is true in general about polyhedra).\n    (This is the limiting case of the statement\n    that the dihedral angle of an edge of a non-degenerate polyhedron\n    is equal to the arc length of the spherical arc\n    obtained by projecting the dual edge onto the unit sphere.)\n\n    This tells us that, at any (trivalent) vertex,\n    we can recognize the sharpest of the three dihedral angles\n    by any of the following equivalent criteria:\n        * it has the longest of the three edges on the dual triangle\n        * its opposite angle on the dual triangle is largest\n        * its opposite interior angle in the primal tiling is smallest\n    Similarly, the dullest of the three dihedrals is the one\n    satisfying the exact opposite criteria.\n\n    (Similar criteria hold for non-degenerate polyhedra, as well.)\n\n            +\n            |   .     sharpest\n            |       . /\n            |        /  .\n   dullest ---------+       .\n            |       |           .\n            +-------|---------------+\n                    |\n                        \n\n\n(3) The vertex (gaussian) curvatures (i.e. the infinitesimal values 2 pi minus\n    sum of interior angles at a vertex)\n    are proportional to the respective triangle areas in the dual triangulation\n    (so they are independent of the height-above-the-sphere values;\n    i.e. pushing face planes in and out without changing the structure or angles\n    does not change vertex curvatures; this is true in general about polyhedra).\n    (This is the limiting case of the statement\n    that the gaussian curvature of a vertex of a non-degenerate polyhedron\n    is equal to the area of the spherical triangle obtained by projecting\n    the dual face onto the unit sphere.)\n\n(4) Define the total curvature of any region of a tiling\n    to be the sum of the curvatures of all the vertices in the region\n    (i.e. sum of the respective dual triangle areas).\n    Define the center of curvature of a region to be\n    the weighted average of the positions of the vertices in the region,\n    using each vertex's curvature as its weight.\n    Then it's immediately clear that total curvature\n    and center of curvature of regions are additive\n    in the obvious way; that is, given a disjoint union of regions,\n    the curvature of the union is the sum of the curvatures,\n    and the center-of-curvature of the union is the weighted average\n    of the centers-of-curvature of the individual regions.\n    Furthermore, total curvature and center-of-curvature of a region are robust,\n    in the sense that truncating or un-truncating by introducing, removing,\n    or adjusting face planes within a region never changes the curvature\n    or center-of-curvature of the region.\n    (Robustness of total curvature is fairly obvious, by noticing\n    that it is a statement about sums of triangle areas in the dual\n    triangulation, which doesn't change under any of the listed operations;\n    robustness of center-of-curvature is not obvious at all, to me.)\n\n    [XXX REF: I made web pages proving the nontrivial inductive step:\n        - circumCenterProof1.svg: swapping quad diagonal doesn't change center-of-curvature\n        - circumCenterProof2.svg: removing a trivalent vertex, or adding a vertex\n                in the middle of a triangle, doesn't change center-of-curvature]\n\n    Note that total curvature clearly maps to a property\n    of the dual triangulation, namely total area of the dual triangles.\n    However, unfortunately, center-of-curvature doesn't seem to\n    map so nicely to any clear property in the dual triangulation.\n    An exception is the Voronoi/Delaunay case (see (1) above),\n    in which the center of curvature of each triangle is its circum-center.\n    In this case the center of curvature of any union of triangles\n    is the \"generalized circum-center\" of the union polygon.\n    (It turns out, surprisingly, that this is a robust concept\n    even for non-cocircular polygons;\n    that is, we can define the generalized circum-center\n    of any polygon to be the area-weighted average of the circumcenters\n    of the triangles in any triangulation of it,\n    and we get a consistent answer regardless of the particular triangulation.)\n\n    [XXX example, of a single trivalent vertex\n     and then finely truncated... same curvature and center-of-curvature]\n\n(5) We can always calculate the center-of-curvature\n    of a set of vertices in a trivalent planar tiling\n    by drawing the dual triangulation and using the dual triangle areas\n    as weights to find the weighted average of the vertices.\n    But if we have two vertices v0,v1 joined by an edge,\n    the following method is often a more direct way of locating their\n    center of curvature.\n    Label the four other edges incident on the edge v0v1\n    A,B,C,D in counterclockwise order, so that A,B are incident on v0\n    and C,D are incident on v1:\n\n          A          D\n           \\         |\n            \\        |\n             v0-----v1\n            /         \\\n           /           \\\n          B             C\n\n    We know that the center-of-curvature is some non-negative-weighted\n    average of v0 (intersection of A and B) and v1 (intersection of C and D),\n    i.e. it lies somewhere on the edge joining them.\n    By the previous robustness statement about center-of-curvature,\n    the center of curvature doesn't depend on the specific structure\n    of what's going on inside a region, so we can think of a region\n    around the edge v0v1 as a black box:\n          A          D\n           \\         |\n          ..............\n          :            :\n          :............:\n           /           \\\n          B             C\n    And we know that the center-of-curvature lies on the segment joining\n    the intersection of A and B with the intersection of C and D.\n    By symmetry, we might expect that the center-of-curvature\n    will also lie on the segment joining the intersection of B and C\n    with the intersection of A and D,  It turns out that that is\n    in fact the case, and this allows us to locate the center-of-curvature\n    exactly, by simply intersecting lines and connecting intersection points.\n\n    Extend A and D so that they meet at a point p,\n    and extend B and C so that they meet at a point q:\n\n                 q \n          A     /.\\  D\n           \\   / . \\ |\n            \\ /  .  \\|\n             v0---.-v1\n            / \\   .  |\\\n           /   \\   . | \\\n          B     \\  . |  C\n                 \\ . |\n                  \\ .|\n                   \\.|\n                    \\|\n                     p\n\n    Then the center of curvater of v0 and v1\n    is the intersection of the lines v0v1 and pq.\n\n    [XXX transcribe into a nicer picture]\n\n(6) Given a polygon in a trivalent planar tiling,\n                  | \n         ----+----+\n            /      \\ /\n        ---+        +\n           |        |\n           +        +---\n          / \\      /\n             +----+\n             |    ???\n   [XXX transcribe into a nicer picture]\n   and given the directions of all but one of the spokes\n   emanating from that polygon, the direction of the last spoke\n   is uniquely determined.\n   That's easy to see by drawing the dual triangulation:\n   if we've drawn all but one of the dual triangles incident on the center,\n   then the last one is determined.\n\n   In particular, consider the case when the polygon is regular,\n   and all but one of the spokes is tilted slightly counterclockwise.\n   Drawing the dual triangulation, it's evident that the triangles\n   get larger and larger as we travel around the polygon clockwise,\n   but the final/largest dual triangle\n   (corresponding to the final vertex of the polygon)\n   will be adjacent to the first/smallest dual triangle,\n   which means the final spoke must be tilted clockwise\n   instead of counterclockwise.\n   I.e. the spokes emanating from a regular\n   polygon can't all spiral out in the same direction\n   (counterclockwise or clockwise).\n\n(7) Given a cut tree (or forest),\n    and a vertex v and edge e incident on v\n    such that the subtree consisting of all nodes and cuts\n    closer in the cut tree to v than to e is finite,\n    call v,e \"unbalanced\" if the center of curvature c of that subtree\n    is strictly \"higher\" than v (i.e. c on the e side\n    of the line through v perpendicular to e),\n\n    (Note, in the definition of unbalanced, sometimes it's more convenient\n    to exclude v from the center of curvature calculation.  Whether we choose\n    to include or exclude v has no effect on whether the result is\n    higher than v or not, so the definition ends up the same either way.)\n\n    If there is an unbalanced v,e, then the unfolding has an (infinitesimal)\n    overlap.\n\n                        |       ........\n                        |e      :  \\ / :\n                        |       : c +  :\n                        v       :  /   :\n              ....     / \\  ....: /    :\n              :  :..........:    /     :\n              :      /\\   /\\    /      :\n              :             +--+       :\n              :                 \\      :\n              .........................:\n\n    This is the planar/degenerate version\n    of Alpha/Beta Rule 1 of Alex Benton's dissertation,\n    namely that beta_Q >= pi/2, where beta_Q is the angle formed\n    by c,v,e. c is the Virtual Root of the subtree.\n    (In the non-degenerate case, the Alpha/Beta rule condition is that\n    beta_Q >= (pi-alpha_P)/2, but in the degenerate case\n    alpha_P is infinitesimal so the rule becomes simply beta_Q >= pi/2.)\n\n    I'm pretty sure the converse is true as well;\n    that is, if a cut tree is \"completely balanced\"\n    (i.e. there are no unbalanced v,e)\n    then the resulting unfolding is non-overlapping.\n    I certainly can't think of any way in which this could fail.\n\n    I believe this will be the key to solving Shephard's conjecture:\n    that is, if Shephard's conjecture is false,\n    then the simplest counterexample will be\n    a planar tiling such that every cut tree\n    has an unbalanced v,e (such a counterexample leads easily to\n    an actual nondegenerate polyhedral counterexample, by projecting\n    onto the surface of a large sphere or paraboloid).\n    And, if Shephard's conjecture is true, then I think it can be proved\n    by first proving that every planar tiling has a completely balanced\n    cut tree, and by then using the same technique to come up with\n    an algorithm for the messier details of the non-degenerate case.\n\n(8) Given any cut tree and any vertex,edge v,e with v incident on e,\n    such that the subtree consisting of all nodes and cuts\n    closer in the cut tree to v than to e is finite,\n    call that finite subtree the \"lagoon\" formed by removing e\n    from the cut tree.\n\n    The final (conjectured) algorithm of Alex Benton's dissertation\n    proceeds by taking an unfolding and repairing it\n    by repeatedly removing a bad edge\n    and replacing it with a good exit from the resulting lagoon.\n    This relies on some unproven properties of lagoons and good exits.\n\n    It is easy to prove that every lagoon\n    has at least one \"good exit\",\n    that is, an edge e' with one of its vertices v' in the lagoon\n    and the other v'' out of it, such that v',e' is balanced.\n    (v' can be taken to be any vertex in the lagoon\n    at maximal distance from the center of curvature of the lagoon).\n\n    Conjecture: there are always at least *two* good exits\n    from any lagoon formed in this way.\n\n    Series of weaker conjectures:\n        STRONGEST (known false)\n        every lagoon has at least three good exits\n                (counterexample: one edge, with a bad exit out of each endpoint)\n        <=> false\n         => every lagoon has at least two good exits  (MAIN CONJECTURE)\n         => every convex lagoon as at least two good exits\n                (where \"convex\" means it includes every vertex in its convex hull)\n         => every lagoon that's a *subset* of the verts of one polygon has at least two good exits\n         => every lagoon consisting of the verts of one polygon has at least two good exits\n                (WORKING ON A PROOF OF THIS ONE)\n         -> every left-right symmetric lagoon consisting of the verts of one polygon has at least two good exits\n         => true\n        <=> every lagoon has at least one good exit\n                (true, since there's a good exit out of any vertex at maximum distance from center)\n        WEAKEST (known true)\n    or, to phrase the series in reverse:\n        STRONGEST (known false)\n        there's a lagoon with no good exit\n                (false, since there's a good exit out of any vertex at maximum distance from center)\n        <=> false\n         => there's a left-right symmetric lagoon consisting of the verts of one polygon with at most one good exit\n         => there's a lagoon consisting of the verts of one polygon with at most one good exit\n         => there's a lagoon that's a subset of the verts of one polygon with at most one good exit\n         => there's a convex lagoon with at most one good exit\n         => there's a lagoon with at most one good exit  (NEGATION OF MAIN CONJECTURE)\n         => true\n        <=> there's a lagoon with only two good exits\n                (example: one edge, with a bad exit out of each endpoint)\n\n    Related statements (might fit into the above heirarchies somehow,\n    or might be helpful in proving them):\n        for every polygon, for every point in interior, there's at least two\n            verts at local maximum distance (FALSE)\n        for every polygon, there's at least two verts at local maximum distance from cc\n            (UNKNOWN, implies every polygon has at least two good exits)\n        ...\n        for every lagoon, there's at least two verts at local maximum dist from cc\n            (UNKNOWN, implies previous)\n        add \"all faces tangent to sphere\" to any/all of above conjectures (weaker)\n        replace \"lagoon/polygon\" with \"left-right symmetric lagoon/polygon\" in any/all of above conjectures (weaker)\n\n\n\n-----------------------------------------------\nRequired reading:\n\n2006 Brendan Lucier's master's dissertion \"Unfolding and Reconstructing Polyhedra\"\nAug 20 2007 Benton/O'Rourke \"Unfolding Polyhedra via Cut-Tree Truncation\" http://www.dremel.com/en-us/tools/Pages/ToolDetail.aspx?pid=1100-N%2f25\n        also http://cs.smith.edu/~orourke/Papers/trunc.pdf\nFeb 5, 2008 O'Rourke \"Band Unfoldings and Prismatoids: A Counterexample\" http://arxiv.org/pdf/0710.0811.pdf\nFeb 4, 2008 Benton/O'Rourke \"A Class of Convex Polyhedra with Few Edge Unfoldings\" http://arxiv.org/pdf/0801.4019.pdf\n        also shorter (?) version later, august: http://cs.smith.edu/~orourke/Papers/geodome.pdf\nSep 7 2008 Alex Benton's dissertation \"Unfolding Polyhedra\" http://bentonian.com/Papers/Dissertation/Dissertation.pdf\n\nQ: I noticed a mistake in one of the papers by benton&orourke-- it claimed to have proved something\nwhich isn't true.  What was it?  Doesn't seem to be any of the ones above, so far.  Bleah!  Was it a paper that also said \"this proves there's no proof of shephard's conjecture based on a random argument\"\n\n", 
  "read_at": 1462549652, 
  "description": "playing around with Shephard's conjecture", 
  "id": 38186839
}