{
  "README": "\nGFRD Simulator\n==============\n\nE-Cell Particle Dynamics Prototype by Koichi Takahashi and Moriyoshi Koizumi.\nAdapted by Thomas Miedema, Laurens Bossen and Thomas Sokolowski.\n\nCopyright (C) 2005-2008 The E-Cell Project\n\nCopyright (C) 2009 FOM Institute AMOLF, The Netherlands.\n\n\n\nAbout this package\n------------------------\n\nThis package is started of from version 0.3 of the E-Cell Particle Dynamics\nPrototype (epdp):\nhttp://www.e-cell.org/ecell/software/releases/epdp-0.3/epdp-0.3.tar.gz\n\nJust as that package it implements the enhanced Greens Function Reaction\nDynamics (eGFRD), and brute-force Brownian Dynamics (BD) simulation\nalgorithms. Additionaly it support reaction-diffusion on and with 1D\nand 2D surfaces.\n\nThe code is implemented with the hope that it will eventually be\nincluded into the epdp package, and also function as a standalone GFRD\nimplementation.\n\nThe eGFRD algorithm is used and described in the following paper:\nK. Takahashi, S. Tanase-Nicola, P.R. ten Wolde, 2009 (in preparation).\n\n\nBuilding this package\n------------------------\n\nSee INSTALL.\n\n\nHistory of the Code\n------------------------\n\nKoichi Takahashi initially stated development of the code in 2005 to\nimplement his prototype of Greens Function Reaction Dynamics\nsimulation method invented by Jeroen van Zon and Pieter Rein ten Wolde\nin AMOLF, Amsterdam[1,2].  He gave a brief invited talk about\nperformance evaluation and applicability of the method to yeast\npheromon response pathway (the Alpha pathway) using the prototype in\nThird Annual Alpha Project Research Symposium (June 16-27, 2005, at UC\nBerkeley Art Museum).\n\nLater, in December 2006, ten Wolde, Sorin Tanase-Nicola, and Takahashi\ndecided to introduce the concept called first-passage processes\ninspired by a paper by Opplestrup et al.[3] to Greens Function\nReaction Dynamics to further boost the performance and accuracy of the\nmethod.  The new method was called eGFRD (enhanced Greens Function\nReaction Dynamics).  Takahashi implemented the single-body Greens\nfunction within the year.  Tanase-Nicola derived the two-body Greens\nfunction, and Takahashi devised and implemented a neat yet complicated\nway to efficiently evaluate the function mostly in the first half of\n2007.  Takahashi also implemented the main part of the code,\nasynchronous discrete-event-driven kinetic monte-carlo, which has been\nmostly finished within 2007, and the dynamic switching between Greens\nfunction and brute-force Brownian Dynamics as a means to recover from\nparticle squeezing conditions by April 2008.  At this point,\ndevelopment and debugging of the initial version (version 0.1) of the\ncode had been largely finished and had been used in simulation experiments\nin study of various biochemical systems including dual-phosphorylation\npathways[4].\n\nThomas Miedema and Laurens Bossen, while masters students in the group of\nPieter Rein ten Wolde at AMOLF, added support for reaction-diffusion on\nand with 1D and 2D surfaces. Laurens implemented the 1D and 2D Green's\nfunctions in C++, Thomas implemented the algorithm in Python.\n\nIn 2009 Thomas Sokolowski and Nils Becker joined the project. Thomas S.\nwill extend the scheme to be able to simulate active transport processes\nvia molecular motors. This requires the calculation of new Green's\nfunctions starting from the diffusion-drift equation. Nils B. recently\nstarted working on the interplay of DNA sliding and 3D diffusion.\n\nList of features planned to be added:\n\n- interactions between membrane proteins and proteins in solution\n- diffusion-drift movement on one-dimensional structures to simulate\n  active transport\n- interaction of particles with arbitrary 2-dimensional manifolds\n\nReferences:\n\n- [1] Green's-function reaction dynamics: a particle-based approach for\n    simulating biochemical networks in time and space; \n    van Zon and ten Wolde, J. Chem. Phys. 123 (2005).\n- [2] Simulating biochemical networks at the particle level and in\n    time and space: Green's function reaction dynamics; \n    van Zon and ten Wolde, Phys. Rev. Lett. 94 (2005).\n- [3] First-Passage Monte Carlo Algorithm: Diffusion without All the Hops,\n    Opplestrup et al., Phys. Rev. Lett. 97 (2006).\n- [4] Spatio-temporal correlations can drastically change the response of a\n    MAPK pathway; Takahashi, Tanase-Nicola, ten Wolde, arXiv:0907.0514v1 (2009)\n\n\n", 
  "read_at": 1462558512, 
  "description": "Green's Function Reaction Dynamics", 
  "id": 383782
}