{
  "read_at": 1462546478, 
  "description": "Forced photometry of the unWISE images given SDSS objects", 
  "README.md": "# unwise-sdss-phot\nForced photometry of the unWISE images given SDSS objects\n\nResults described in \nhttp://arxiv.org/abs/1410.7397\nand available at http://unwise.me\n\n\n\n\nForced photometry of the WISE images given SDSS detections\n----------------------------------------------------------\n\nThe data described here are available at:\n\nhttp://unwise.me/\n\nor for SDSS folks,\nriemann:/clusterfs/riemann/raid000/dstn/wise-sdss-forced-phot\n\n\nProcessing summary:\n-------------------\n\nI took all SDSS \"v5b\" survey_primary objects, and found all unWISE\ncoadd tiles touching them.\n\nThe \"unWISE coadds\" are new coadds of the WISE imaging, described in\n[Lang 2014, AJ, 147, 108].\n\nThe unWISE tiles have the same centers as the official WISE Atlas\nImages; they are on equal-Dec rings, roughly 1.5 x 1.5 degrees in\nsize, with a bit of overlap.\n\nFor each tile, I gathered all the SDSS objects within and near the\ntile, and then cross-matched to the WISE catalog (\"AllWISE release\")\nto find WISE-only sources.  I treat the WISE-only sources as point\nsources, since no profile-fit measurements in the form I need are\navailable in the WISE catalog.  For SDSS sources, I apply some tests\nfor sources that do not have reliably measured sizes, and treat those\nas point sources in the forced photometry; there is a flag for that in\nthe output files.\n\nWith that list of sources, I apply the WISE PSF model to predict the\nappearance of each object in the WISE image, and fit for a linear\ncombination of those bases that best match the WISE image.  The\nbest-fit linear weights are the measured fluxes.  The unWISE coadds\nalready have a scalar sky background level subtracted, so I do not\nallow the sky level to vary during fitting.\n\nAfter fitting each tile, I need to split the sources back into files\nthat match the SDSS field-by-field file layout.  SDSS fields that are\nentirely contained within one WISE tile are written in one phase, and\nthen the remaining ones that span multiple tiles are resolved (only\nthe measurement with the closest tile center is kept) and written out\nin a second phase.  SDSS fields that contain no primary objects will\nnot have a corresponding photoWiseForced file.\n\n\nResult files:\n-------------\n\nThe results are row-by-row parallel to the SDSS \"v5b\" \"photoObj\"\nfiles; the files\n\n/clusterfs/riemann/raid000/dstn/wise-sdss-forced-phot/1000/1/photoWiseForced-001000-1-0100.fits\n\nand\n \n/clusterfs/riemann/raid007/ebosswork/eboss/photoObj.v5b/301/1000/1/photoObj-001000-1-0100.fits\n\neach have 368 rows, and describe row-by-row the same objects.\n\nThe \"photoWiseForced\" files have the following columns:\n\n* has_wise_phot\n\nTrue for SDSS sources that were photometered in WISE.  The object must\nbe PRIMARY in SDSS for this to be set.  When this column is False, all\nother columns have value zero.\n\n* ra, dec\n* objid\n\nCopied straight from the SDSS photoObj file.\n\n* x,y\n\nZero-indexed pixel position on the unWISE 2048x2048 image tile.\n\n* treated_as_pointsource\n\nThe SDSS source is a galaxy (objc_type == 3) but was treated as a\npoint source for the purposes of forced photometry.  If you want an\noptical/WISE color, it would be best to use the SDSS PSF mags, not the\nmodel mags, for these objects.\n\n* pointsource\n\nThe SDSS source is a point source (objc_type == 6).\n\n* coadd_id\n\nThe unWISE coadd tile name.\n\nAnd then for each WISE band:\n\n* w1_nanomaggies\n* w1_nanomaggies_ivar\n\nThe WISE flux and formal error as an inverse-variance.  Take the\nformal errors with a grain of salt, of course.  NOTE that these are in\nthe native WISE photometric system: Vega, NOT AB, so some would say\nthese should not be called \"nanomaggies\".  A source with magnitude\n22.5 in the VEGA system would have a w1_nanomaggies flux of 1.\n\nThe WISE team's suggested conversions to AB are available here:\nhttp://wise2.ipac.caltech.edu/docs/release/allsky/expsup/sec4_4h.html#conv2ab\n\nAnd are (or were, when this was written),\n\nmag_AB = mag_Vega + dm,\n\nBand  dm\nW1    2.699\nW2    3.339\nW3    5.174\nW4    6.620\n\n* w1_mag\n* w1_mag_err\n\nVega magnitude and formal error in the forced photometry.  These are\nsimple conversions from the \"nanomaggies\" columns.\n\n*  w1_prochi2\n*  w1_pronpix\n\nProfile-weighted chi-squared and number-of-pixels values.\n\"Profile-weighted\" means that these are weighted according to the\nbrightness of the source in the WISE images; they are supposed to mean\n\"how bad is the fit, where I am?\"  The \"pronpix\" is probably not\nuseful in this dataset -- it effectively counts what fraction of the\nsource was inside the image, and should be nearly 1. everywhere.\n\n* w1_proflux\n* w1_profracflux\n\n\"proflux\": profile-weighted, how much flux comes from other sources in\nthe model?  \"profracflux\" = proflux divided by the flux of this\nsource.  This is an indication of blending or confusion; a source with\na large profracflux has a significant contribution from a nearby\nsource.\n\n* w1_npix\n\nHow many pixels were included in the fit.\n\n\n", 
  "id": 38506490
}