{
  "README": "Dataset:\n   A network derived from a survey taken at a doctoral summer school.\n   The data was gathered and prepared by AaronMcDaid, Samantha Lam,\n   Ursula Redmond and Arthur White[1].\n\nCurrent Version:\n   2012-03-28 First public release\n\nWebpage:\n   http://sites.google.com/site/aaronmcdaid/sbm\n   http://clique.ucd.ie/data (along with other datasets from our research group)\n\nCreated by:\n   Aaron McDaid, Samantha Lam, Ursula Redmond, Arthur White.\n   Clique Research Cluster, UCD Dublin and DERI Galway, Ireland\n   This research was supported by Science Foundation Ireland (SFI) Grant No. 08/SRC/I1407 - Clique Research Cluster\n\n\n== Description ==\n\nThe 74 attendees were asked who they knew before the summer school and were\nalso asked who they met during the summer school. 40 responded and gave us\npermission to make their data available in this anonymized dataset.\nWe have completely removed one person who responded but did not give such\npermission.  This gives us a network of 73 nodes, where node A has a link\nto node B if person A reported that they knew (or met) person B.\n\nThere are three directed, unweighted, networks in this first release:\n\nsurvey_numeric_before_edge_list.txt:\n   source node knew target node before the summer school.\n    583 edges between 67 nodes\nsurvey_numeric_during_edge_list.txt:\n   source node met target node at the summer school.\n    912 edges between 71 nodes\nsurvey_numeric_combined_edge_list.txt:\n   the union of the two networks above\n   1138 edges between 73 nodes\n\nThere are 40 nodes with a non-zero out-degree in the combined network, these\nare the 40 that responded and gave us permission.\n\nEach of the 73 nodes has non-zero degree in the combined network,\nbut some nodes are effetively missing from the other networks as they\nhad zero degree in those networks.\n\nThe files are a simple edge list, where each node has been assigned\na number between 0 and 72 inclusive. We also did some annotation\nof the formal role of the person at the summer school.\n\nsurvey_numeric_status_map.csv:\n   This records, for each of the 73 people ordered from 0 to 72, what\n   their primary role was:\n      Speaker: Presented at the summer school\n      PC: Programme Committee\n      LO: Local organizing commitee\n      Attendee: Didn't fit into the above three roles.\n   There is also a field recording secondary_roles for those people who\n   fitted into multiple roles.\n\n== Analysis ==\n\nThis dataset is analyzed and presented in two papers, which are under\nreview as of 2012-04-02:\n\n -  \"Clustering in networks with the collapsed Stochastic Block Model\"\nThis describes a clustering algorithm which clustered the nodes based\non the network. The clusters found were found to approximately match\nthe roles described in survey_numeric_status_map.csv.\n -  \"Increasing the Scalability of the Fitting of Generalised Block Models for Social Networks\"\n\nBibtex:\n@article{CollapsedSBM,\n    archivePrefix = {arXiv},\n    author = {McDaid, Aaron F. and Murphy, Brendan and Friel, Nial and Hurley, Neil},\n    title = {Clustering in networks with the collapsed Stochastic Block Model},\n    url = {http://arxiv.org/abs/1203.3083},\n    day = {14}, eprint = {1203.3083}, month = mar, posted-at = {2012-03-15 10:10:36}, priority = {2},\n    year = {2012}\n}\n(This paper is under review as of 2012-04-02.)\n@inproceedings{ChanGBM,\n    author = {Chan, Jeffrey and Lam, Samantha and Hayes, Conor},\n    booktitle = {International Joint Conference on Artificial Intelligence 2011 (IJCAI)},\n    priority = {2},\n    title = {Increasing the Scalability of the Fitting of Generalised Block Models for Social Networks},\n    url = {http://www.deri.ie/fileadmin/documents/uimr/jkcchan\\_icjai11.pdf},\n    year = {2011}\n}\n(A later version of this paper is under review as of 2012-04-02.)\n\n\n\n\nReferences:\n\n[1] AaronMcDaid <aaronmcdaid@gmail.com>, Arthur White <arthurwhite87@hotmail.co.uk>,\n        Ursula Redmond <u.redmond@gmail.com>, Samantha Lam <contradirony@gmail.com>\n[2] http://arxiv.org/abs/1203.3083\n[3] https://sites.google.com/site/aaronmcdaid/sbm\n[4] http://clique.ucd.ie/data    Includes other datasets from our research group.\n", 
  "read_at": 1462547170, 
  "description": "", 
  "id": 3854914
}