{
  "read_at": 1462546468, 
  "description": "Tracking the spread of Foot-and-Mouth Disease virus in South America", 
  "README.md": "Spatio-temporal Dynamics of Foot-and-Mouth Disease Virus in South America\n============\n\n[Luiz Max Carvalho](http://lmfcarvalho.org/about/)<sup>1,2</sup>,\n[Nuno Rodrigues Faria](http://evolve.zoo.ox.ac.uk/Evolve/Nuno_Faria.html)<sup>3,4</sup>,\n[Andres M. Perez](http://www.cvm.umn.edu/vpm/faculty/andresperez/home.html)<sup>5</sup>,\n[Marc A. Suchard](http://faculty.biomath.ucla.edu/msuchard/)<sup>6,7</sup>\n[Philippe Lemey](https://rega.kuleuven.be/cev/ecv/lab-members/PhilippeLemey.html)<sup>3</sup>,\n[Waldemir de Castro Silveira](https://www.researchgate.net/profile/Waldemir_Silveira2)<sup>8</sup>,\n[Andrew Rambaut](http://tree.bio.ed.ac.uk/people/arambaut/)<sup>1,9,10</sup>,\n[Guy Baele](https://rega.kuleuven.be/cev/ecv/lab-members/GuyBaele.html)<sup>3</sup>\n\n1 - Institute of Evolutionary Biology, University of Edinburgh, Edinburgh, United Kingdom.\n\n2 - Scientific Computing Program, Oswaldo Cruz Foundation, Rio de Janeiro, Brazil.\n\n3 - Department of Microbiology and Immunology, Rega Institute -- KU Leuven, Leuven, Belgium.\n\n4 - Department of Zoology, University of Oxford, Oxford, United Kingdom.\n\n5 - Department of Veterinary Population Medicine, University of Minnesota, St. Paul, United States of America.\n\n6 - Departments of Biomathematics and Human Genetics, David Geffen School of Medicine at UCLA, University of California, Los Angeles,  United States of America.\n\n7 - Department of Biostatistics, UCLA Fielding School of Public Health, University of California, Los Angeles,  United States of America.\n\n8 - Research and Development Division, Trimatrix Applied Biotechnology Ltd, Rio de Janerio, Brazil.\n\n9 - Fogarty International Center, National Institutes of Health, Bethesda, MD, United States of America.\n\n10 - Centre for Immunology, Infection and Evolution at the University of Edinburgh, Edinburgh, United Kingdom.\n\n## Abstract ([arXiv](http://arxiv.org/abs/1505.01105))\n\nAlthough foot-and-mouth disease virus (FMDV) incidence has decreased in South America over the last years, the pathogen still circulates in the region and the risk of re-emergence in previously FMDV free areas is a public health concern. Here we merge environmental, epidemiological and genetic data to reconstruct spatiotemporal patterns and determinants of FMDV serotypes A and O dispersal in South America.\nOur dating analysis suggests that serotype A emerged in South America by [?] 1930, while serotype O [?] 1990.\nThe rate of evolution was significantly higher for serotype O compared to serotype A.\nPhylogeographic inference identified two well-connected sub networks of viral flow, one including Venezuela, Colombia and Ecuador; another including Brazil, Uruguay and Argentina.\nThe spread of serotype A was best described by geographic distances, while trade of live cattle was the strongest predictor of serotype O spread. Our findings show that the two serotypes have different underlying evolutionary and spatial dynamics and may pose different threats to control programmes.\n\nKey-words: Phylogeography, foot-and-mouth disease virus, South America, animal trade.\n\n![](/FIGURES/PLOTS/MJandBFs.jpg)\n**Migration networks for FMDV serotypes A and O in South America.**\nWe estimated the number of migration events between countries using the robust counting (Markov jumps) method.\nAdditionally, a separate analysis employing Bayesian Stochastic Search Variable Selection (BSSVS) was performed to determine most significant migration routes and Bayes factors are depicted by arrows, with line thickness proportional to BF magnitude.\nWe only plot BFs bigger than 3.\nCoroplethic maps show the net migration rates for each country, for both serotypes.\nFrom this it is clear that the pattern of spatial spread is different for both serotypes, although there is agreement on the likage between Venezuela and Colombia and Ecuador and Peru.\nFor serotype O, Bolivia stands out as a hub, while for serotype A Brazil is highly connected. Also notice that exchange rates (depicted by the colors) are considerably higher for serotype A.\n", 
  "id": 38679464
}