{
  "read_at": 1462546161, 
  "description": "Pareto smoothed importance sampling (PSIS) and PSIS leave-one-out cross-validation for Matlab/Octave", 
  "README.md": "## Pareto smoothed importance sampling (PSIS) and PSIS leave-one-out cross-validation reference code\n\n### Introduction\nThese files implement Pareto smoothed importance sampling (PSIS) and\nPSIS leave-one-out cross-validation for Matlab/Octave and Python\n(Python port made by [Tuomas Sivula](https://github.com/tsivula)).\n\n### Corresponding R code\n\nThe corresponding R code can be found in [R package called\n`loo'](https://github.com/stan-dev/loo) which is also available in CRAN.\n\n### Contents\n\n#### Matlab/Octave code in 'm' folder\n- 'psislw.m'  - Pareto smoothed importance sampling smoothing of the log importance weights\n- 'psisloo.m' - Pareto smoothed importance sampling leave-one-out log predictive densities\n- 'gpdfitnew.m' - Estimate the paramaters for the Generalized Pareto Distribution\n- 'sumlogs.m' - Sum of vector where numbers are represented by their logarithms\n\n#### Python module in 'py' folder\n- 'psis.py'  - Includes the following functions in a Python (Numpy) module\n   - psislw  - Pareto smoothed importance sampling smoothing of the log importance weights\n   - psisloo - Pareto smoothed importance sampling leave-one-out log predictive densities\n   - gpdfitnew - Estimate the paramaters for the Generalized Pareto Distribution\n   - gpinv - Inverse Generalised Pareto distribution function.\n   - sumlogs - Sum of vector where numbers are represented by their logarithms\n                 \n### References\n- Aki Vehtari and Andrew Gelman (2015). Pareto smoothed importance\n  sampling. [arXiv preprint arXiv:1507.02646](http://arxiv.org/abs/1507.02646)\n- Aki Vehtari, Andrew Gelman and Jonah Gabry (2015). Efficient\n  implementation of leave-one-out cross-validation and WAIC for\n  evaluating fitted Bayesian models. [arXiv preprint arXiv:1507.04544](http://arxiv.org/abs/1507.04544)\n- Jin Zhang & Michael A. Stephens (2009) A New and Efficient\n  Estimation Method for the Generalized Pareto Distribution,\n  Technometrics, 51:3, 316-325, DOI: 10.1198/tech.2009.08017\n", 
  "id": 38877318
}