{
  "read_at": 1462546399, 
  "description": "A free frontend for the conformal bootstrap", 
  "README.md": "# PyCFTBoot\n\nPyCFTBoot is an interface for the conformal bootstrap as discussed in [its 2008 revival](http://arxiv.org/abs/0807.0004). Starting from the analytic structure of conformal blocks, the code formulates semidefinite programs without any proprietary software. The code does NOT perform the actual optimization. It assumes you already have a program for that, namely [SDPB](https://github.com/davidsd/sdpb) by David Simmons-Duffin.\n\nPyCFTBoot supports bounds on scaling dimensions and OPE coefficients in an arbitrary number of spacetime dimensions. The four-point functions used for the bounds must contain only scalars but they may have any combination of scaling dimensions and transform in arbitrary representations of a global symmetry.\n\n## Installation on Linux\nIf you use one of the mainstream Linux distributions, the following instructions should help you install PyCFTBoot and everything it depends on.\n\n1. Follow [the instructions](https://github.com/davidsd/sdpb/blob/master/Install.md#linux) for installing SDPB. When this is done, you will have [Boost](http://www.boost.org) and [GMP](https://gmplib.org) as well, so we will not need to discuss those further.\n\n2. Additional run-time dependencies are: [Sympy](http://www.sympy.org), [Numpy](http://www.numpy.org/) and [MPFR >= 3.1](http://www.mpfr.org/). The build-time dependencies are: [Cython](http://cython.org/) and [CMake >= 2.8](https://cmake.org/). You should install all of these. You will probably not need to compile them because most distros have these packages in their repositories.\n\n3. There are two dependencies left. One is [Symengine](https://github.com/symengine/symengine) which probably needs to be compiled. One commit that has been tested is 5427bbe. An even better idea is to use the latest commit that has been [marked stable](https://github.com/symengine/symengine.py/blob/master/symengine_version.txt) for language bindings. To compile it with the recommended settings, run:\n\n        mkdir build && cd build\n        # WITH_PTHREAD and WITH_SYMENGINE_THREAD_SAFE might be helpful as well\n        cmake .. -DWITH_MPFR:BOOL=ON\n        make\n        \n4. Lastly, compile and install [Symengine.py](https://github.com/symengine/symengine.py).\n\n## Installation on Mac\nThanks to Jaehoon Lee for writing these instructions and testing them on OS X 10.11 (El Capitan).\n\n1. Follow the instructions for [installing SDPB](https://github.com/davidsd/sdpb/blob/master/Install.md#mac-os-x) on Mac OS X. Installing gcc takes a long time, so be patient. Also, you don't need `sudo` for installing boost due to recent changes. After that, you will have homebrew, gcc, gmp, mpfr and boost installed. The default compilers should be renamed as `gcc` and `g++` following the instructions.\n\n2. Build all the required packages (Cython, Numpy, Sympy and Mpmath). One might alreday have these packages installed. The following assumes that no package other than the system's Python is installed.\n\n        # Install homebrew's python which comes with pip\n        brew install python\n        brew linkapps python\n        pip install --upgrade pip setuptools\n\n        # Numpy\n        brew install homebrew/python/numpy\n\n        # Cython\n        pip install cython\n\n        # Sympy \n        pip install sympy\n\n        # Mpmath - technically not required as it is included in sympy\n        pip install mpmath\n\n3. Install `cmake` using homebrew:\n\n        brew install cmake\n\n4. Download [Symengine](https://github.com/symengine/symengine) and compile it. If you fail to install and need to rebuild, remove the build folder and start remaking it. Unpack the source file within the directory and run:\n\n        mkdir build && cd build\n        # Turning on the MPFR option is critical for using PyCFTBoot \n        CC=gcc CXX=g++ cmake .. -DWITH_MPFR:BOOL=ON\n        make\n        # Test everything is built correctly\n        ctest\n        # Install files to default directories\n        make install\n\n5. Install the Python bindings [Symengine.py](https://github.com/symengine/symengine.py). Download the source and within the directory run:\n\n        CC=gcc CXX=g++ python setup.py install\n\n## Usage\nTo test that PyCFTBoot is working, try to run:\n\n        python\n        import bootstrap\n\nIf that doesn't work, you should check if the dependencies import correctly.\n\n        python\n        import symengine\n\nAssuming that all of this works, `python tutorial.py` will enter a tutorial with four examples. There are three changes that you might want to make to `bootstrap.py`. One is changing `python2` to `python` in the first line, for systems that don't append a specific number. Another is setting the path of SDPB by searching for `/usr/bin/sdpb` and updating this. Finally, if the sympy package you installed does not have mpmath as a separate module, change `import mpmath` to `import sympy.mpmath as mpmath`. Have fun constraining CFTs and convincing cluster maintainers to install fairly new software!\n\n## Attribution\nIf PyCFTBoot is helpful in one of your publications, please cite:\n\n- C. Behan, \"PyCFTBoot: A flexible interface for the conformal bootstrap\", [arXiv:1602.02810 \\[hep-th\\]](http://arxiv.org/abs/1602.02810).\n", 
  "id": 38971602
}