{
  "read_at": 1462546124, 
  "description": "Repository for the paper \"Ethnicity sensitive author disambiguation using semi-supervised learning\"", 
  "README.md": "# Ethnicity sensitive author disambiguation using semi-supervised learning\n\n* Gilles Louppe\n* Hussein Al-Natsheh\n* Mateusz Susik\n* Eamonn Maguire\n\nAuthor name disambiguation in bibliographic databases is the problem of\ngrouping together scientific publications written by a same person, accounting\nfor potential homonyms and/or synonyms. Among solutions to this problem,\ndigital libraries are increasingly offering tools for authors to manually\ncurate their publications and claim which ones are theirs. Indirectly, these\ntools allow for the inexpensive collection of large annotated training data,\nwhich can be further leveraged to build a complementary automated\ndisambiguation system capable of inferring patterns for identifying\npublications written by a same person.  Building upon more than 1 million of\npublicly released crowdsourced annotations, we propose an automated author\ndisambiguation solution exploiting this data (i) to learn an accurate\nclassifier for identifying corefering authors and (ii) to guide the clustering\nof scientific publications by distinct authors in a semi-supervised way. To the\nbest of our knowledge, our analysis is the first to be carried out on data of\nthis size and coverage. With respect to the state of the art, we validate the\ngeneral pipeline used in most existing solutions, and improve by proposing\nphonetic-based blocking strategies, thereby increasing recall, and strong\nethnicity-sensitive features for learning a linkage function, thereby tailoring\ndisambiguation to non-Western author names whenever necessary.\n\n---\n\nPlease cite using the following BibTex entry:\n\n```\n@article{louppe2015disambiguation,\n   author = {{Louppe}, G. and {Al-Natsheh}, H. and {Susik}, M. and {Maguire}, E.},\n    title = \"{Ethnicity sensitive author disambiguation using semi-supervised learning}\",\n  journal = {ArXiv e-prints},\narchivePrefix = \"arXiv\",\n   eprint = {1508.07744},\n primaryClass = \"cs.DL\",\n keywords = {Computer Science - Digital Libraries, Computer Science - Information Retrieval},\n     year = 2015,\n    month = aug\n}\n```\n\n---\n\n_Structure of the repository:_\n- `beard/`: Source code.\n- `data/`: Author disambiguation data extracted from INSPIRE.\n- `paper/`: Latex files of the paper.\n\n_License:_ BSD 3 clause\n\n_Contact:_ Gilles Louppe (@glouppe, <g.louppe@gmail.com>)\n", 
  "id": 38994931
}