{
  "read_at": 1462546444, 
  "description": "This is repo in which I want contributors to help me create a certain plot in R. It is motivated by the Exploratory Data Analysis course on Coursera. ", 
  "README.md": "# Plot Chellenge\nThis is repo in which I want contributors to help me create a certain plot in R. It is motivated by the Exploratory Data Analysis course on Coursera. \n\n##Source of the plot\nThe plot plot.png is taken from the paper \"Compensating asynchrony effects in the calculation of financial correlations\" by Michael C. Munnix, Rudi Schafer, Thomas Guhr. \nThe article is available on the site: http://arxiv.org/abs/0910.2909\n\n##Source of the data\nThe data_chellenge.csv is not the original data used in the article. It is created by me, in my opinions it is similar to the data used in the article (also generated).\n\n##Goals  \nI want you to help me create the plot as much similar to the plot in plot_chellenge.png as possible.  \nFirtsly, I simply plot the data as follows in R:  \n<code>#read the data into R</code>    \n<code>data<-read.csv('data_chellenge.csv')</code>   \n<code>#plot the S.1 variable putting correct y axis lim </code>  \n<code>plot(x, t='l', lty=1, ylim=c(min(data), max(data)), ylab='S~', xlab='t')</code>  \n<code>#add the S.2 variable into the plot</code>  \n<code>lines(y, t='l', lty=2)   </code>  \n<code>#add the legen into the plot, the position is different from the original plot</code>  \n<code>legend('bottomleft', lty=c(1,2), legend=(c('Stock 1', 'Stock 2')))   </code>  \n\n###What is to change in this plot:\n* Plot the lines as a step functions\n* Convert the x and the y axis into arrows and make it thicker.\n* Move the axises label to ends of the arrows\n* Make '~' move above S in the y axis label\n* Make dots below the plot in the certain places, on different heights and lengths\n* Draw vertical lines from the ponts to the lines\n* Draw thicker lines somplace else\n* Label the points with mathematical symbols and greek letters\n* Draw horizontal lines from the ponts to vertical lines\n* Put the braces of connecting the vertical lines and label them\n* Something I haven't noticed?\n\n##Code\nIn the plot_code.R file, I typed the initial code which produces the plot which is to be changed. I hope you will contribute to this code.\n", 
  "id": 39005646
}