{
  "read_at": 1462546451, 
  "description": "A hacked, hardwired GROMACS-4.5.5 that runs a few types of adaptively biased molecular dynamics", 
  "README.md": "# ABPenabledGROMACS\nA hacked, hardwired GROMACS-4.5.5 that runs mABP, well-tempered metadynamics, m-tempered metadynamics, or a SHUS-based tempered metadynamics for alanine dipeptide. While the name might not stick, you can find out about m-tempering on the [arxiv].\n\nThis code is modified for the following functions:\n\n- Compute Phi-Psi free energy via mABP\n\n- Compute Phi-Psi free energy via well-tempered or m-tempered metadynamics\n\n- Compute Phi-Psi free energy via an alternate tempered metadynamics\n\n**This is not standard gromacs, don't use it for anything outside of alanine dipeptide unless you modify md.c and hellof.f to match your application!**\n\nThe biasing code can be found [here]. There are comments and the code is easy to read if you can stomach going back to 1985. You wont need a DeLorean.\n\nAll the things required for building simulation inputs are also included in the [ALANINEsystem] subdirectory.\n\n# To Build:\n1. Go to the ABPenabledGROMACS directory.\n\n2. Run the ./configure command with whatever options you need to use. Use --prefix=PATH-TO-YOUR-ABPenabledGROMACS to install the executable to the location expected by the Run-mABP/ Run-WTmetaD/ Run-Mu/ and Run-SHUSish directories.\n\n3. Run make clean\n\n4. cd to src/kernel and compile hello.f with gfortran -O3 -fbounds-check -c hello.f The file hello.f is a fortran routine written very transparently so that each method can be cleanly compared to the other.\n\n5. Edit src/kernel/Makefile as follows:\n - Line 144 should read: md_openmm.$(OBJEXT) hello.o\n - Line 232 should read: LIBS = -lnsl -lm -lgfortran\n\n6. Run make install from the ABPenabledGROMACS directory\n\n# To run simulations of alanine dipeptide\n1. Go to ABPenabledGROMACS/ALANINEsystem and build a new tpr file:\n - ../bin/grompp -f md.mdp -c isob.gro -t isob.cpt -o ala.tpr\n\n2. Copy this ala.tpr file into the run directories: Run-mABP Run-WTmetaD Run-Mu Run-SHUSish and edit the params.in file to your liking\n\n3. Simulations can be launched within these run directories with ./mdrun -v -deffnm ala \n\n4. You can adjust the parameters and see how things change. \n\n# Outputs\n\n1. The simulations will write a file named \"freeE\" that contains the current free energy estimate. The Phi-Psi angles are given in the first two columns, the free energy estimate is given in the third column.\n\n2. Simulations also write a file named \"fort.88\" The first column is timestep, second and third columns are collective variables (angles), the fourth column is the convergence metric (equation 28 in the paper)\n\n[here]: https://github.com/BradleyDickson/ABPenabledGROMACS/blob/master/ABPenabledGROMACS/src/kernel/hello.f\n[ALANINEsystem]: https://github.com/BradleyDickson/ABPenabledGROMACS/tree/master/ABPenabledGROMACS/ALANINEsystem\n[arxiv]: http://arxiv.org/abs/1511.00558\n", 
  "id": 39032475
}