{
  "read_at": 1462546183, 
  "description": "", 
  "README.md": "## Occlusion Coherence: Detecting and Localizing Occluded Faces\nThis is the code for the method described in:\n\n[Golnaz Ghiasi, Charless Fowlkes, \"Occlusion Coherence: Detecting and Localizing Occluded Faces\" , Technical Report, June 2015, arXiv:1506.08347](http://arxiv.org/pdf/1506.08347.pdf)\n\n[Golnaz Ghiasi, Charless Fowlkes, \"Occlusion Coherence: Localizing Occluded Faces with a Hierarchical Deformable Part Model\" , (CVPR) 2014](http://www.ics.uci.edu/~gghiasi/papers/gf-cvpr14.pdf)\n\n\nThis library is written in Matlab, and is based on the following two works:\n\n* [Face Detection, Pose Estimation and Landmark Localization in the Wild](http://www.ics.uci.edu/~xzhu/face/)\n\n\n* [Articluated Pose Estimation with Flexible Mixtures of Parts](http://www.ics.uci.edu/~yyang8/research/pose/index.html)\n\n\n---- \n\n## Quick start guide\n\nThis code is tested on Linux. Pre-compiled Mex files for linux are inlcuded.\n\n### Download and compile\n``` sh\n cd PATH\n git clone git://github.com/golnazghiasi/hpm-detection-code.git\n cd hpm-detection-code/\n matlab\n>> compile\n```\n\n\n### Runs face detection using pre-trained model on the images in the photo directory.\n``` sh\n cd PATH/hpm-detection-code/\n matlab\n>> Demo\n```\n\n### Benchmarks landmark localization on the COFW test data.\nDownload COFW data:\n``` sh\n cd PATH\n mkdir databases/\n cd databases/\n wget http://www.vision.caltech.edu/xpburgos/ICCV13/Data/COFW.zip\n unzip COFW.zip\n mv common/xpburgos/behavior/code/pose/COFW_test.mat .\n mv common/xpburgos/behavior/code/pose/COFW_train.mat .\n```\n\n``` sh\n cd PATH/hpm-detection-code/\n matlab\n>> DemoCofw\n```\nThis will load the pre-computed results. To run the detection code on the COFW test dataset,\nremove or rename the following files:\n``` sh\n PATH/hpm-detection-code/cache/HPM_cofw_*\n PATH/hpm-detection-code/cache/changealpha/*\n```\n\n### Benchmarks face detection on the UCI-OFD test data.\n``` sh\n cd PATH/hpm-detection-code/\n matlab\n>> DemoOfd\n```\nThis will load the pre-computed results. To run the detection code on the UCI-OFD dataset,\nremove or rename the following file:\n``` sh\n PATH/hpm-detection-code/cache/HPM_OFD_*\n```\n\n### Benchmarks landmark localization on LFW test data.\nNote: our model is trained on the front view training data, while this dataset \nhas many side view faces.\n\nDownload LFW data:\n``` sh\n cd PATH/databases/\n wget http://www.vision.ee.ethz.ch/~mdantone/datasets/lfw_ffd_ann.txt\n wget http://vis-www.cs.umass.edu/lfw/lfw.tgz\n tar zxvf lfw.tgz\n```\n\n``` sh\n cd PATH/hpm-detection-code/\n matlab\n>> DemoLFW\n```\n\nThis will load the pre-computed results. To run the detection code on the LFW test dataset,\nremove or rename the following files:\n``` sh\n PATH/hpm-detection-code/cache/HPM_lfw_*\n```\n\n----\n\n### Issues, Questions, Congratulations, etc\n\nPlease contact \"gghiasi @ ics.uci.edu\"\n\n--- -\n**Copyright (C) 2015 Golnaz Ghiasi, Charless Fowlkes**\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\nLIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\nOF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\nWITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n", 
  "id": 39058925
}