{
  "read_at": 1462546148, 
  "description": "Train, evaluate and deploy Deep Learning based text classifiers. Currently supports CNN", 
  "README.md": "# Optimus\nQuickly train, evaluate and deploy an optimum classifier for your text classification task. Currently, it allows you to train a CNN (Convolutional Neural Network) based text classifier. Using this toolkit, you should be able to train a classifier for most of the text classification tasks without writing a single piece of code. \n\nThe main features of Optimus are:\n* Easily train a CNN  classifier\n* Config driven to make hyperparameter tuning and experimentation easy\n* Debug mode: which allows you to visualize what is happening in the internal layers of the model\n* Flask server for querying the trained model through an API\n\nThis project is based on: https://github.com/yoonkim/CNN_sentence (Many thanks to Yoon for open sourcing his code for the paper: http://arxiv.org/abs/1408.5882, which is arguably the best generic Deep Learning based text classifier at the time of writing.)\nThe improvements over the original code are:\n* Multi-channel mode\n* Complete refactoring to make the code modular\n* GPU/CPU unpickling of models\n* Config driven, for easy experimentation\n* Model serialization/deserialization\n* Detailed evaluation results\n* Model deployment on a Flask server\n* Multi Class classification [In progress]\n* Debug Mode [In progress]\n![img](https://drive.google.com/uc?id=1c0oa0YzKoBTD3JXztVTHtgTR_DTMXPKOWw)\n\nThis project is also inspired by https://github.com/japerk/nltk-trainer, which allows users to easily train NLTK based statistical classifiers. \n\n## Why deep learning?\nDeep learning has dominated pattern recognition in the last few years, especially in image and speech. Recently deep learning models have outperformed statistical classifiers in a variety of NLP tasks as well. Also, one of the biggest advantage of using deep learning models is that task specific feature engineering is not required. The wiki contains a summary of exciting results we obtained using optimus, on a variety of different text classification tasks. Those interested in understanding how this model works can also check out my [talk](https://fifthelephant.talkfunnel.com/2015/64-deep-learning-for-natural-language-processing) at Fifth elephant, in which I give an introduction to NLP using deep learning. Other good recommended resources can also be found [here](http://deeplearning.net/) and [here](http://devashishshankar.com/).\n\n\n## Requirements\nCode requires Python 2.7 and Theano 0.7. You can go to the [Setting Up page](https://github.com/flipkart-incubator/optimus/wiki/Setting-Up), for instructions on how to quickly set up the python environment required for Optimus. Requirements are also listed in the requirements.txt file.\n\n## Start Using it\nVisit the [Quick Start](https://github.com/flipkart-incubator/optimus/wiki/Quick-Start) guide to get started on using Optimus! I have also written a small [tutorial on Optimus](http://devashishshankar.com/2015/07/21/train-an-optimum-text-classifier-using-optimus/) on my blog.\n\nYou can compare models trained using optimus to statistical models by using https://github.com/japerk/nltk-trainer, an awesome tool for easily training statistical classifiers. If you get some good results on a dataset, I would love to know about them! \n\nIn case you face any issue, you can create an issue on github or send me a mail at devashish.shankar@flipkart.com. Suggestions and improvements are most welcome. Open github issues are a good place to start. A contributor's guide is under works.\n\n## Core contributors\n* Devashish Shankar ([@devashishshankar](https://github.com/devashishshankar))\n* Prerana Singhal ([@singhalprerana](https://www.linkedin.com/in/singhalprerana))\n", 
  "id": 39064726
}