{
  "read_at": 1462546224, 
  "description": "", 
  "README.md": "# Astoria\n\nAstoria is a **research prototype** AS-aware Tor client. It is constantly\nchanging and should not be considered secure enough for browsing sensitive\ncontent.\n\nFind the paper that describes the internals of Astoria here: [Arxiv](http://arxiv.org/abs/1505.05173). \n\nIt may happen from time-to-time, that\nthe details described in the paper will be out-of-date with the current \nclient. We will make the effort to prevent this from happening too often.\n\n## Disclaimer \n\nWe follow the principles of the [CRAPL\nlicence](http://matt.might.net/articles/crapl/) and take no responsibility for\nany thing that might happen to you, your system, or your network when you use\nAstoria.\n\n## Astoria Installation\n\nAstoria consists of two parts -- a client (a modified version of the original \nTor client) and a path prediction tool. \n\n###Building the Astoria Tor client\n\nSince Astoria is a fork of the original Tor client (and has large similarities \nto it), the installation process is identical.\n\nIn ./astoria-tor-client:\n> sh autogen.sh && ./configure && make && make install\n\n\n###Path Prediction Toolkit\n\nThe toolkit is ready to go. You just need to have \"mono\" installed. \n\n## Running Astoria\n\nFirst, you need to get the path prediction toolkit running. \nIn ./bgp_sim: \n\n> mono TestingApplication/bin/Release/TestingApplication.exe -server11000 TestingApplication/bin/Release/Cyclops_caida_cons.txt precomp/US-precomp367.txt cache/exit_asns.txt\n\nCyclops_caida_cons.txt is the Caida AS topology to be used while performing \nprediction. US-precomp367.txt is some precomputed data you can use to make\ninitialization faster. You can find more precomputed cache files for 10\ncountries in the precomp folder.\n\nInitialization takes about 15 minutes.\n\nOnce the path prediction toolkit is up and running, you can start the Tor\nclient.\n\nIn ./astoria-tor-client/src/or: \n\n> ./tor\n\nRemember, the longer you use Astoria, the faster it gets. Expect the first few\npages you load to take a couple of minutes.\n\n## Support\n\nFor support, please send an email to Rishab (rnithyanand AT cs DOT stonybrook DOT edu) or Oleksii (ostarov AT cs DOT stonybrook DOT edu).\nWe will follow the principle of best-effort support, without providing any\nguarantees.\n", 
  "id": 39392115
}