{
  "read_at": 1462546439, 
  "description": "Knowledge acquisition with forgetting: an incremental and developmental rule-based setting [THESIS]", 
  "README.md": "# Coverage-Graphs \n## Knowledge acquisition with forgetting: an incremental and developmental rule-based setting [THESIS]\n\n###APPROACH\n\nIn this work we take a most general approach by considering that we start with an off-the-shelf inductive engine (e.g., a rule learning algorithm, an inductive logic programming (ILP) system or an inductive programming (IP) system) and an off-the-shelf deductive engine (e.g., a coverage checker, an automated deduction system or a declarative programming language) and, over them, we construct a long-life knowledge discovery system. For this purpose, several issues have to be addressed:\n\n1. The inductive engine can generate many possible hypotheses and patterns. Once brought to working memory we require metrics to evaluate how these hypotheses behave and how they are related in the context of previous knowledge.\n2. As working memory and computational time are limited, we need an forgetting criterion to discard some rules.\n3. The deductive engine checks the coverage of each hypothesis independently, using the background or consolidated knowledge as auxiliary rules, but not other working rules.\n4. The promotion of rules into consolidated knowledge must avoid unnecessarily large knowledge bases and the consolidation of rules that are useless, too preliminary or inconsistent.\n\nThe idea of coverage graph is used as the basis for structuring knowlege and is delegated to the deductive engine. The generation of new rules is delegated to the inductive engine. The crucial part is the definition of appropriate metrics to guide the way knowledge develops. For this purpose, the MML principle is used as a sound theoretical ground for the metrics.\n\n###NOTES\n\nCode, libraries and examples related to the articles: \n\n- **Forgetting and consolidation for incremental and cumulative knowledge acquisition systems**\n  Fernando Martinez-Plumed, Cesar Ferri, Jose Hernandez-Orallo, M. Jose Ramirez-Quintana \n  arXiv:1502.05615 (2015)\n  \n- **A knowledge growth and consolidation framework for lifelong machine learning systems**\n  Fernando Martinez-Plumed, Cesar Ferri, Jose Hernandez-Orallo, M. Jose Ramirez-Quintana\n  Proceedings of 13rd International Conference on Machine Learning and Applications, ICMLA 2014 ,\n  Detroit, USA on December 3-6, 2014 IEEE \n\n###FILES INCLUDED\n\n- JGraphXAdapterDemo.java \n- JGraphXAdapterDemo2.java\n- MyGraphUtil.java\n\n###HOW TO\n\nTechnology:\n\n    Java\n    jgrapht libraries\n\nCompile and Run JGraphXAdapterDemo.java \n\n\n", 
  "id": 39557864
}