{
  "read_at": 1462546430, 
  "description": ":exclamation: This is a read-only mirror of the CRAN R package repository.  pweight — P-Value Weighting. Homepage: https://github.com/dobriban/pweight  Report bugs for this package: https://github.com/dobriban/pweight/issues", 
  "README.md": "#P-value Weighting R Package\r\n\r\n##Introduction\r\nThis R package contains p-value weighting methods for multiple hypothesis testing. These statistical methods are used for improving power in multiple testing via the use of prior information. The iGWAS method is provided for applications of p-value weighting in Genome-Wide Association Studies.\r\n\r\nSome of these methods were were developed by the authors in the following paper:\r\n*Optimal Multiple Testing Under a Gaussian Prior on the Effect Sizes* by Dobriban, Fortney, Kim, Owen:  http://arxiv.org/abs/1504.02935\r\n\r\n## An Example\r\nSuppose we want to find the significant effects in a large pool of candidates, by performing  multiple testing with the p-values `P_current`. We have some prior information about the size of each effect size in the form of prior test statistics `t1` with estimated variances `sigma`. The prior effects `t1` with standard errors `sigma` are our prior guesses for the current effects.\r\n\r\nTo use this information for improving power in multiple hypothesis testing, we can give each hypothesis a different weight. For instance, we can compute the Bayes p-value weights `w`, and use them to weight the current p-values `P_weighted` as follows: \r\n\r\n```{r}\r\nw <- bayes_weights(t1,sigma,q)$w\r\nP_weighted <- P_current/w\r\n```\r\n\r\nFinally, we perform weighted Bonferroni multiple testing, controlling the Family-Wise Error Rate, in the usual way: \r\n```{r}\r\nP_w_adjusted <- p.adjust(P_weighted,\"bonferroni\")\r\n```\r\n\r\nPlease see the vignette or the help files for examples and a description of the methods.\r\n\r\n## Installation instructions\r\n\r\nTo install from GitHub, make sure that Hadley Wickham's devtools (https://github.com/hadley/devtools) is installed, then run:\r\n\r\n```{r}\r\ndevtools::install_github(\"dobriban/pweight\")\r\n```\r\n\r\nIt is also possible to install from CRAN.\r\n\r\n## Main components\r\n\r\nThe core of the package consists of the following p-value weighting methods, whose details are described in the documentation:\r\n\r\n* Spjotvoll weights: `spjotvoll_weights()` \r\n* Exponential weights: `exponential_weights()` \r\n* Bayes weights: `bayes_weights()`\r\n\r\nThe iGWAS method, `iGWAS()`, is provided for applications of p-value weighting in Genome-Wide Association Studies.\r\n\r\nPlease contact the authors if you have any questions. \r\n", 
  "id": 39888325
}