{
  "README": "\n                             FLAG CODE \n                http://astro-informatics.github.io/flag\n              Fast Fourier-Laguerre transform on the ball\n\t   Exact spherical Bessel and Fourier-Bessel transforms\n  ----------------------------------------------------------------\n\nDESCRIPTION\n     The FLAG code provides functionality to perform fast and exact\n     Fourier-Laguerre and Fourier-Bessel transforms on the ball.\n\nVERSION\n     Release 1.0b1, November 2012\n\nAUTHORS\n     B. Leistedt (www.ixkael.com/blog)\n     J. D. McEwen (www.jasonmcewen.org)\n\nREFERENCES\n     B. Leistedt and J. D. McEwen, Exact Wavelets on the Ball, \n     IEEE Trans. Sig. Proc., 60, 2012 (arXiv:1205.0792)\n     \n     J. D. McEwen and Y. Wiaux, A novel sampling theorem on the\n     sphere, IEEE Trans. Sig. Proc., 59, 2011 (arXiv:1110.6298).\n\nDOCUMENTATION\n     See doc/index.html\n\nINSTALLATION\n     See documentation\n\nREQUIREMENTS\n     SSHT (http://www.spinsht.org)\n     FFTW (http://www.fftw.org)\n\nDOWNLOAD\n     http://www.jasonmcewen.org/codes.html\n\nSUPPORT\n     Please email the authors.\n\nNOTE\n     The package is in beta and is still under development.\n     Please report problems/bugs by email to: boris.leistedt@gmail.com\n\nLICENSE\n     FLAG package to perform fast wavelet transform on the sphere<br>\n     Copyright (C) 2012 Boris Leistedt & Jason McEwen\n\n     This program is free software; you can redistribute it and/or\n     modify it under the terms of the GNU General Public License\n     as published by the Free Software Foundation; either version 2\n     of the License, or (at your option) any later version.\n\n     This program is distributed in the hope that it will be useful,\n     but WITHOUT ANY WARRANTY; without even the implied warranty of\n     MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n     GNU General Public License for more details (LICENSE.txt).\n\n     You should have received a copy of the GNU General Public License\n     along with this program; if not, write to the Free Software\n     Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, \n     MA  02110-1301, USA.\n", 
  "read_at": 1462546382, 
  "description": "Fast Fourier-Laguerre transform on the ball and exact spherical Bessel and Fourier-Bessel transforms", 
  "id": 39938603
}