{
  "read_at": 1462546447, 
  "description": "Steerable scale discretised wavelets on the sphere", 
  "README.txt": "\n                            S2DW CODE\n         Steerable scale discretised wavelets on the sphere\n  ----------------------------------------------------------------\n\nDESCRIPTION\n     The S2DW code provides functionality to perform the scale\n     discretised wavelet transform on the sphere developed in our\n     paper: Exact reconstruction with directional wavelets on the\n     sphere. Routines are provided to compute wavelet and scaling\n     coefficients from the spherical harmonic coefficients of a signal\n     on the sphere and to synthesise the spherical harmonic\n     coefficients of the original signal from its wavelet and scaling\n     coefficients. The reconstruction of the spherical harmonic\n     coefficients of the original signal is exact to numerical\n     precision. Typically, maximum reconstruction errors are of the\n     order 10^(-12) or smaller. Please see our paper for further\n     details of the wavelet transform and a discussion of typical\n     reconstruction errors and execution times of this implementation.\n\nVERSION\n     Release 1.1\n\nAUTHORS\n     J. D. McEwen (http://www.jasonmcewen.org) and Y. Wiaux\n\nREFERENCE\n     Y. Wiaux, J. D. McEwen, P. Vandergheynst, and O. Blanc\n     Exact reconstruction with directional wavelets on the\n     sphere. Mon. Not. Roy. Astron. Soc., 388(2):770-788, 2008\n     (arXiv:0712.3519)\n\nDOCUMENTATION\n     See doc/index.html\n\nREQUIREMENTS\n     Library: \n       FFTW (http://www.fftw.org/)\n       CFITSIO (http://heasarc.gsfc.nasa.gov/docs/software/fitsio/)\n     Utility programs:\n       S2 (http://www.jasonmcewen.org/codes.html)\n       HEALPix (http://healpix.jpl.nasa.gov/)\n\nINSTALLATION\n     See doc/index.html\n\nDOWNLOAD\n     http://www.jasonmcewen.org/codes.html\n\nSUPPORT\n     See http://cosmocoffee.info/ forums\n\nNOTE\n     The package is still under development\n     Please report problems/bugs by email to Jason McEwen\n\nLICENSE\n     S2DW package to compute the scale discretised wavelet transform on\n     the sphere\n     Copyright (C) 2008  Jason McEwen and Yves Wiaux\n\n     This program is free software; you can redistribute it and/or\n     modify it under the terms of the GNU General Public License\n     as published by the Free Software Foundation; either version 2\n     of the License, or (at your option) any later version.\n\n     This program is distributed in the hope that it will be useful,\n     but WITHOUT ANY WARRANTY; without even the implied warranty of\n     MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n     GNU General Public License for more details (LICENSE.txt).\n\n     You should have received a copy of the GNU General Public License\n     along with this program; if not, write to the Free Software\n     Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, \n     MA  02110-1301, USA.\n\n", 
  "id": 39943458
}