{
  "read_at": 1462545928, 
  "description": "Laguerre approximation of 3D images", 
  "README.md": "Laguerre approximation of 3D images\n===================================\n\nThis software package provides an implementation of the algorithm proposed\nin [1]. It aims to detect a Laguerre tessellation that approximates a given\ngrain structure as well as possible. An interface-based discrepancy measure\nis minimized using the cross-entropy method, a robust stochastic optimization\ntechnique.\n\n> [1] A. Spettl, T. Brereton, Q. Duan, T. Werz, C.E. Krill III, D.P. Kroese\n> and V. Schmidt, Fitting Laguerre tessellation approximations to tomographic\n> image data. Philosophical Magazine 96 (2016), 166-189.\n\nIf you use this software package in a work that leads to a scientific paper,\nwe ask you to mention it explicitly and cite reference [1]. A preprint of the\npaper is available at [arXiv:1508.01341 [cond-mat.mtrl-sci]](http://arxiv.org/abs/1508.01341).\n\n\nUsage\n-----\n\nThis project requires Java 7 or newer. To compute suitable generators of\na Laguerre tessellation for a labeled 3D image \"artificial_pcm_input.tif\"\n(located in the subfolder \"data\"), run:\n\n    java -Xmx3500m -jar LaguerreApproximation3D.jar data/artificial_pcm_input.tif data/artificial_pcm_output.txt\n\nIn this example, the detected generators will be written to the text file\n\"artificial_pcm_output.txt\". A Java heap size of 3500 MB is used, which is\nnecessary in order to process the example data set. The 3D image itself is\na labeled image, i.e., label zero stands for background, label 1 for the\nfirst grain, label 2 for the second grain, etc. The grain regions should be\nroughly convex. Furthermore, it is expected that there is at most a thin\nlayer of background voxels (1 voxel thickness) between adjacent grains. A\nmulti-page image file is required as input, i.e., a single file contains\nseveral 2D images which correspond to the slices (in z-direction) of the\n3D image. For example, [ImageJ](http://imagej.nih.gov/ij/) / [Fiji](http://fiji.sc/)\ncan generate such 3D image files. The output text file contains the detected\ngenerators. One line corresponds to one generator. The first value is the\nlabel, the remaining four values are x-, y-, z-coordinates and the radius.\n\nNote:\n\n1. The executable JAR file \"LaguerreApproximation3D.jar\" is contained\n   only in the binary release. If you want to compile the source code yourself:\n   the class \"LaguerreApproximation3D\" in the package \"laguerre_approximation_3d\"\n   contains the main method.\n2. The experimental data set requires about 4500 MB Java heap (due to the\n   cylindrical shape of the sample).\n\nThe following optional arguments may be used. Here, they are given with\ntheir default values:\n\n    --M=4000 --rho=0.05 --tauInject=10 --deltaInject=0.05 --injections=-1\n    --gamma=0.9 --kappa=0.25 --tauTerminate=10 --deltaTerminate=0.01\n\nThe parameters are explained in [1]. The only exception is the `--injections`\nparameter, which allows you to choose the number of variance injections manually.\nThe default value \"-1\" stands for the standard behavior, i.e., automatic\nselection of the number of variance injections. If a value equal to or greater\nthan zero is specified, infinity is assumed as a new default value for `--gamma`\n(in order to not abort variance injections early).\n\n\nSource and Javadoc\n------------------\n\nThe source code is supplied in the folder \"src\" and it contains Javadoc comments.\nThe main class is \"laguerre_approximation_3d.LaguerreApproximation3D\".\n\n\nCopyright and licenses\n----------------------\n\n* Copyright &copy; 2015-2016 Institute of Stochastics, Ulm University\n\nThis software is licensed under the GNU General Public License v2.0 (published\nin June 1991), or (at your option) any later version. The full text of GPL 2 is\navailable at https://www.gnu.org/licenses/gpl-2.0 and in the file \"LICENSE\".\n\n\nChangelog\n---------\n\n* 2016-02-02 - Updated preprint, added publication details, no code change.\n* 2015-08-06 - Initial release.\n\n\nMore info\n---------\n\n* http://arxiv.org/abs/1508.01341\n* https://github.com/stochastics-ulm-university/laguerre-approximation\n", 
  "id": 40167020
}