{
  "read_at": 1462545996, 
  "description": "A Matlab Package for Spherical Needlets", 
  "README.md": "## NeedMat, a Matlab Package for Spherical Needlets\n## Description\nNeedMat provides a Matlab Package that implements fast spherical needlet transforms and fast spherical needlet evaluations. For more details on the spherical needlets and the package, please refer to the technical report:\n**A Note on Spherical Needlets**\nhttp://arxiv.org/abs/1508.05406.\n## Dependencies\nNeedMat is developed on Matlab R2013a. It depends on the following three packages.\n* RBFSPHERE Matlab package (http://math.boisestate.edu/~wright/montestigliano/index.html).\n* MEALPix 3.0 (the original link is broken), which is a Matlab implementation of HEALPix based on HEALPix-F90 original source code.\n* Spherical-Harmonic-Transform (https://github.com/polarch/Spherical-Harmonic-Transform), which is a collection of MATLAB routines for the Spherical Harmonic Transform and related manipulations in the spherical harmonic spectrum. Note that NeedMat only uses this package to compute Voronoi diagrams on the sphere.\n\nTo ensure compatibility, the second package is already included in the repository.\n\n## Installation\n1. Download the codes by cloning the repository `git clone https://github.com/minjay/NeedMat`.\n2. Add the repository (including subfolders) to the search path of Matlab.\n\n## Main Functions (in the folder named core)\n1. `A = get_A(B, j_min, j_max, theta, phi, n_dist)`\nCompute the design matrix A, where A is an N-by-M matrix, N is the number of observations, and M is the number of spherical needlets. `(theta, phi)` gives the locations of these observations, and the spherical needlets are from frequency level `j_min` to `j_max` (inclusively). For fast computation, this function first evaluates the spherical needlets on a very fine grid and then interpolates the values for the query points.\n2. `Nside = get_Nside(B, j)` \nCompute `Nside`.\n3. `j_max = get_j_max(B, l_max)` \nCompute the maximal j, `j_max`.\n4. `[dist, psi] = get_psi(B, j, k, theta, phi)` \nA wrapper of the function `spneedlet_eval_fast`. It evaluates the spherical needlet with subscripts `j` and `k` at locations `(theta, phi)`.\n5. `map = inv_spharmonic_tran_naive(alm, theta, phi, l_max)`\nA *naive* implementation of the inverse spherical harmonic transform.\n6. `plot_needlets(B, j, k, res)`\nPlot the spherical needlet with subscripts `j` and `k`.\n7. `Y = spharmonic_eval(l, m, theta, phi)`\nEvaluate the spherical harmonic with subscripts `l` and `m` at locations `(theta, phi)`.\n8. `alm = spharmonic_tran_irr(theta, phi, f, l_max)`\nSpherical harmonic transform for irregularly spaced observations of function `f` at locations `(theta, phi)`. It estimates the spherical harmonic coefficients empirically using the weights determined by the Voronoi diagram of these locations on the sphere.\n9. `beta = spneedlet_tran(alm, l_max, B)`\nFast spherical needlet transform. It computes the needlet coefficients based on the spherical harmonic coefficients `alm`.\n\n##Contact\nPlease report any bugs to \nmjfan@ucdavis.edu.\n\nMy research: http://anson.ucdavis.edu/~minjay.\n", 
  "id": 40201015
}