{
  "README": "LowRAMP: Low rank Approximate Message Passing, a MATLAB software for low rank matrix factorization based on belief propagation.\nCOPYRIGHT (C) 2015 Thibault Lesieur, Florent Krzakala and Lenka Zdeborova\nContact : florent.krzakala@ens.fr\n\nThis program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\nFiles included in this package :\n    LowRAMP_UV.m : The main reconstruction code for UV' factorizarion\n    run_LowRAMP_UX.m : a Demo file\n    LowRAMP_XX.m : The main reconstruction code for XX' factorizarion\n    run_LowRAMP_XX.m : a Demo file\n    subroutines folder : all subroutines needed by the different parts of the algorithm. \n   \nUSAGE : from matlab, includes the two subfolders Functions and Subroutines (for instance using path(path,'./Functions');\npath(path,'./Subroutines'); path(path,'./Functions');). \n\nThen run \n* demo_LowRAMP_UV for a UV factorization of a clustering  problem\n* demo_PCA_and_completion for a completion problem\n* demo_LowRAMP_XX for a community detection problem\n* demo_Rank1_Submatrix for a submatrix localization problem\n\nThese equations are based on http://arxiv.org/abs/1503.00338 (ISIT 2015) and http://arxiv.org/abs/1507.03857\nThey follow from earlier works: \nhttp://arxiv.org/abs/1402.2238\nhttp://arxiv.org/pdf/1202.2759.pdf\nhttp://papers.nips.cc/paper/5074-low-rank-matrix-reconstruction-and-clustering-via-approximate-message-passing\nComments and remarks regarding bugs or functionalities are more than welcome.", 
  "read_at": 1462545707, 
  "description": "Matlab code for Low rank Matrix Factorization with AMP", 
  "id": 40363057
}