{
  "read_at": 1462545902, 
  "description": "a fast subhalo sampler", 
  "README.md": "## `SubGen`: a fast subhalo sampler \n`SubGen` generates Monte-Carlo samples of dark matter subhaloes, according to the unified subhalo distribution model in Han et. al. (2015; http://arxiv.org/abs/1509.02175).\n\nTo get started, check `example.py`. You only need to specify the host halo mass, and the number of subhaloes to sample.\n\n### Prerequisites\n\nYou need a python installation with the core scientific packages: `numpy`, `matplotlib` and `scipy`.\nYou also need the `emcee` package(http://dan.iel.fm/emcee) for MCMC sampling. Try\n\n     easy_install numpy matplotlib scipy emcee\n\nor\n\n     pip install numpy matplotlib scipy emcee\n\nto install these dependences if you miss them.\n\n### The basic sample contains:\n\n- R:     radial coordinate of subhalo, in unit of host R200\n- m:     subhalo mass, in unit of 10^10Msun/h. By default, disrupted subhaloes are also included in the sample (which may not be useful at all). You can suppress the creation of disrupted subhaloes, and only obtain survived population, by, e.g., \n\n        sample=SubhaloSample(M=1e4, include_disruption=False)\n\n- mAcc:  subhalo infall mass, in unit of 10^10Msun/h\n- weight: the number of appearances of this subhalo. This exists because the number of sampled subhaloes may not be the same as the expected number of subhaloes. The subhalo abundance can be correctly recovered when counting with this weight. By default, the weights are not uniform but determined by mass function in order to avoid the sample being dominated by low mass objects. If you want uniform weights, you can do, e.g., \n\n        sample=SubhaloSample(M=1e4, weighted_sample=False).\n\n### optional properties:  \n  - mStar/[1e10Msun/h],  the subhalo stellar mass\n  - Luminosity/[(1e10Msun/h)^2/(kpc/h)^3],  annihilation luminosity (adopting Ludlow14 mass-concentration by default)\n  - Rp/R200,  projected (along a line of sight) radial coordinate Rp. \n\nFor complete features, have a look at the docstrings and the source code (they are not long~).\n\n## Authors\nJiaxin Han (@Kambrian)[ICC, Durham]\nhttp://kambrian.github.io/SubGen", 
  "id": 40373511
}