{
  "read_at": 1462545990, 
  "description": "SSVEP-based BCI recording of 5 subjects.", 
  "README.md": "# dataset-ssvep-led\n\n## Introduction\n\nThis dataset gathers SSVEP-based BCI recordings of 5 subjects focusing on 3 groups of LED blinking at differents frequencies.\n\n\n## Related publications:\n\nThis dataset is used in the following publications:\n\n-  Emmanuel Kalunga, Karim Djouani, Yskandar Hamam, Sylvain Chevallier, Eric Monacelli. _SSVEP Enhancement Based on Canonical Correlation Analysis to Improve BCI Performances_. IEEE AFRICON, pp. 1-5, Ile Maurice, 2013.\n\n\n## Experimental setup\n\nThe g.Mobilab+ device is used for recording EEG at 256 Hz on 8 channels. For SSVEP stimulation, flash stimulus technique has been chosen. To avoid limitation imposed by refresh rate of computer screens, a microcontroller is set up to  flash stimuli with light emitting diodes (LED) at frequencies F ={13, 17, 21} Hz. The device has been controlled and the LED blinking is precise up to the millisecond. The eight electrodes are placed according to the 10/20 system on Oz, O1, O2, POz, PO3, PO4, PO7 and PO8.  The ground was placed on Fz and the reference was located on the right (or left) hear mastoid.\n\n## Data description\n\nThe datasets contains 5 directories, containing recording from 5 male and female subjects aged between 22 and 30 years old. Informed consent was obtained from all subjects, each one has signed a form attesting her or his consent.\n\nThe subjects were seated comfortably in a chair facing the computer screen placed at about 60 cm. Three LED arrays are placed on top, left and right sides of the computer screen and are the experimental targets.\n\nIn a recording session the subject was requested, in a random order, to look at blinking LED array, hereafter called stimuli. He was prompted to do so by a triangular cue appearing on the computer screen, on the left side to gaze at the left stimulus (i.e. 17 Hz), on the right side to gaze at the right stimulus (i.e. 21 Hz), on top to gaze at the top stimulus (i.e. 13 Hz) and at the center to gaze at the center of the screen where no stimulus is flashed. All LEDs arrays are flashing for the whole recording time. In a session, 10 trials were recorded per flash stimulus, for a total of 40 trials per session. During a trial the subject gazes at the flash stimuli for a period of 5 seconds followed by a 3 second break where\nthe subject is supposed to look at center of the computer screen (no flash). The subject was advised not to blink nor move eyes while gazing at any of the three flash stimuli. The subject was allowed to blink the eyes during the trial looking at the center of the screen. After a session, the subject was given a 2-minutes break. Four sessions were recorded per subject and a total of 160 trials were recorded for each subject. Since the EEG were recorded for later analysis, no signal processing was done online and no\nfeedback was provided to the subject.\n\nThe recording are saved in GDF format [1], the stimulations code for each class are available as time events. There is between 4 sessions for each user, recorded on different days, by the same operators, on the same hardware and in the same conditions.\n\n## Bibliography\n\n[1] A. Schlogl, _GDF - A general dataformat for biosignals_, http://arxiv.org/abs/cs/0608052\n", 
  "id": 40492787
}