{
  "read_at": 1462544964, 
  "description": "", 
  "README.md": "## DeepLab\r\n\r\n### Introduction\r\n\r\nDeepLab is a state-of-art deep learning system for semantic image segmentation built on top of [Caffe](http://caffe.berkeleyvision.org).\r\n\r\nIt combines densely-computed deep convolutional neural network (CNN) responses with densely connected conditional random fields (CRF).\r\n\r\nThis distribution provides a publicly available implementation for the key model ingredients first reported in an [arXiv paper](http://arxiv.org/abs/1412.7062), accepted in revised form as conference publication to the ICLR-2015 conference. \r\nIt also contains implementations for methods supporting model learning using only weakly labeled examples, described in a second follow-up [arXiv paper](http://arxiv.org/abs/1502.02734).\r\nPlease consult and consider citing the following papers:\r\n\r\n    @inproceedings{chen14semantic,\r\n      title={Semantic Image Segmentation with Deep Convolutional Nets and Fully Connected CRFs},\r\n      author={Liang-Chieh Chen and George Papandreou and Iasonas Kokkinos and Kevin Murphy and Alan L Yuille},\r\n      booktitle={ICLR},\r\n      url={http://arxiv.org/abs/1412.7062},\r\n      year={2015}\r\n    }\r\n\r\n    @article{papandreou15weak,\r\n      title={Weakly- and Semi-Supervised Learning of a DCNN for Semantic Image Segmentation},\r\n      author={George Papandreou and Liang-Chieh Chen and Kevin Murphy and Alan L Yuille},\r\n      journal={arxiv:1502.02734},\r\n      year={2015}\r\n    }\r\n\r\nNote that if you use the densecrf implementation, please consult and cite the following paper:\r\n\r\n    @inproceedings{KrahenbuhlK11,\r\n      title={Efficient Inference in Fully Connected CRFs with Gaussian Edge Potentials},\r\n      author={Philipp Kr{\\\"{a}}henb{\\\"{u}}hl and Vladlen Koltun},\r\n      booktitle={NIPS},      \r\n      year={2011}\r\n    }\r\n\r\n### Performance\r\n\r\nDeepLab currently achieves 73.9% on the challenging PASCAL VOC 2012 image segmentation task -- see the [leaderboard](http://host.robots.ox.ac.uk:8080/leaderboard/displaylb.php?challengeid=11&compid=6). \r\n\r\n### Pre-trained models\r\n\r\nWe have released several trained models and corresponding prototxt files at [here](http://ccvl.stat.ucla.edu/software/deeplab/). Please check it for more model details.\r\n\r\nThe best model among the released ones yields 73.6% on PASCAL VOC 2012 test set.\r\n\r\n### Python wrapper requirements\r\n\r\n1. Install wget library for python\r\n```\r\nsudo pip install wget\r\n```\r\n2. Change DATA_ROOT to point to the PASCAL images\r\n\r\n3. To use the mat_read_layer and mat_write_layer, please download and install [matio](http://sourceforge.net/projects/matio/files/matio/1.5.2/).\r\n\r\n### Running the code\r\n\r\n```\r\npython run.py\r\n```\r\n\r\n### FAQ\r\n\r\nCheck [FAQ](http://ccvl.stat.ucla.edu/deeplab_faq/) if you have some problems while using the code.\r\n", 
  "id": 40749980
}