{
  "read_at": 1462544993, 
  "description": "Python Online Paper Locator", 
  "README.md": "# Python Online Paper Locator\n\nPyopl is an extensible python module that searches and fetches bibtex citations from online sources and adds them to your bibliography. Currently, it supports searching and fetching through `crossref` and `arxiv`. The application has been designed in a modular manner providing an API such that adding/editing search engines becomes as easy as possible.\n\n## Installation\n\nDownload the provided repo and run\n\n```bash\npython setup.py install\n```\n\n## Usage\n\nYou can use pyopl to search online academic paper engines (current supported: crossref, arxiv) for your citation like this:\n\n```bash\npyopl deep learning\n```\n\nYou can also specify the engines you want to use:\n\n```bash\npyopl --engines=arxiv,crossref deep learning\n```\n\nThese commands default to the `--search` mode; If you want to fetch the bibtex citation you can do so like this:\n\n```bash\npyopl --fetch --engines=arxiv 1312.5602v1\n```\n\nWhile `--engines` is optional in search mode (default all), in `--fetch` you need to specify a single engine to fetch the citation from.\n\nFetch mode defaults to displaying the citation in `STDOUT` (where you can pipe it to your bibliography .bib file). Optionally, you can specify your bibliography file and `pyopl` will do the appending for you:\n\n```bash\npyopl --fetch --engines=arxiv --bib=/path/to/bib/file 1312.5602v1\n```\n\nLastly, `pyopl` offers the ability to write the citation as a separate .bib file in a specified folder. This could be useful, for example, when you want to synchronize your library between different machines:\n\n```bash\npyopl --fetch --engines=arxiv --bib=/path/to/bib/file --secondary-bib=/path/to/bib/folder 1312.5602v1\n```\n\n## Dependencies\n\nAlthough Pyopl by itself does not have any dependencies, some search engines might. Currently, `arxiv` depends on [Nathan Grigg's `arxiv2bib`](https://github.com/nathangrigg/arxiv2bib) (for bib formatting) and [`feedparser`](https://pypi.python.org/pypi/feedparser) (for reading the API).\n\n## License\n\nBSD\n", 
  "id": 41065659
}