{
  "id": 41102850, 
  "description": "Python scripts that simulate planetary orbits using the N-body REBOUND code, and plot the results", 
  "read_at": 1462546035, 
  "README.rst": "REBOUND - An open-source multi-purpose N-body code\n==================================================\n\n.. image:: http://img.shields.io/badge/license-GPL-green.svg?style=flat :target: https://github.com/hannorein/rebound/blob/master/LICENSE>`_\n.. image:: http://img.shields.io/badge/arXiv-1110.4876-orange.svg?style=flat :target: http://arxiv.org/abs/1110.4876\n.. image:: http://img.shields.io/badge/arXiv-1409.4779-orange.svg?style=flat :target: http://arxiv.org/abs/1409.4779\n.. image:: http://img.shields.io/badge/arXiv-1506.01084-orange.svg?style=flat :target: http://arxiv.org/abs/1506.01084\n\n-------------------\n\n.. image:: https://raw.github.com/hannorein/rebound/master/screenshots/shearingsheet.png\n.. image:: https://raw.github.com/hannorein/rebound/master/screenshots/dense.png\n.. image:: https://raw.github.com/hannorein/rebound/master/screenshots/outersolarsystem.png\n.. image:: https://raw.github.com/hannorein/rebound/master/screenshots/disc.png\n\n\nHow to use REBOUND - a quick introduction\n-----------------------------------------\n    \nYou can call REBOUND from C or Python. Which programming language you want to use depends on your taste and your specific application. In short: If you simply want to integrate a few particles such as a planetary system with the high order integrator IAS15 or the new symplectic integrator WHFast then use the Python version. If you want to run large simulations with millions of particles, use an exotic integrator, use OpenGL visualizations, or make use of the distributed tree code then use the C version. \n\nAll the computationally expensive parts of REBOUND are written in C. So even if you use the Python version, you'll end up with a very fast code.\n\nTo install the Python version, simply type the following command into a terminal::\n\n    pip install rebound\n\nTo learn more about how to use REBOUND with Python have a look at the iPython/Jupyter tutorials at https://github.com/hannorein/rebound/blob/master/python_tutorials/\n\nTo install the C version, simply copy and paste the following command into your terminal::\n    \n    git clone http://github.com/hannorein/rebound && cd rebound/examples/shearing_sheet && make && ./rebound\n\nTo learn more about how to use REBOUND with C, continue reading this file.\n\n\nFeature list \n------------\n\nAn incomplete feature list of REBOUND:\n\n* Several symplectic integrators (WHFast, WH, SEI, LEAPFROG)\n* High accuracy non-symplectic integrator with adaptive timestepping (IAS15)\n* Support for collisional/granular dynamics, various collision detection routines\n* The code is written entirely in C, conforms to the ISO standard C99\n* Easy-to-use Python module, installation in 3 words: `pip install rebound`\n* Extensive set of example problems in both C and Python\n* Real-time, 3D OpenGL visualization (C version)\n* Parallelized with OpenMP (for shared memory systems)\n* Parallelized with MPI using an essential tree for gravity and collisions (for distributed memory systems)\n* No libraries are needed, use of OpenGL/GLUT/libpng for visualization is optional\n* The code is fully open-source and can be downloaded freely from http://github.com/hannorein/rebound\n* No configuration is needed to run any of the example problems. Just type `make && ./rebound` in the problem directory to run them\n* Standard ASCII or binary output routines \n* Different modules are easily interchangeable by one line in the Makefile\n\n\nContributors\n------------\n* Hanno Rein, University of Toronto, <hanno@hanno-rein.de>\n* Shangfei Liu, Kavli Institute for Astronomy and Astrophysics at Peking University (KIAA-PKU), Beijing, <liushangfei@pku.edu.cn>\n* David S. Spiegel, Institute for Advanced Study (IAS), Princeton, <dave@ias.edu>\n* Akihiko Fujii, National Astronomical Observatory of Japan/University of Tokyo, Tokyo, <akihiko.fujii@nao.ac.jp>\n* Dan Tamayo, University of Toronto, <dtamayo@cita.utoronto.ca>\n\nREBOUND is open source. You are invited to contribute to this project if you are using it. Please contact any of the authors above if you have any questions.\n\n\nPapers\n------\n\nThere are three papers describing the functionality of REBOUND. \n\n1. Rein & Liu (Astronomy and Astrophysics, Volume 537, A128, 2012) describe the code structure and the main feature including the gravity and collision routines for many particle systems. http://adsabs.harvard.edu/abs/2012A%26A...537A.128R \n\n2. Rein & Spiegel (Monthly Notices of the Royal Astronomical Society, Volume 446, Issue 2, p.1424-1437) describe the versatile high order integrator IAS15 which is now part of REBOUND. http://adsabs.harvard.edu/abs/2015MNRAS.446.1424R\n\n3. Rein & Tamayo (Monthly Notices of the Royal Astronomical Society, in press) describe WHFast, the fast and unbiased implementation of a symplectic Wisdom-Holman integrator for long term gravitational simulations. http://arxiv.org/abs/1506.01084\n\n\nLicense\n-------\nREBOUND is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\n\nREBOUND is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with REBOUND.  If not, see <http://www.gnu.org/licenses/>.\n\n\nAcknowledgments\n---------------\nWhen you use this code or parts of this code for results presented in a scientific publication, please send us a copy of your paper so that we can keep track of all publications that made use of the code. We would greatly appreciate a citation to Rein and Liu (2012) and an acknowledgment of the form:\n\n\"Simulations in this paper made use of the REBOUND code which can be downloaded freely at http://github.com/hannorein/rebound.\"\n\nIf you use the IAS15 integrator, please cite Rein and Spiegel (2015).\n\nIf you use the WHFast integrator, please cite Rein and Tamayo (2015).\n\n\nThe C version of REBOUND\n========================\n\nThis section describes the C version of REBOUND. To learn how to install REBOUND for Python have a look at the iPython/Jupiter notebooks at https://github.com/hannorein/rebound/blob/master/python_tutorials/index.ipynb. Hint: It's super easy!\n\nInstallation\n------------\n\nYou can download, compile and run REBOUND on almost any modern operating system within seconds.  Simply copy and paste this line to your terminal and press enter::\n\n    git clone http://github.com/hannorein/rebound && cd rebound/examples/shearing_sheet && make && ./rebound\n\nor if you do not have git installed::\n\n    wget --no-check-certificate https://github.com/hannorein/rebound/tarball/master -O- | tar xvz && cd hannorein-rebound-*/examples/shearing_sheet/ && make && ./rebound\n\n*Note:* Make sure you have a compiler suite installed. Open a terminal and type `make` and `cc` to test if your installation is complete. If you are on OSX, you can download Xcode from the AppStore (for free). Once installed, open Xcode, go to Settings, then Downloads and install the Command Line Tools. \n\n\n\nAvailable modules\n-----------------\n\nREBOUND is extremely modular. You have the choice between different gravity, collision, boundary modules. It is also possible to implement completely new modules with minimal effort. Modules are chosen by setting up symbolic links in the Makefile. There is no need to run a configure script. For example, the Makefile might create a link `gravity.c` that points to one of the gravity modules, say `gravity_tree.c`. This tells the code to use a tree code to do the gravity calculation.\n\nThis setup allows you to work on multiple projects at the same time using different modules. When switching to another problem, nothing has to be set-up and the problem can by compiled by simply typing `make` in the corresponding directory (see below).\n\nThe following sections list the available modules that come with REBOUND.\n\n**Gravity**::\n  \n Module name        | Description\n ------------------ | -----------\n `gravity_none.c`   | No self-gravity\n `gravity_direct.c` | Direct summation, O(N^2)\n `gravity_opencl.c` | Direct summation, O(N^2), but accelerated using the OpenCL framework.\n `gravity_tree.c`   | Oct tree, Barnes & Hut 1986, O(N log(N))\n `gravity_grape.c`  | GRAPE, hardware accelerated direct summation, Sugimoto et al. 1990\n `gravity_fft.c`    | Two dimensional gravity solver using FFTW, works in a periodic box and the shearing sheet. (Not well tested yet.)\n\n\n**Collision detection**::\n\n Module name            | Description\n ---------------------- | -----------\n `collisions_none.c`    | No collision detection\n `collisions_direct.c`  | Direct nearest neighbour search, O(N^2)\n `collisions_tree.c`    | Oct tree, O(N log(N))\n `collisions_sweep.c`   | Plane sweep algorithm, ideal for low dimensional  problems, O(N) or O(N^1.5) depending on geometry \n `collisions_sweepphi.c`| Plane sweep algorithm along the azimuthal angle, ideal for narrow rings in global simulations, O(N) or O(N 1.5) depending on geometry\n\n\n**Boundaries**::\n\n Module name            | Description\n ---------------------- | -----------\n `boundaries_open.c`    | Particles are removed from the simulation if they leaves the box.\n `boundaries_none.c`    | Dummy. Particles are not affected by boundary conditions.\n `boundaries_periodic.c`| Periodic boundary conditions. Particles are reinserted on the other side if they cross the box boundaries. You can use an arbitrary number of ghost-boxes with this module.\n `boundaries_shear.c`   | Shear periodic boundary conditions. Similar to periodic boundary conditions, but ghost-boxes are moving with constant speed, set by the shear.\n  \n\nAvailable integrators\n---------------------\n\nThe following integrators are available within REBOUND. Since May 2015, the integrator can be changed at runtime. Thus, the integrator appears no longer in the Makefile. To set the integrator, set the `integrator` variable in the `probelm_init()` function (see below) to one of the integrator names (it's a C enum)::\n\n Integrator name   | Description\n ----------------- | -----------\n IAS15             | IAS15 stands for Integrator with Adaptive Step-size control, 15th order. It is a vey high order, non-symplectic integrator which can handle arbitrary (velocity dependent) forces and is in most cases accurate down to machine precision. IAS15 can integrate variational equations. Rein & Spiegel 2015, Everhart 1985\n WHFAST            | WHFast is the integrator described in Rein & Tamayo 2015, it's a second order symplectic Wisdom Holman integrator with 11th order symplectic correctors. It is extremely fast and accurate, uses Gauss f and g functions to solve the Kepler motion and can integrate variational equations.\n EULER             | Euler scheme, first order\n LEAPFROG          | Leap frog, second order, symplectic\n WH                | SWIFT-style Wisdom-Holman Mapping, mixed variable symplectic integrator for the Kepler potential, second order, note that  `integrator_whfast.c` almost always offers better characteristics, Wisdom & Holman 1991, Kinoshita et al 1991\n SEI               | Symplectic Epicycle Integrator (SEI), mixed variable symplectic integrator for the shearing sheet, second order, Rein & Tremaine 2011\n HYBRID            | An experimental hybrid symplectic integrator that uses WHFast for long term integrations but switches over to IAS15 for close encounters.\n\n\n\nDirectory structure and compilation\n-----------------------------------\n\nIn the main directory, you find a sub-directory called `src` which contains the bulk parts of the  source code and a directory called `examples` with various example problems. To compile one of the example, you have to go to that directory, for example:\n\n    cd examples/shearing_sheet/\n\nThen, type\n\n    make\n\nThis will do the following things    \n\n* It sets various environment variables. These determine settings like the compiler optimization flags and which libraries are included (see below). \n* It creates symbolic links to the active modules. This allows you to choose from different gravity solvers, boundary conditions and collision solvers. For example, to change the gravity solver from using a tree to direct summation you could change `gravity_tree.c` to `gravity_direct.c`. \n* It creates a symbolic link to the current problem file. Each problem file contains the initial conditions and the output routines for the current problem. You do not need to change any file in `src/` to create a new problem unless you want to do something very special. This keeps the initial conditions and the code itself cleanly separated.\n* It compiles the code and copies the binary into the current directory.\n\nIf something goes wrong, it is most likely the visualization module. You can turn it off by deleting the line which contains `OPENGL` in the makefile. Of course, you will not see the visualization in real time anymore. See below on how to install GLUT and fix this issue.\n\nIf you want to start working on your own problem, simply copy one of the example directories. Then modify `problem.c` and `Makefile` according to your application.  \n\n\nRunning REBOUND\n---------------\n\nTo run the code, simply type\n\n    ./rebound\n\nA window should open and you will see a simulation running in real time. The problem in the directory `examples/shearing_sheet/` simulates the rings of Saturn and uses a local shearing sheet approximation. Have a look at the other examples as well and you will quickly get an idea of what REBOUND can do. \n\n\n\nEnvironment variables\n---------------------\n\nThe makefile in each problem directory sets various environment variables. These determine the compiler optimization flags, the libraries included and basic code settings. Let us look at one of the examples `shearing_sheet` in more detail. \n\n- `export PROFILING=1`. This enables profiling. You can see how much time is spend in the collision, gravity, integrator and visualization modules. This is useful to get an idea about the computational bottleneck.\n- `export QUADRUPOLE=0`. This disables the calculation of quadrupole moments for each cell in the tree. The simulation is faster, but less accurate.\n- `export OPENGL=1`. This enables real-time OpenGL visualizations and requires both OpenGL and GLUT libraries to be installed. This should work without any further adjustments on any Mac which has Xcode installed. On Linux both libraries must be installed in `/usr/local/`. You can change the default search paths for libraries in the file `src/Makefile`. \n- `export MPI=0`. This disables parallelization with MPI.\n- `export OPENMP=1`. This enables parallelization with OpenMP. The number of threads can be set with an environment variable at runtime, e.g.: `export OMP_NUM_THREADS=8`.\n- `export CC=gcc`. This flag can be used to override the default compiler. The default compilers are `gcc` for the sequential and `mpicc` for the parallel version. \n- `export LIB=`. Additional search paths for external libraries (such as OpenGL, GLUT and LIBPNG) can be set up using this variable. \n- `export OPT=-O3`. This sets the additional compiler flag `-O3` and optimizes the code for speed. Additional search paths to header files for external libraries (such as OpenGL, GLUT and LIBPNG) can be set up using this variable. \n\nWhen you type make in your problem directory, all of these variables are read and passed on to the makefile in the `src/` directory. The `OPENGL` variable, for example, is used to determine if the OpenGL and GLUT libraries should be included. If the variable is `1` the makefile also sets a pre-compiler macro with `-DOPENGL`. Note that because OPENGL is incompatible with MPI, when MPI is turned on (set to 1), OPENGL is automatically turned off (set to 0) in the main makefile. You rarely should have to work directly with the makefile in the `src/` directory yourself.\n\n\n\nUser-defined functions in the problem.c file\n--------------------------------------------\n\nThe problem.c file must contain at least three functions. You do need to implement all of them, but a dummy (doing nothing) is sufficient to successfully link the object files. The following documentation describes what these functions do.\n\n\n- `void problem_init(int argc, char* argv[])`\n\n    This routine is where you read command line arguments and set up your initial conditions. REBOUND does not come with a built-in functionality to read configuration files at run-time. We consider this not a missing feature. In REBOUND, you have one `problem.c` file for each problem. Thus, everything can be set within this file. There are, of course, situation in which you want to do something like a parameter space survey. In almost all cases, you vary only a few parameters. You can easily read these parameters from the command line.\n \n    Here is an example that reads in a command line argument given to REBOUND in the standard unix format `./rebound --boxsize=200.`. A default value of 100 is used if no parameter is passed to REBOUND.::\n\n        // At the top of the problem.c file add\n        #include \"input.h\"\n        // In problem_init() add\n        boxsize = input_get_double(argc,argv,\"boxsize\",100.);\n\n- `void problem_output()`\n\n    This function is called at the beginning of the simulation and at the end of each time-step. You can implement your output routines here. Many basic output functions are already implemented in REBOUND. See `output.h` for more details. The function `output_check(odt)` can be used to easily check if an output is needed if you want to trigger and output once per time interval `odt`. For example, the following code snippet outputs some timing statistics to the console every 10 time-steps::\n    \n        if (output_check(10.*dt)){\n            output_timing();\n        }\n \n- `void problem_finish()`\n\n    This function is called at the end of the simulation, when t >= tmax. This is the last chance to output any quantities before the program ends.\n\n\n- `void problem_additional_forces()` (optional function pointer)\n\n    In addition to the four mandatory functions that need to be present, you can also define some other functions and make them callable by setting a function pointer. The function pointer `problem_additional_forces()` which is called one or more times per time-step whenever the forces are updated. This is where you can implement all kind of things such as additional forces onto particles. \n    \n    The following lines of code implement a simple velocity dependent force.  `IAS15` is best suited for this (see `examples/dragforce`)::\n    \n        void velocity_dependent_force(){\n            for (int i=1;i<N;i++){\n               particles[i].ax -= 0.0000001 * particles[i].vx;\n               particles[i].ay -= 0.0000001 * particles[i].vy;\n               particles[i].az -= 0.0000001 * particles[i].vz;\n            }\n        }\n    \n    Make sure you set the function pointer in the `problem_init()` routine::\n    \n        problem_additional_forces = velocity_dependent_force;\n    \n    By default, all integrators assume that the forces are velocity dependent. If all forces acting on particles only depend on positions, you can set the following variable (defined in `integrator.h`) to `0` to speed up the calculation::\n    \n        // Add to problem_init()\n        integrator_force_is_velocitydependent = 0;\n\n\nHow to install GLUT \n-------------------\n\nThe OpenGL Utility Toolkit (GLUT) comes pre-installed as a framework on Mac OSX. If you are working on another operating system, you might have to install GLUT yourself if you see an error message such as `error: GL/glut.h: No such file or directory`. On Debian and Ubuntu, simply make sure the `freeglut3-dev` package is installed. If glut is not available in your package manager, go to http://freeglut.sourceforge.net/ download the latest version, configure it with `./configure` and compile it with `make`. Finally install the library and header files with `make install`. \n\nYou can also install freeglut in a non-default installation directory if you do not have super-user rights by running the freeglut installation script with the prefix option::\n\n    mkdir ${HOME}/local\n    ./configure --prefix=${HOME}/local\n    make all && make install\n\nThen, add the following lines to the REBOUND Makefile::\n\n    OPT += -I$(HOME)/local/include\n    LIB += -L$(HOME)/local/lib\n\nNote that you can still compile and run REBOUND even if you do not have GLUT installed. Simply set `OPENGL=0` in the makefile (see below). \n\n\nExamples\n========\nThe following examples can all be found in the `examples` directory. \nWhatever you plan to do with REBOUND, chances are there is already an example available which you can use as a starting point.\n\n\nexamples/bouncing_balls\n  This example is a simple test of collision detection\n  methods. To change the collision detection algorithm, you can replace\n  the module collisions_direct.c to either collisions_tree.c or\n  collisions_sweep.c in the Makefile.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_periodic.c`` ``collisions_direct.c``.\n\nexamples/bouncing_balls_corners\n  This example tests collision detection methods across box boundaries.\n  There are four particles, one in each corner. To see the ghost boxes in OpenGL\n  press `g` while the simulation is running.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_periodic.c`` ``collisions_tree.c``.\n\nexamples/bouncing_string\n  This example tests collision detection methods.\n  The example uses a non-square, rectangular box. 10 particles are placed\n  along a line. All except one of the particles are at rest\n  initially.\n  \n  Modules used: ``gravity_none.c`` ``boundaries_periodic.c`` ``collisions_direct.c``.\n\nexamples/circumplanetarydust\n  This example shows how to integrate circumplanetary\n  dust particles using the `integrator_ias15.c` module.\n  The example sets the function pointer `problem_additional_forces`\n  to its own function that describes the radiation forces.\n  The example uses a beta parameter of 0.01.\n  The output is custom too, outputting the semi-major axis of\n  every dust particle relative to the planet.\n  Only one dust particle is used in this example, but there could be\n  many.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/closeencounter\n  This example integrates a densely packed planetary system\n  which becomes unstable on a timescale of only a few orbits. The IAS15\n  integrator with adaptive timestepping is used. This integrator\n  automatically decreases the timestep whenever a close\n  encounter happens. IAS15 is very high order and ideally suited for the\n  detection of these kind of encounters.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/closeencounter_hybrid\n  This example integrates a densely packed planetary system\n  which becomes unstable on a timescale of only a few orbits.\n  This is a test case for the HYBRID integrator.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/closeencounter_record\n  This example integrates a densely packed planetary system\n  which becomes unstable on a timescale of only a few orbits.\n  The example is identical to the `close_encounter` sample, except that\n  the collisions are recorded and written to a file. What kind of collisions\n  are recorded can be easily modified. It is also possible to implement some\n  additional physics whenever a collision has been detection (e.g. fragmentation).\n  The collision search is by default a direct search, i.e. O(N^2) but can be\n  changed to a tree by using the `collisions_tree.c` module.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_direct.c``.\n\nexamples/dragforce\n  This is a very simple example on how to implement a velocity\n  dependent drag force. The example uses the IAS15 integrator, which\n  is ideally suited to handle non-conservative forces.\n  No gravitational forces or collisions are present.\n  \n  Modules used: ``gravity_none.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/eccentric_orbit\n  This example uses the IAS15 integrator to simulate\n  a very eccentric planetary orbit. The integrator\n  automatically adjusts the timestep so that the pericentre passages\n  resolved with high accuracy.\n  \n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/forced_migration\n  This example applies dissipative forces to two\n  bodies orbiting a central object. The forces are specified\n  in terms of damping timescales for the semi-major axis and\n  eccentricity. This mimics planetary migration in a protostellar disc.\n  The example reproduces the study of Lee & Peale (2002) on the\n  formation of the planetary system GJ876. For a comparison,\n  see figure 4 in their paper. The IAS15 integrator is used\n  because the forces are velocity dependent.\n  Special thanks goes to Willy Kley for helping me to implement\n  the damping terms as actual forces.\n  \n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/granulardynamics\n  This example is about granular dynamics. No gravitational\n  forces are present in this example, which is why the module\n  `gravity_none.c` is used. Two boundary layers made of\n  particles simulate shearing walls. These walls are heating\n  up the particles, create a dense and cool layer in the middle.\n  \n  Modules used: ``gravity_none.c`` ``boundaries_periodic.c`` ``collisions_tree.c``.\n\nexamples/J2\n  This example presents an implementation of the J2\n  gravitational moment. The equation of motions are integrated with\n  the 15th order IAS15 integrator. The parameters in this examples\n  have been chosen to represent those of Saturn, but you can easily\n  change them or even include higher order terms in the multipole\n  expansion.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/kozai\n  This example uses the IAS15 integrator to simulate\n  a Lidov Kozai cycle of a planet perturbed by a distant star. The integrator\n  automatically adjusts the timestep so that even very high\n  eccentricity encounters are resolved with high accuracy.\n  \n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/megno\n  This example uses the IAS15 integrator\n  to calculate the MEGNO of a two planet system.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/mergers\n  This example integrates a densely packed planetary system\n  which becomes unstable on a timescale of only a few orbits. The IAS15\n  integrator with adaptive timestepping is used. The bodies have a finite\n  size and merge if they collide. Note that the size is unphysically large\n  in this example.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_direct.c``.\n\nexamples/opencl\n  A self-gravitating disc is integrated using\n  the OpenCL direct gravity summation module.\n  \n  This is a very simple implementation (see `gravity_opencl.c`).\n  Currently it only supports floating point precision. It also\n  transfers the data back and forth from the GPU every timestep.\n  There are considerable improvements to be made. This is just a\n  proof of concept. Also note that the code required N to be a\n  multiple of the workgroup size.\n  \n  You can test the performance increase by running:\n  `make direct && ./rebound`, which will run on the CPU and\n  `make && ./rebound`, which will run on the GPU.\n  \n  The Makefile is working with the Apple LLVM compiler. Changes\n  might be necessary for other compilers such as gcc.\n  \n  \n  Modules used: ``gravity_opencl.c`` ``boundaries_open.c`` ``collisions_none.c`` ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/outer_solar_system\n  This example uses the IAS15 integrator\n  to integrate the outer planets of the solar system. The initial\n  conditions are taken from Applegate et al 1986. Pluto is a test\n  particle. This example is a good starting point for any long term orbit\n  integrations.\n  \n  You probably want to turn off the visualization for any serious runs.\n  Just go to the makefile and set `OPENGL=0`.\n  \n  The example also works with the Wisdom-Holman symplectic integrator.\n  Simply change the integrator to `integrator_wh.c` in the Makefile.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_none.c`` ``collisions_none.c``.\n\nexamples/overstability\n  A narrow box of Saturn's rings is simulated to\n  study the viscous overstability. Collisions are resolved using\n  the plane-sweep method.\n  \n  It takes about 30 orbits for the overstability to occur. You can\n  speed up the calculation by turning off the visualization. Just press\n  `d` while the simulation is running. Press `d` again to turn it back on.\n  \n  You can change the viewing angle of the camera with your mouse or by pressing\n  the `r` key.\n  \n  Modules used: ``gravity_none.c`` ``boundaries_shear.c`` ``collisions_sweep.c``.\n\nexamples/prdrag\n  This example provides an implementation of the\n  Poynting-Robertson effect. The code is using the IAS15 integrator\n  which is ideally suited for this velocity dependent force.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/restarting_simulation\n  This example demonstrates how to restart a simulation\n  using a binary file. A shearing sheet ring simulation is used, but\n  the same method can be applied to any other type of simulation.\n  \n  First, run the program with `./rebound`.\n  Random initial conditions are created and\n  a restart file is written once per orbit.\n  Then, to restart the simulation, run the\n  program with `./rebound --restart restart.bin`.\n  \n  \n  Modules used: ``gravity_direct.c`` ``boundaries_shear.c`` ``collisions_direct.c``.\n\nexamples/restricted_threebody\n  This example simulates a disk of test particles around\n  a central object, being perturbed by a planet.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/restricted_threebody_mpi\n  This problem uses MPI to calculate the restricted three\n  body problem. Active particles are copied to all nodes. All other\n  particles only exist on one node and are not automatically (re-)\n  distributed. There is not domain decomposition used in this example.\n  Run with `mpirun -np 4 nbody`.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/selfgravity_disc\n  A self-gravitating disc is integrated using\n  the leap frog integrator. Collisions are not resolved.\n  \n  Modules used: ``gravity_tree.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/selfgravity_disc_grape\n  A self-gravitating disc is integrated using\n  the leap frog integrator. This example is using the GRAPE\n  module to calculate the self-gravity. You need to have a physical\n  GRAPE card in your computer to run this example.\n  Collisions are not resolved.\n  \n  Modules used: ``gravity_grape.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/selfgravity_plummer\n  A self-gravitating Plummer sphere is integrated using\n  the leap frog integrator. Collisions are not resolved. Note that the\n  fixed timestep might not allow you to resolve individual two-body\n  encounters. An alternative integrator is `integrator_ias15.c` which\n  comes with adaptive timestepping.\n  \n  Modules used: ``gravity_tree.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/shearing_sheet\n  This example simulates a small patch of Saturn's\n  Rings in shearing sheet coordinates. If you have OpenGL enabled,\n  you'll see one copy of the computational domain. Press `g` to see\n  the ghost boxes which are used to calculate gravity and collisions.\n  Particle properties resemble those found in Saturn's rings.\n  \n  \n  Modules used: ``gravity_tree.c`` ``boundaries_shear.c`` ``collisions_tree.c``.\n\nexamples/shearing_sheet_2\n  This example is identical to the shearing_sheet\n  example but uses a different algorithm for resolving individual\n  collisions. In some cases, this might give more realistic results.\n  Particle properties resemble those found in Saturn's rings.\n  \n  In this collision resolve method, particles are displaced if they\n  overlap. This example also shows how to implement your own collision\n  routine. This is where one could add fragmentation, or merging of\n  particles.\n  \n  \n  Modules used: ``gravity_tree.c`` ``boundaries_shear.c`` ``collisions_tree.c``.\n\nexamples/shearing_sheet_fft\n  This problem is identical to the other shearing\n  sheet examples but uses an FFT based gravity solver.\n  To run this example, you need to install the FFTW library.\n  Collisions are detected using a plane sweep algorithm.\n  There is no tree present in this simulation.\n  \n  Modules used: ``gravity_fft.c`` ``boundaries_shear.c`` ``collisions_sweep.c``.\n\nexamples/shearing_sheet_grape\n  This is yet another shearing sheet example,\n  it uses a GRAPE to calculate gravity. Note that you need to have\n  a physical GRAPE card installed in your computer to run this\n  simulation. Particle properties resemble those found in\n  Saturn's rings.\n  \n  Modules used: ``gravity_grape.c`` ``boundaries_shear.c`` ``collisions_sweep.c``.\n\nexamples/shearing_sheet_profiling\n  This example demonstrates how to use the\n  profiling tool that comes with REBOUND to find out which parts\n  of your code are slow. To turn on this option, simple set\n  `PROFILING=1` in the Makefile.\n  \n  Modules used: ``gravity_tree.c`` ``boundaries_shear.c`` ``collisions_tree.c``.\n\nexamples/simple\n  This example uses the IAS15 integrator\n  to calculate the MEGNO of a two planet system.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_none.c`` ``collisions_none.c``.\n\nexamples/solar_system\n  This example integrates all planets of the Solar\n  System. The data comes from the NASA HORIZONS system.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_none.c`` ``collisions_none.c``.\n\nexamples/spreading_ring\n  A narrow ring of collisional particles is spreading.\n  The example uses the Wisdom Holman integrator. A plane-sweep algorithm\n  in the phi direction is used to detect collisions.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_sweepphi.c``.\n\nexamples/star_of_david\n  This example uses the IAS15 integrator\n  to integrate the \"Star od David\", a four body system consisting of two\n  binaries orbiting each other. Note that the time is running backwards,\n  which illustrates that IAS15 can handle both forward and backward in time\n  integrations. The initial conditions are by Robert Vanderbei. For more\n  information see http://www.princeton.edu/%7Ervdb/WebGL/New.html\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_none.c`` ``collisions_none.c``.\n\nexamples/stark\n  This example calculates the Stark problem.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/stark_radial\n  This example uses the IAS15 integrator\n  to calculate the MEGNO of a two planet system.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/symplectic_integrator\n  This example uses the symplectic Wisdom Holman (WH) integrator\n  to integrate test particles on eccentric orbits in a fixed potential.\n  Note that the WH integrator assumes that the central object is at the origin.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_open.c`` ``collisions_none.c``.\n\nexamples/viewer\n  This example doesn't simulate anything. It's just a\n  visualization toll that can display data in the form x, y, z, r.\n  This might be useful when large simulations have been run and you want\n  to look (at parts of) it at a later time.\n  \n  Note that this example uses only dummy modules.\n  \n  Modules used: ``gravity_none.c`` ``boundaries_periodic.c`` ``collisions_dummy.c``.\n\nexamples/whfast\n  This example uses the symplectic Wisdom Holman (WH) integrator\n  to integrate test particles on eccentric orbits in a fixed potential.\n  Note that the WH integrator assumes that the central object is at the origin.\n  \n  Modules used: ``gravity_direct.c`` ``boundaries_none.c`` ``collisions_none.c``.\n\nOpenGL keyboard command\n-----------------------\nYou can use the following keyboard commands to alter the OpenGL real-time visualizations.::\n\n Key     | Function\n -------------------------\n (space) | Pause simulation.\n d       | Pause real-time visualization (simulation continues).\n q       | Quit simulation.\n s       | Toggle three dimensional spheres (looks better)/points (draws faster)\n g       | Toggle ghost boxes\n r       | Reset view. Press multiple times to change orientation.\n x/X     | Move to a coordinate system centred on a particle (note: does not work if particle array is constantly resorted, i.e. in a tree.)\n t       | Show tree structure.\n m       | Show centre of mass in tree structure (only available when t is toggled on).\n p       | Save screen shot to file.\n c       | Toggle clear screen after each time-step.\n w       | Draw orbits as wires (particle with index 0 is central object).  \n\n", 
  "update_readme.py": "#!/usr/bin/python\n# This script automatically creates a list of examples by reading the header in all problem.c files.\nimport glob\n\nwith open(\"README.rst\") as f:\n    readme = f.readlines()\n\nkeep_lines_after_header = 5\nwith open(\"README.rst\",\"w\") as f:\n    start_delete = -1\n    for i in xrange(0,len(readme)):\n        if readme[i]==\"Examples\\n\":\n            if readme[i+1]==\"========\\n\":\n                start_delete = i + keep_lines_after_header\n        if start_delete!=-1 and readme[i+2]==\"-----------------------\\n\":\n            for problemc in glob.glob(\"./examples/*/problem.c\"):\n                will_output = 0\n                with open(problemc) as pf:\n                    did_output=0\n                    for line in pf:\n                        if line[0:10] == \" * @detail\":\n                            will_output = 1\n                            line = \" * \" + line[10:]\n                            f.write(\"\\nexamples/\"+problemc.split(\"/\")[2]+\"\\n\")\n                    \n                        if line[0:11] == \" * @section\":\n                            will_output = 2\n                        if will_output==1:\n                            f.write(\"  \"+line[3:].strip()+\"\\n\")\n                        if will_output==2 and did_output==0:\n                            did_output = 1\n                            f.write(\"  Modules used:\");\n                            with open(\"examples/\"+problemc.split(\"/\")[2]+\"/Makefile\") as mf:\n                                for linem in mf:\n                                    if linem.strip()[0:6] == \"ln -fs\":\n                                        sourcefile = linem.strip().split(\" \")[2].split(\"/\")[-1]\n                                        if sourcefile!=\"problem.c\":\n                                            f.write(\" ``\"+sourcefile+\"``\")\n                            f.write(\".\\n\");\n                    if did_output==0:\n                        print \"Warning: Did not find description in \"+problemc\n            start_delete = -1\n        if start_delete==-1 or i<start_delete:\n            f.write(readme[i])\n\n"
}