{
  "read_at": 1462545631, 
  "description": "A Fast Implementation of Random Forests", 
  "README.md": "[![Build Status](https://travis-ci.org/imbs-hl/ranger.svg?branch=master)](https://travis-ci.org/imbs-hl/ranger)\n[![Coverage Status](https://coveralls.io/repos/github/imbs-hl/ranger/badge.svg?branch=coveralls_new)](https://coveralls.io/github/imbs-hl/ranger?branch=coveralls_new)\n![CRAN Downloads month](http://cranlogs.r-pkg.org/badges/ranger?color=brightgreen)\n![CRAN Downloads overall](http://cranlogs.r-pkg.org/badges/grand-total/ranger?color=brightgreen)\n## ranger: A Fast Implementation of Random Forests\nMarvin N. Wright, wright@imbs.uni-luebeck.de\n\n### Introduction\nRanger is a fast implementation of random forest (Breiman 2001) or recursive partitioning, particularly suited for high dimensional data. Classification, regression, probability estimation and survival forests are supported. Classification and regression forests are implemented as in the original Random Forest (Breiman 2001), survival forests as in Random Survival Forests (Ishwaran et al. 2008). For probability estimation forests see Malley et al. (2012). \n\nRanger is written in C++, but a version for R is available, too. We recommend to use the R version. It is easy to install and use and the results are readily available for further analysis. The R version is as fast as the pure C++ version.\n\n### Installation\nTo install the Ranger R package from CRAN, just run\n\n```R\ninstall.packages(\"ranger\")\n```\n\nR version >= 3.1 is required. Note that, for now, R-devel and the new RTools toolchain is required for multithreading on Windows platforms (or install a binary version).\n\nTo install the C++ version of Ranger in Linux or Mac OS X you will need a compiler supporting C++11 (i.e. gcc >= 4.7 or Clang >= 3.0) and Cmake. To build start a terminal from the Ranger main directory and run the following commands\n\n```bash\ncd source\nmkdir build\ncd build\ncmake ..\nmake\n```\n\nAfter compilation there should be an executable called \"ranger\" in the build directory. \n\nTo run the C++ version in Microsoft Windows please cross compile or ask for a binary.\n\n### Usage\nFor usage of the R version see ?ranger in R. Most importantly, see the Examples section. As a first example you could try \n\n```R  \nranger(Species ~ ., data = iris)\n```\n\nIn the C++ version type \n\n```bash\nranger --help \n```\n\nfor a list of commands. First you need a training dataset in a file. This file should contain one header line with variable names and one line with variable values per sample. Variable names must not contain any whitespace, comma or semicolon. Values can be seperated by whitespace, comma or semicolon but can not be mixed in one file. A typical call of Ranger would be for example\n\n```bash\nranger --verbose --file data.dat --depvarname Species --treetype 1 --ntree 1000 --nthreads 4\n```\n\nIf you find any bugs, or if you experience any crashes, please report to us. If you have any questions just ask, we won't bite. \n\n### References\n* Wright, M. N. & Ziegler, A. (2016). ranger: A Fast Implementation of Random Forests for High Dimensional Data in C++ and R. Journal of Statistical Software, in press. http://arxiv.org/abs/1508.04409.\n* Breiman, L. (2001). Random forests. Machine learning, 45(1), 5-32.\n* Ishwaran, H., Kogalur, U. B., Blackstone, E. H., & Lauer, M. S. (2008). Random survival forests. The Annals of Applied Statistics, 841-860.\n* Malley, J. D., Kruppa, J., Dasgupta, A., Malley, K. G., & Ziegler, A. (2012). Probability machines: consistent probability estimation using nonparametric learning machines. Methods Inf Med, 51(1), 74.\n", 
  "id": 41377351
}