{
  "README": "\nThese files contain practical examples of the X3D pathway introduced by Vogt+, \"Advanced Data Visualization in Astrophysics: the X3D Pathway\", ApJ 818, 115 (2016). \n\nFor online examples of interactive 3-D models using HTML+X3D, see: \n\nhttp://fpavogt.github.io/x3d-pathway/\n\n\nIf you find some of this code useful for your research, please cite the above article accordingly, as well as the DOI of the repository release you used. E.g.:\n\n- for the \"v0.9 arXiv\" release, DOI:10.5281/zenodo.31953\n- for the \"v1.0 ApJ\" release, DOI:10.5281/zenodo.45079 \n\nFrom the article abstract: \n\n\"Most modern astrophysical datasets are multi-dimensional; a characteristic that can nowadays generally be conserved and exploited scientifically during the data reduction/simulation and analysis cascades. Yet, the same multi-dimensional datasets are systematically cropped, sliced and/or projected to printable two-dimensional (2-D) diagrams at the publication stage. \n\nIn this article, we introduce the concept of the \"X3D pathway\" as a mean of simplifying and easing the access to data visualization and publication via three-dimensional (3-D) diagrams. The X3D pathway exploits the facts that 1) the X3D 3-D file format lies at the center of a product tree that includes interactive HTML documents, 3-D printing, and high-end animations, and 2) all high-impact-factor & peer-reviewed journals in Astrophysics are now published (some exclusively) online. We argue that the X3D standard is an ideal vector for sharing multi-dimensional datasets, as it provides direct access to a range of different data visualization techniques, is fully-open source, and is a well defined ISO standard. \n\nUnlike other earlier propositions to publish multi-dimensional datasets via 3-D diagrams, the X3D pathway is not tied to specific software (prone to rapid and unexpected evolution), but instead compatible with a range of open-source software already in use by our community. The interactive HTML branch of the X3D pathway is also actively supported by leading peer-reviewed journals in the field of Astrophysics. Finally, this article provides interested readers with a detailed set of practical astrophysical examples designed to act as a stepping stone towards the implementation of the X3D pathway for any other dataset.\"\n\nQuestions, feedback,README remarks: frederic.vogt@alumni.anu.edu.au\n\nCopyright (C) 2015 Frederic P.A. Vogt, Chris I. Owen \n\nThese program files are free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published \nby the Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program.  If not, see <http://www.gnu.org/licenses/>.", 
  "read_at": 1462545939, 
  "description": "This repository contains practical examples illustrating the concept of the X3D pathway introduced in Vogt+, ApJ 818, 115 (2016)", 
  "id": 41403823
}