{
  "read_at": 1462545969, 
  "description": "Simulation of \"Entangled photons, nonlocality and Bell inequalities in the undergraduate laboratory\"", 
  "readme.md": "# Simulation of \"Entangled photons, nonlocality and Bell inequalities in the undergraduate laboratory\"\nThis experiment simulates the experiment done in:\nhttp://arxiv.org/pdf/quant-ph/0205171v1.pdf\n\nAuthor: Hannes Landeholm <hannes@jumpstarter.io>\n\nThe experiment is interesting because results in a bell inequality violation\nwhich proves that a local hidden variable explanation to QM is impossible\nunless you violate special relativity by introducing super luminal\ninformation transfer (which makes the HVT pointless as it's original\npurpose in the EPR paper was to remove an incompatibility between QM and SR).\n\n\"A 5 mW freerunning InGaN diode laser produces a beam of violet\n(405 nm) photons which pass through a blue filter, a linear polarizer,\nand a birefringent plate before reaching a pair of beta barium borate\n(BBO) crystals.\"\nThe crystals are placed face to face. Crystal #1 is rotated 0 degrees\nin relation to the polarization of the laser while the crystal #2 is\nrotated 90 degrees in respect to it.\nThe crystals allow the possibility of Type-I spontaneous parametric\ndown-conversion (SPCD). The reason why the photons are split are not\nunderstood at a fundamental level but irrelevant to the purpose of the\nexperiment. When SPCD occurs in one of the crystals the two resulting\nphotons will be emitted at a random angle in a \"cone trajectory\" where\neach photon has a relative 180 degree angle in respect to each other.\nThe emitted photons is ordinary polarized relative to the axis of the\ncrystal that generated them. The crystals are 0.1 mm thick and the beam\nitself is 1 mm thick. This makes the crystals thin enough that the\nresulting SPDC light cone from each crystal almost completely overlaps.\nThis erases the information of which crystal the SPDC originated from\n(the which-path information) making it impossible to know the polarization\nfrom measuring the photon position alone. Therefore the light cones are in a\nsuperposition of polarization states. We can find entangled photon pairs\nat any points around the cone, opposite of each other with correlating\npolarization.\n\nLicence: MPLv2\n", 
  "id": 41646974
}