{
  "read_at": 1462549029, 
  "description": "", 
  "README.md": "# EigenKernel\n\n## About\nEigenKernel is a package of hybrid parallel solvers for (standard / generalized) real-symmetric eigenvalue problems.\nHere 'hybrid solver' means combination of high-performance routines from the distributed parallel numerical linear algebra libraries, ScaLAPACK, ELPA and EigenExa. You can test various combination of routines from a unique interface and find the best one for your problem and machine environment.\n\nEigenKernel also works as a mini-application (stand alone eigenvalue problem solver), named EIgenBench. This note shows usage of EigenBench shortly.\n\nEigenBench requires input matrix data in [the MatrixMarket file format](http://math.nist.gov/MatrixMarket/). Sample data files are stored in the `matrix/` directory. These are part of [ELSES matrix library](http://www.elses.jp/matrix/).\n\n## Quick start\nYou can build EigenBench only with ScaLAPACK (without ELPA and EigenExa).\nTest following commands to solve a generalized eigenvalue problem with the matrix size of M = 30. The sample Makefile.in supposes there are mpif90 over gfortran as a fortran compiler and libgomp as an OpenMP library.\n\n    tar zxvf eigenkernel-*.tar.gz\n    cd eigenkernel-*\n    cp Makefile.in.gfortran.noext Makefile.in\n    make\n    mpirun -np 4 bin/eigbench -s general_scalapack matrix/ELSES_MATRIX_BNZ30_A.mtx matrix/ELSES_MATRIX_BNZ30_B.mtx\n\nAfter executing eigbench, there are output files named `eigenvalues.dat`, `ipratios.dat`, `log.json`. eigenvalues.dat and ipratios.dat contain computed eigenvalues and inversed participation ratios of computed eigenvectors respectively. log.json contains execution information such as given commandline options in the JSON format.\n\nIn the execution command `-s <solver>` is a mandatory option to specify the solver routine. The general_scalapack solver is, of course, a pure ScaLAPACK solver. The last two arguments are paths to input matrix files in the Matrix Market format. Note that the input matrices must be symmetric and moreover the latter one must be positive definite (only real-valued matrices are supported now).\n\nYou can also solve standard eigenvalue problems.\n\n    mpirun -np 4 bin/eigbench -s scalapack matrix/ELSES_MATRIX_VCNT400std_A.mtx\n\n\n## Link with ELPA and EigenExa\nYou must build and link ELPA and EigenExa to utilize full functions of EIgenBench. Follow installation instructions in each library.\n\n[ELPA official page](http://elpa.rzg.mpg.de/)\n\n[EigenExa official page](http://www.aics.riken.jp/labs/lpnctrt/EigenExa_e.html)\n\nAfter installing them, edit Makefile.in (sample found in Makefile.in.gfortran.withext) and set `LIBS` variable properly to indicate the paths where .a and .mod are installed.\nThen you should rebuild EigenBench with ELPA and EigenExa like below.\n\n    emacs Makefile.in  # Edit $LIBS properly\n    make clean\n    make WITH_EIGENEXA=1 WITH_ELPA=1\n\nIf the rebuild is succeeded, now you can select truly hybrid solvers in the `-s` option.\n\n    mpirun -np 4 bin/eigbench -s general_elpa_eigensx matrix/ELSES_MATRIX_VCNT900_A.mtx matrix/ELSES_MATRIX_VCNT900_B.mtx\n\nIn log.json (this default filename can be changed with `-l <filename>` option) you can find whole computation time in an element of the array `events` whose `name` is `main`. More detailed time consumption for each subprocedure is also reported. You can compare the solvers with these information.\n\n\n## Available solvers\nNames of available solvers are listed below. `general_scalapack` and `general_elpa_eigensx` are already used above. 'standard' solvers are for standard eigenvalue problems and take one matrix file for the last argument. 'generalized' solvers are for generalized ones and take two matrix files for the last arguments. The 'selecting' solvers can compute a part of eigenvectors. The number of computed eigenvectors can be specified with the `-n <num>` option.\n\n### pure ScaLAPACK solvers\n- scalapack (standard)  -- PDSYEVD\n- scalapack_select (standard, selecting) -- PDSYEVX\n- general_scalapack (generalized) -- reduction with PDPOTRF & PDSYGST\n- general_scalapack_select (generalized, selecting)\n- general_scalapacknew_eigens (generalized) -- reduction with PDPOTRF & PDSYNGST\n\n### solvers need ELPA\n- general_elpa_scalapack (generalized) -- reduction with ELPA, solve SEP with PDSYEVD\n- general_elpa1 (generalized)\n- general_elpa2 (generalized)\n\n### solvers need EigenExa\n- eigensx (standard)\n- general_scalapack_eigensx (generalized) -- reduction with PDPOTRF & PDSYGST, solve SEP with eigen_sx\n- general_scalapack_eigens (generalized) -- reduction with PDPOTRF & PDSYGST, solve SEP with eigen_s\n\n### solvers need both of ELPA and EigenExa\n- general_elpa_eigensx (generalized) -- reduction with ELPA, solve SEP with eigen_sx\n- general_elpa_eigens (generalized) -- reduction with ELPA, solve SEP with eigen_s\n\n\n## Useful commandline options (output eigenvectors, check accuracy, change default output filename)\nYou can see a help message for commandline options by `eigbench -h`.\n\n- `-n <num>`  This option can be used only with 'selecting' solvers. Compute only &lt;num&gt; eigenpairs in ascending order of their eigenvalues.\n- `-p <num1>,<num2>`  Specify index range of eigenvectors to be output. No eigenvectors are output in default. Eigenvectors are output from all the MPI processes evenly.\n- `-c <num>`  Calculate residual norm of eigenvectors whose index is from 1 to &lt;num&gt; (included). If num == -1, EigenBench calculates all the eigenvectors. No eigenvectors are checked in default.\n- `-t <num1>,<num2>`  Calculate orthogonality of eigenvectors whose index is from &lt;num1&gt; to &lt;num2&gt; (included). No eigenvectors are checked in default.\n- `-o <file>`  Set output file name for eigenvalues to &lt;file&gt;.\n- `-i <file>`  Set output file name for ipratios to &lt;file&gt;.\n- `-d <dir>`  Set output files directory for eigenvectors to &lt;dir&gt;.\n- `-l <file>`  Set output file name for elapse time log to &lt;file&gt;\n\n\n## Build with old versions of ELPA\nYou can build EigenBench with old versions of ELPA. For example, when you want to use elpa-2014.06.001, execute make as follows.\n\n    make WITH_EIGENEXA=1 WITH_ELPA=1 ELPA_VERSION=201406001\n\n\n## Reference\nH. Imachi and T. Hoshi, Hybrid Numerical Solvers for Massively Parallel Eigenvalue Computations and Their Benchmark with Electronic Structure Calculations, IPSJ Trans. ACS 52, accepted.\n\nPreprint: http://arxiv.org/abs/1504.06443\n\nIf you use the present software in an academic publication, please cite the above reference.\n\n\n## License\nThis software is released under the MIT License. See the file LICENSE.\n", 
  "id": 41723304
}