{
  "README": "libSU3\n======\n\nThis is a library for calculating the Clebsch-Gordan coefficients and isoscalar\nfactors for tensor products of representations of SU(3).\n\nThis library is based on the following two papers, which outline an algorithm\nfor computing the isoscalar factors:\n\n* H. Thomas Williams\n  SU3 Isoscalar Factors\n  J.Math.Phys. 37 (1996) 4187-4198\n  arXiv:hep-th/9509167\n\n* Thomas A. Kaeding, H. Thomas Williams\n  Program for Generating Tables of SU(3) Coupling Coefficients\n  Comput.Phys.Commun. 98 (1996) 398-414\n  arXiv:nucl-th/9511025\n\nThe library functions similarly to the program associated with\nKaeding and Williams. However, this library is only based on\nthe above two papers, and not on the original program.\n\nNote that we do not use the expression for the SU(2) Clebsch-Gordans\ngiven in Kaeding and Williams. Instead, we use the expression given\nin page 172 of:\n\n* Arno Bohm\n  Quantum Mechanics: Foundations and Applications, 3rd edition\n  Springer-Verlag (1993)\n  ISBN: 0-387-97944-1\n\nAcknowledgements\n----------------\n\nThis library was developed as an undergraduate research project at:\n\n  Department of Applied Mathematics and Theoretical Physics (DAMTP),\n  University of Cambridge,\n  Centre for Mathematical Sciences,\n  Wilberforce Road,\n  Cambridge CB3 0WA,\n  United Kingdom\n\nI would like to thank the High-Energy Physics group at DAMTP, for their\nhospitality during the development of this library. Particular thanks go to\nChristopher Thomas, for suggesting this library as a project and for\nproviding guidance throughout its development.\n\nThe development of this library was funded by the following sources:\n* Bridgwater Undergraduate Summer Research Programme,\n  Faculty of Mathematics,\n  University of Cambridge\n\n* Corpus Christi College,\n  Cambridge\n\nNote\n----\n\nThis code is licensed under the 3-clause BSD license and is distributed\nas source. However, any executables using this library must also be linked\nagainst GMP (use the linker options -lgmpxx -lgmp, in that order). This also\nmeans that these executables must be distributed in accordance with the GNU\nLGPL in addition to the terms of this library's license.\n\nFurther, if using the profiling version of this library (libSU3-prof.a),\nyou will probably want to also link against a profiling version of GMP\nin order to get better results - most of the actual work is done inside GMP.\n", 
  "read_at": 1462548933, 
  "description": "SU(3) Clebsch-Gordan Coefficients and Isoscalar Factors", 
  "id": 41763205
}