{
  "read_at": 1462548923, 
  "description": "A linking algorithm for particle tracking in n-dimensions, implementing a kinematic model and a memory feature to account for occasional misses.", 
  "README.md": "particle-tracking\n=================\n#### A linking algorithm for particle tracking in n-dimensions, implementing a kinematic model and a memory feature to account for occasional misses.\n \nMulti particle tracking is a common problem, often separated in two parts:\n\n1. Particle detection and localisation\n2. Linking these sets of positions in time-lapse sequences into trajectories.\n\nThe python code provided here implements an algorithm to address the second one; the matlab script accompanying Kelley and Ouellette (Am. J. Phys., 79(3):267, 2011) served as a starting point. \n\nAmong the modifications and features which have been introduced:\n+ implemented in Python and supports pandas DataFrame input and output\n+ generalised to n-dimensions\n+ the kinematic model, in which future positions are inferred from the already linked past positions, accounts for velocities and accelerations based on finite-differences\n+ a memory feature was added to account for the occasional loss of tracers, and it was optimised for better performance. \n\nThe algorithm implemented here accounts for the physical process of particles advected by a smooth chaotic flow and for the uncertainties. These arise from the chaotic in time nature of the flow - \"physical noise\" - as well as from localisation and past linking errors - \"experimental noise\".\n\n##### Related projects and publications:\n+ E. Afik and V. Steinberg. [Pair dispersion in a chaotic flow reveals the role of the memory of\ninitial velocity](http://arxiv.org/abs/1502.02818). _ArXiv e-prints arXiv:1502.02818_. submitted.\n+ E. Afik. [Robust and highly performant ring detection algorithm for 3d particle tracking using 2d microscope imaging](http://www.nature.com/articles/srep13584). Sci. Rep. 5, 13584; doi: 10.1038/srep13584 (2015)\n+ [ridge-directed-ring-detector](https://github.com/eldad-a/ridge-directed-ring-detector) -- a Cython implementation of the ring detection algorithm for 3d particle tracking\n+ [natural-cubic-smoothing-splines](https://github.com/eldad-a/natural-cubic-smoothing-splines)\n", 
  "id": 41799830
}