{
  "read_at": 1462549010, 
  "description": "", 
  "README.md": "# How-to-Resources\n\n\n**How to Make Articles in a Subscription Journal Open Access**\n\n** **\n\nYour supervisor or collaborators have decided to submit your manuscript to a subscription journal. You still have three options left to make a version of the work publicly accessible.\n\n**What You Can Do:**\n\n1. If the journal allows it, you can upload a preprint of your manuscript to a [preprint](http://en.wikipedia.org/wiki/Preprint) server, or (even better) do so before submitting your manuscript to the journal. \n\nSome preprint servers include:\n\n* [http://arxiv.org/](http://arxiv.org/) (for Mathematics, Physics, Astronomy, Computer Science, Quantitative Biology, Statistics, and Quantitative Finance)\n\n* [http://biorxiv.org/](http://biorxiv.org/) (for Biological & Biomedical Sciences)\n\n* [https://zenodo.org/](https://zenodo.org/) (for Science)\n\n* [http://www.ssrn.com/](http://www.ssrn.com/) (for Social Sciences)\n\n* [http://cogprints.org/](http://cogprints.org/) (for Cognitive Sciences)\n\n* [http://www.econstor.eu/](http://www.econstor.eu/) (for Economics)\n\n* [http://eprints.rclis.org/](http://eprints.rclis.org/) (for Library and Information Science)\n\n* [http://ageconsearch.umn.edu/](http://ageconsearch.umn.edu/) (for Applied Economics in Agriculture)\n\n* Your institutional repository (if you have one)\n\n2. Use the [SPARC Author Addendum](http://www.sparc.arl.org/resources/authors/addendum) to retain your rights as an author.\n\n* [Complete the addendum from the SPARC website](http://www.sparc.arl.org/resources/authors/addendum).\n\n* Note in a cover letter to your publisher that you have included an addendum to their agreement.\n\n* Wait for confirmation from publisher that they have accepted the addendum terms & conditions. (NOTE:  Be advised that this route is far from guaranteed to be successful. In some cases publishers will outright reject or not allow any attempt to modify their standard agreement terms and conditions. So be prepared to play 'hardball' and withdraw your publication if they don't agree to the addendum. Even if they do eventually agree to the addendum, the whole process can inadvertently slow-up the publication process and these delays may frustrate your co-authors. )\n\n3. Self-archive an author-formatted manuscript or [postprint](http://en.wikipedia.org/wiki/Postprint), subject to the restrictions imposed by your journal, in your institutional repository or subject repository. A surprisingly high number of publishers allow this, including Elsevier, Springer, and Wiley.\n\n* Many subscription journals will let you self-archive your publication, provided it is entirely the creation of you and your co-authors (not a typeset, publisher-provided version of your work). A listing of publisher/journal policies with respect to self-archiving is collated at the [SHERPA/RoMEO](http://www.sherpa.ac.uk/romeo/) website. \n\n\"Cutting Room Floor\"\n\n* It surprises many to learn that [Elsevier allows immediate posting (no embargo) of author accepted manuscripts](http://www.elsevier.com/about/open-access/open-access-policies/article-posting-policy#accepted-author-manuscript) (no typesetting or any other publisher-provided formatting) to institutional repositories. They are far from alone in allowing immediate self-archiving.\n\nOther advice:\n\n**Ideally** scope out journal options for OA or self-archiving BEFORE you start formatting your manuscript for submission.\n\nMany traditional journals will ask you to give them your copyright of your work (this isn't actually necessary for them to publish it, but many still insist), with a [Copyright Transfer Agreement](http://en.wikipedia.org/wiki/Copyright_transfer_agreement).\n\nList of journals that do not have either OA or self-archiving options that are compliant with Wellcome Trust funding policy [http://figshare.com/articles/List_of_journals_that_do_not_provide_a_publishing_option_compliant_with_the_Trust_s_OA_policy/1152691](http://figshare.com/articles/List_of_journals_that_do_not_provide_a_publishing_option_compliant_with_the_Trust_s_OA_policy/1152691)\n\n", 
  "id": 41799726
}