{
  "read_at": 1462548975, 
  "description": "This repository contains a study to extract and match features from real world sensor recordings to improve simulation models.", 
  "README.md": "# OpenDaVINCI - Experiment to study matching recordings from the real world with simulation data to extract matching feature sets\n\nThis example was realized with OpenDaVINCI and demonstrates how to use the\nframework in combination with the simulation environment to extract matching\nfeatures from real world sensor data recordings. The following instructions\nwere tested with Ubuntu 14.04 LTS; further information for other platforms or\nhow to build OpenDaVINCI are available here: http://opendavinci.readthedocs.org/en/latest.\n\nFurther background about this project is provided here: http://arxiv.org/abs/1406.7768\n\nThis project demonstrates how to design simulation studies with OpenDaVINCI.\n\n## How to build\n\nA simulation can be designed as a stand-alone application or embedded\ninto a unit test environment. This example demonstrates how to create\na CLI simulation using OpenDaVINCI and odSimulation; in addition, the\nsimulation is also embedded into a CxxTest test suite to be automatically\nexecuted using a ``make test`` command.\n\nInstall required libraries:\n\n    $ sudo apt-get install build-essential cmake git libcv-dev libhighgui-dev freeglut3 freeglut3-dev libboost-dev libopencv-photo-dev libopencv-contrib-dev \n\nInstall OpenDaVINCI according to the following instructions: http://opendavinci.readthedocs.org/en/latest/installation.pre-compiled.html#adding-opendavinci-to-your-ubuntu-linux-distribution\n\nInstall libautomotivedata and the OpenDaVINCI simulation environment:\n\n    $ sudo apt-get install libautomotivedata odsimulation-odsimlib odsimulation-odsimtools\n\nCreate a build folder within the source tree of your local working copy:\n\n    $ mkdir build\n\nChange to the build folder:\n\n    $ cd build\n\nCreate the build files:\n\n    $ cmake ..\n\nBuild the sources:\n\n    $ make\n\nRun the binary:\n\n    $ ./simulation-model-matching\n\n![Screenshot](https://github.com/se-research-studies/simulation-model-matching/blob/master/Screenshot.png)\n", 
  "id": 41934081
}