{
  "readme": "demFoam is the name of this project combining the LAMMPS and openFoam.\n\nLAMMPS is an open source molecular dynamics code that perform DEM simulations.\n\nOpenFOAM is an open source toolbox for CFD simulations.\n\nThe structure of the demFoam is like this:\n\ndemFoam\n|\n|----Allwclean.sh\n|----Allwmake.sh\n|----cases/\n|----documentation/\n|----interfaceToLammps/\n|----lammpsFoam/\n|----readme/\n\nAllwclean.sh are Allwmake.sh written to help with the compilation of lammpsFoam, the CFD--DEM solver\nin demFoam project. Allwmake.sh will help you install lammpsFoam while Allclean.sh will uninstall\nlammpsFoam. Note that the source file of LAMMPS is not included in demFoam. We recommend you use\nlammps-1Feb14.\n\nAll numerical cases are placed in cases/, with verification cases and validations cases.\n\nSome documents are in documentation/, with a basic user manual (userManual.tex).\n\ninterfaceToLammps/ and lammpsFoam/ are folders containing the source code of lammpsFoam. To compile\nlammpsFoam, the files of interfaceToLammps/ should be copied to LAMMPS-(some version)/src.\n", 
  "read_at": 1462548882, 
  "description": "CFD--DEM code for sediment transport", 
  "README.md": "SediFoam is a hybrid CFD--DEM solver for particle-laden flows based on two open-source codes: OpenFOAM, an object-oriented CFD platform by OpenCFD, and LAMMPS, a highly efficient molecular dynamics solver by Sandia National Laboratories. The algorithms used in this solver are published in H.Xiao and J.Sun (2010) and R.Sun and H.Xiao (2014a,b).\n\nR. Sun and H. Xiao. Diffusion-Based Coarse Graining in Hybrid Continuum-Discrete Solvers: Theoretical Formulation and A Priori Tests. International Journal of Multiphase Flow, 77, 142-157, 2015. DOI: 10.1016/j.ijmultiphaseflow.2015.08.014  Also available at arxiv:1409.0001\n\nR. Sun and H. Xiao. Diffusion-Based Coarse Graining in Hybrid Continuum-Discrete Solvers: Applications in CFD-DEM. International Journal of Multiphase Flow, 72, 233-247, 2015. DOI: 10.1016/j.ijmultiphaseflow.2015.02.014  Also available at arxiv:1409.0022\n\nH. Xiao and J. Sun. Algorithms in a robust hybrid CFD-DEM solver for particle-laden flows. Communications in Computational Physics, 9(2), 297-323, 2011. DOI: 10.4208/cicp.260509.230210a\n\nDeveloped by:\n\nRui Sun (sunrui@vt.edu)  2013-present\n\nHeng Xiao (hengxiao@vt.edu) 2008-present\n\nJin Sun (jsunia@gmail.com) 2008-2010\n", 
  "id": 41930305
}