{
  "read_at": 1462548967, 
  "description": "Background Oriented Schlieren for stratified liquid cases", 
  "README.md": "# Background Oriented Schlieren for stratified liquid cases\n\n\n### Background Oriented Schlieren\n\nFrom Wikipedia, the free encyclopedia\nBackground-oriented schlieren (BOS) is a novel technique for flow visualization of density gradients in fluids using the Gladstone-Dale relation between density and refractive index of the fluid.\n\nBOS simplifies the visualization process by eliminating the need for the use of expensive mirrors, lasers and knife-edges. In its simplest form, BOS makes use of simple background patterns of the form of a randomly generated dot-pattern, an inexpensive strobe light source and a high speed digital camera.\n\nIn its initial stages of implementation, it is mostly being used as a qualitative visualization method. Further research into developing the technique will enable quantitative visualization of fluid flows, in various applications including cryogenic flows, supersonic and hypersonic flows, biomedical device flow visualization etc.\n\nRead more on <https://en.wikipedia.org/wiki/Background-oriented_schlieren_technique>\n\n\n### What is so special about liquid cases \n\n\n\n### What is so special about stratified cases\n\n\n### Who wrote the software\n\nThe software is written mainly by Lilly Verso from Alex Liberzon's lab at Tel Aviv University, using \nOpenPIV package as a platform. The software utilizes the OpenPIV Matlab package for the cross-correlation analysis \n(essentially a stripped version of PIV analysis) and OpenPIV - pressure package for Poisson solver ideas. Additional \nPoisson solvers were tested, using public domain Matlab codes. The authors of these packages are gratefully acknowledged.\n\n### Dependencies\n\n1. OpenPIV-Matlab http://www.openpiv.net/openpiv-matlab/\n2. OpenPIV-Pressure http://www.openpiv.net/openpiv-pressure/\n3. IMWRAP - <https://github.com/animesh-garg/videoSeg/blob/master/src/classic_NL_Code/utils/imwarp.m>  under <https://github.com/animesh-garg/videoSeg> \n4. 2D Poisson equation - <http://www.mathworks.com/matlabcentral/fileexchange/38090-2d-poisson-equation/content/Poisson_equation_2D.m>\n\n\n### How to cite this work: \n\nVerso, L. and Liberzon, A. \"Background Oriented Schlieren in a Density Stratified Fluid\", <http://arxiv.org/abs/1506.08889>", 
  "id": 42018225
}