{
  "read_at": 1462510936, 
  "description": "test", 
  "README.md": "Afinn-for-Norsk\n===============\nI dette dokumentet leker jeg med afinn-ordlisten til Finn Arup Nielsen*\n malet var kort og enkelt: fungerer dette pa norsk?\n det jeg har gjort er lynraskt a la google oversette Finns liste til Norsk\n (som kjent fungerer det sann halvveis, men det er i alle fall et sted a starte, og det gikk fort)\n\n jeg har ikke testet dette pa annet en sma tekststrenger, og aner egentig ikke om det virker.\ndet er dodelig enkelt, og har MASSE svakheter, men, med de stor talls lov og en mer utforlig og presis ordliste..\nsa kan dette funke til noen formal ?\n\nEirik Stavelin, april 2012\n\n\n'* se\n- [Finn Arup Nielsens paper](http://www2.imm.dtu.dk/pubdb/views/publication_details.php?id=6010)\n- http://fnielsen.posterous.com/afinn-a-new-word-list-for-sentiment-analysis\n- http://fnielsen.posterous.com/tag/afinn\n\n\n## todo\n- ma la brukere legge til egne ord\n- tell, og gi bruker feedback pa framgang (Gamification?)\n\n## GUI\nAFINN listen min er automatisk oversatt av google, noe som ikke er optimalt.\nFor a la mennesker manuelt ga gjennom liten finnes er GUI pa http://stavelin.com/sentiment/\n\n.. og denne listen finnes tydligvis fra for, i en eller annen skuff, i folge: http://acl2014.org/acl2014/W14-26/pdf/W14-2616.pdf og i http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=7023584 finner jeg at de er her: https://github.com/aleksab/lexicon\n\n# Under finner du readme fra versjon av orginalprosjektet jeg fant ordlisten pa:\nAFINN is a list of English words rated for valence with an integer\nbetween minus five (negative) and plus five (positive). The words have\nbeen manually labeled by Finn Arup Nielsen in 2009-2011. The file\nis tab-separated. There are two versions:\n\nAFINN-111: Newest version with 2477 words and phrases.\n\nAFINN-96: 1468 unique words and phrases on 1480 lines. Note that there\nare 1480 lines, as some words are listed twice. The word list in not\nentirely in alphabetic ordering.  \n\nAn evaluation of the word list is available in:\n\nFinn Arup Nielsen, \"A new ANEW: Evaluation of a word list for\nsentiment analysis in microblogs\", http://arxiv.org/abs/1103.2903\n\nThe list was used in:\n\nLars Kai Hansen, Adam Arvidsson, Finn Arup Nielsen, Elanor Colleoni,\nMichael Etter, \"Good Friends, Bad News - Affect and Virality in\nTwitter\", The 2011 International Workshop on Social Computing,\nNetwork, and Services (SocialComNet 2011).\n\n\nThis database of words is copyright protected and distributed under\n\"Open Database License (ODbL) v1.0\"\nhttp://www.opendatacommons.org/licenses/odbl/1.0/ or a similar\ncopyleft license.\n\nSee comments on the word list here:\nhttp://fnielsen.posterous.com/old-anew-a-sentiment-about-sentiment-analysis\n\n\nIn Python the file may be read into a dictionary with:\n\n>>> afinn = dict(map(lambda (k,v): (k,int(v)),\n                     [ line.split('\\t') for line in open(\"AFINN-111.txt\") ]))\n>>> afinn[\"Good\".lower()]\n3\n>>> sum(map(lambda word: afinn.get(word, 0), \"Rainy day but still in a good mood\".lower().split()))\n2\n", 
  "id": 4215869
}