{
  "read_at": 1462510938, 
  "description": "Quantum Optics Maple Toolbox", 
  "README.md": "Quantavo\n========\n\nQuantum Optics Maple Toolbox\n\n\nThese are modules and worksheets for the Quantavo Toolbox, designed to ease certain calculations in Quantum Optics and Quantum Information. \nFor more details visit http://arxiv.org/abs/0806.2171\n\n\nInstallation\n============\n\n1) If you download the file \" Quantavo.mpl\" and save it as\n\n/my-directory/Quantavo.mpl\n\nThen open a Maple worksheet and execute,\n\n> read \"/my-directory/Quantavo.mpl\";\n> with(Quantavo);\n\nThat should display all the available procedures. That's it!\n\n\n2) If you download the file \" Quantavo.zip\", then Uncompress its content to a given directory,\n\n/my-directory/QUANTAVO\n\nopen a Maple worksheet and execute,\n\n> read \"/my-directory/QUANTAVO/Quantavo.mpl\";\n> with(Quantavo);\n\nYou may also execute the file \" Quantavo_Example_Worksheet.mw\" to find some examples.\n\n(for windows use double slash, > read \"C:\\\\my-directory\\\\QUANTAVO\\\\Quantavo.mpl\";)\n\nScreenshots\n===========\n\nDeclare States in the Fock basis and let them evolve with an arbitrary unitary transformation of the modes: \n![Example 1](https://github.com/alphydan/Quantavo/raw/master/screenshots/Quantavo.png)\n\nPlot and display density matrices and pure quantum states: \n![Example 2](https://github.com/alphydan/Quantavo/raw/master/screenshots/Quantavo_evolution2.png)\n\nEvaluate and plot the Negativity (Entanglement Measure) for different states: \n![Example 2](https://github.com/alphydan/Quantavo/raw/master/screenshots/Quantavo_negativity2.png)\n\n\n\n-----------------------------------------\nCopyright (c) 2008 Alvaro Feito Boirac.\nThis is the Module QUANTAVO, a toolbox for Quantum Optics calculations. that can be used in Maple(TM) (Waterloo Maple Inc.)\n\nThis module is released under the GNU General Public License v3 which can be obtained at GNU-GPL .\nPlease acknowledge its use if used to establish results for a published work. If you make any improvements of find any bugs the author will be thankful if you can let him know.\n\nDISCLAIMER: This Module is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY, without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. the work towards this Module has been done at Imperial College London with support from EPSRC grant EP/C546237/1 and by the Integrated Project Qubit Applications (QAP) supported by the IST directorate as Contract Number 015848.\n", 
  "id": 4221746
}