{
  "read_at": 1462548803, 
  "description": "HMF to find LRG LRG double z", 
  "README.md": "# HMF2.0\nHMF for outlier detection, i.e. to find LRG LRG double z\n\nCurrently data files too large. Waiting for Git Large File Storage to kick in. \n\n=====\n\nHMF outperforms PCA by modeling *measured uncertainties* within the data, providing a more accurate set of derived basis functions. Particularly useful for missing and low S/N data.\n\nDetails: HMF finds basis set and coefficients that minimize chi-squared, takes into account individual spectral pixel uncertainty variances and missing data. \n\nFormalism: there are K components g_{jk} and coefficients a_{ik}, over all the N spectra and the M pixels of the training set\n[N,K] coefficients a_{ik}\n[K,M] parameters g_{kj} in basis spectra\n[N,M] data\nwhere K is the manually set complexity parameter. \n\nFor succinct summary of HMF applied to search of massive BHBs in galxies and quasars, see Section 2 in the paper: http://arxiv.org/pdf/1106.1180.pdf\n\n=======\n\n##### Steps:\n1) Use a subset of data at rest-frame wavelengths as a training set to define the set of basis functions that minimize chi-squared\n\n2) Use the resulting set of components to fit each observed spectrum at the redshift provided by SDSS, z_SDSS\n\n3) Repeat the fitting using two sets of components at different redshifts, the first z_SDSS, the second free to vary over a broad range of z, corresponding to velocity differences up to 30 000 km s^-1\n\n========\n#####Why does PCA fall short? \n\nFrom Vaderplas, Connolly 2009; http://arxiv.org/pdf/0907.2238.pdf\n\n\"[PCA] cannot easily (nor compactly) express inherently non-linear relations within the data (such as dust\nobscuration or the variation in spectral line widths). Spectra that have a broad range in\nline-widths require a large number of eignespectra to capture their intrinsic variance which\noften results in the continuum emission and emission lines being treated independently\n(Gy\"ory et al. 2008).\" \n\n=======\nTheir limitation has been that they assume that\nthe spectral coverage and quality of the spectra are constant for all galaxies\nwithin a given sample\n\n=========\nFor other papers, see:\n\n-Blaton, Roweis 2007: arXiv:astro-ph/0606170\nUse NMF to generate template spectra from noisy and missing data\n\n-Bailey, 2012, arXiv:1208.4122\nImplement PCA with EM\n\n-Connolly, Szalay, 1999: astro-ph/9901300v1\n\n-Delchambre, 2014: arXiv:1412.4533v1\n", 
  "id": 42220742
}