{
  "id": 42337102, 
  "read_at": 1462548717, 
  "readme.md": "[SARAH](https://sarah.hepforge.org/) \n=========\n\n### Authors\n\n   F. Staub\n\n### References\n\n * [arXiv:0806.0538](http://arxiv.org/abs/0806.0538).\n * Version 4: [Comput. Phys. Commun. **185** (2014) 1773-1790](http://dx.doi.org/10.1016/j.cpc.2014.02.018) [[1309.7223](http://arxiv.org/abs/1309.7223)].\n * https://sarah.hepforge.org/\n", 
  "Readme.txt": "============================================\nSARAH\nby Florian Staub, 2012\n============================================\n\n1. Introduction\n----------------\nSARAH is a Mathematica package for building and analyzing supersymmetric models. SARAH just needs the gauge structure, particle content and superpotential to produce all information about the gauge eigenstates of a model. Breaking of gauge symmetries and mixings of particles can easily be added. Also the gauge fixing terms are automatically derived in R_Xi gauge, and the corresponding ghost interactions are calculated.\nIn addition, also analytical results for the 1- and 2-loop renormalization group equations for for the parameters of the superpotential, the gauge couplings and the soft breaking parameters can be calculated. Also functions for an automatic calculation for the 1-loop corrections to self energies and the tadpoles are included. In all calculations possible effects due to gauge kinetic mixing are included for models with several Abelian gauge groups.\nSARAH can write all information about the model in LaTeX, or create a model file for FeynArts and CalcHep/CompHep, which can also be used for dark matter studies using MicrOmegas, and in the UFO format which is supported by MadGraph 5. Also all necessary files to implement new models in WHIZARD and OMEGA can be generated.\nBeginning with version 3, SARAH is also the first available spectrum-generator-generator: based on the derived, analytical expression it creates source code for SPheno. In that way, it is possible to implement new models in SPheno without the need to write any Fortran code by hand.\nThe intention by the development of SARAH was to make it very flexible: there is a big freedom for the matter and gauge sector you can handle. The work with SARAH should be easy: every information SARAH needs are specified in an easy to modify model file. Nevertheless, SARAH is also fast: a existing model can be changed within minutes, and the needed time for doing all necessary calculations and writing a model file is normally less than 10 minutes. \n\n\n\n2. Download and installation\n----------------------------\nThe package can be downloaded from \n\n    http://http://sarah.hepforge.org/\n\nand should be extracted to the application directory of Mathematica. This directory is Linux\n    home/user/.Mathematica/Applications/\nand\n    Mathematica-Directory\\AddOns\\Applications\\\nin Windows. The package archive contains the following directories:\n  - Models: Definition of the different models\n  - Package: All package files.\n  - LaTeX: LaTeX packages, which might be needed for the output of SARAH\nDuring the work, also the directory\n    Output \nis created. It will contain all files written by SARAH. In addition, the root directory of SARAH contains a comprehensive manual (sarah.pdf), an overview of all models included in the package (models.pdf), this short introduction (Readme.txt) as well as an example for the evaluation of the MSSM (Example.nb). \n\n\n3. Evaluation and commands\n---------------------------\nAfter the installation, the package is loaded in Mathematica via\n     <<\"[DIRECTORY]/SARAH.m\"\nand a supersymmetric model is initialized by \n     Start[\"Modelname\"];\nHere, \"Modelname\" is the name of the corresponding model file, e.g. for the minimal supersymmetric standard model the command would read  \n     Start[\"MSSM\"];\n\n\nThe most important commands to work with SARAH are the following:\n - Vertex[Fields, Options]: Calculates a vertex for given fields\n - MassMatrices[States]: Shows all mass matrices for given eigenstates \"States\"\n - TadpoleEquations[States]: Shows all tadpole equations for given eigenstates \"States\"\n - MassMatrix[Field]: Shows the mass matrix of the field \"Field\"\n - TadpoleEquation[Field]: Shows the tadpole equation corresponding to the VEV \"VEV\"\n - CalcRGEs[Options]: Calculates the RGEs\n - CalcLoopCorrections[Options]: Calculates one-loop corrections for given eigenstates \"States\"\n - ModelOutput[States,Options]: Create output defined by options  for given eigenstates \"States\".\n - MakeVertexList[States,Options]: Calculates all vertices  for given eigenstates \"States\"\n - MakeTeX[Options]: Writes LaTeX files \n - MakeCHep[Options]: Writes CalcHep/CompHep model files\n - MakeFeynArts[Options]: Writes FeynArts model file \n - MakeUFO[Options]: Writes model files in UFO format\n - MakeSPheno[Options]: Writes source code for SPheno\n\n\"States\" can be 'EWSB' for the mass eigenstates after EWSB or 'GaugeES' for the gauge eigenstates. \"VEV\" is either 'vd' or 'vu' for the vacuum expectation values of the two Higgs doublets. \"Field\" can be 'Chi' for neutralino, 'Cha' for Charginos, 'hh' for scalar Higgs fields, 'Ah' for pseudo scalar Higgs fields as well as  'Se', 'Sd' or 'Su' for sleptons, down-squark and up-squarks, respectively.\n\n\n4. Models\n---------\nEach model is defined in SARAH in an own directory. Each directory should contain the three files:\n - Model.m: defines all necessary information about a model: gauge sector, particle content, superpotential, field rotations\n - parameters.m: gives additional information about the parameters involved in the model, e.g.  real/complex, symmetry assumptions, numerical value, position in LesHouches input file, dependences on other parameters or LaTeX name\n - particles.m: gives additional information about the particles of the model like R-parity, PDG code, mass, width, output name, LaTeX name\nIn addition, it is possible to include spectrum files in the model directory. These can be read using\n   ReadSpectrum[\"filename\"];\n\n\nThe following models are contained in the package:\n - MSSM: The minimal-supersymmetric standard models\n - MSSM/CPV: The MSSM with CP violation\n - MSSM/CKM: The MSSM in SCKM basis\n - MSSM/NoFV: The MSSM without flavor vioaltion\n - MSSM/HeavyGluino: The MSSM, in which the gluino has been integrated out\n - MSSM/RpV-Bi: The MSSM with bilinear R-parity violation\n - MSSM/RpV-LnV: The MSSM with R-parity violation: only lepton number violating terms\n - MSSM/RpV-TriLnV: The MSSM with R-parity violation: only trilinear, lepton number violating terms\n - MSSM/RpV-BnV: The MSSM with R-parity violation: only baryon number violating terms\n\n - NMSSM/One_Rotation: The next-to-minimal supersymmetric standard model with one rotation in the pseudo scalar sector\n - NMSSM/Two_Rotation: The NMSSM with two rotations in the pseudo scalar sector\n - NMSSM/CKM: The NMSSM in SCKM basis\n - NMSSM/CPV: The NMSSM with CP violation\n\n - near-MSSM: The near-to-minimak supersymmetric standard model\n\n - SMSSM: The singlet extended minimal supersymmetric standard model\n\n - UMSSM: The U(1)-extended minimal supersymmetric standard model\n\n - secluded-MSSM: Secluded U(1)-extended minimal supersymmetric standard model\n\n - munuSSM: The mu-nu-supersymmetric standard models\n \n - Omega: The left-right supersymmetric standard model with two gauge symmetry breaking scales\n - Omega_Short: The left-right supersymmetric standard model with one gauge symmetry breaking scales\n\n - Seesaw1: The MSSM with seesaw type I\n - Seesaw2: The MSSM with seesaw type II\n - Seesaw3: The MSSM with seesaw type III\n - inverse-Seesaw: MSSM with inserve seesaw\n - inverse-Seesaw-NMSSM: NMSSM with inverse seesaw\n - LinSeesaw: MSSM with linear Seesaw\n \n - B-L-SSM: minimal, supersymmetric model with U(1)_B-L x U(1)_Y gauge sector\n - N-B-L-SSM: singlet extenions of U(1)_B-L x U(1)_Y model\n - B-L-SSM-IS: B-L model with inverse seesaw\n - BLRinvSeesaw: minimal, supersymmetric model with U(1)_B-L x U(1)_R gauge sector and inverse seesaw\n\n - TMSSM: triplet extended MSSM\n - TNMSSM: triplet extended NMSSM\n\n\n", 
  "description": "[4.5.8] UNOFFICIAL repo of SARAH written by Staub."
}