{
  "README.markdown": "# OAI Harvester\nOAI Harvester with a web interface for configuration.\nCurrently available in German only.\n\nGeschrieben von Timo Schleier, [SUB Gottingen](http://www.sub.uni-goettingen.de) <timo.schleier@sub.uni.goettingen.de>\nAnderungen von Sven-S. Porst, [SUB Gottingen](http://www.sub.uni-goettingen.de) <porst@sub.uni-goettingen.de>\n\n\n## Einrichtung\nDer Harvester benotigt PHP 5.3, Zugang zu einer MySQL Datenbank und fur die Konfigurationsoberflache einen apache Webserver.\n\nZur Installation, diesen Ordner uber den Webserver zuganglich machen.\n\nZur Konfiguration einer Harvester-Instanz mit einer gegebenen <ID> folgende Schritte durchfuhren:\n\n1. Anlegen eines Ordners mit Namen <ID> im Ordner configuration. Dieser Ordner enthalt die Dateien:\n\n\t1. **db_connect.php** mit Zugangsdaten zur MySQL Datenbank, der Inhalt dieser Datei sollte folgendes Format haben:\n\n\t\t<?php\n\t\t\tdefine(\"DB_SERVER\",\t\t\"localhost\");\n\t\t\tdefine(\"DB_USERNAME\", \t\"harvest\");\n\t\t\tdefine(\"DB_PASSWORD\", \t\"\");\n\t\t\tdefine(\"DB_NAME\", \t\t\"harvest\");\n\t\t?>\n\n\t2. **settings.php** mit Einstellungen fur Pfade und den Solr Index. Der Inhalt dieser Date sollte folgendes Format haben:\n\n\t\t<?php\n\t\t\t// MySQL Verbindungsdaten\n\t\t\tinclude(dirname(__FILE__) . '/db_connect.php');\n\n\t\t\t// Allgemein\n\t\t\tdefine(\"SERVICE_NAME\", \t\t'math-arxiv');\n\t\t\tdefine(\"SOLR\",\t\t\t\t'http://localhost:8080/solr/math-arxiv');\n\t\t\tdefine(\"DATA_FOLDER\",\t\t'/var/www/htdocs/harvester/data/math-arxiv');\n\n\t\t\t// gemeinsam genutzte Einstellungen\n\t\t\tinclude(dirname(__FILE__) . '/../settings-common.php');\n\t\t?>\n\n2. Anlegen eines Ordners mit Namen <ID> im Hauptordner. Dieser Ordner enhalt:\n\n\t1. **.htaccess** mit dem Inhalt: `SetEnv HARVESTER_CONFIGURATION_NAME <ID>`\n\t2. **index.php**: Symlink auf ../software/index.php\n\t3. **resources**: Symlink auf ../software/resources\n\n3. Anlegen des MySQL-Datenbankschemas: Die Datei *configuration/harvester_schema.sql* enthalt das benotigte Schema fur die MySQL Datenbank. Es muss vor der ersten Nutzung dort eingespielt werden.\n4. Anlegen des Solr-Schemas: Die Datei *configuration/schema.xml* enthalt ein Solr Indexschema, das mit den ausgegebenen Feldern klarkommt. Es muss an der entsprechenden Stelle der Solr Konfiguration abgelegt werden.\n\n### Anmerkung\nDa zur Auswahl der Sets ein Formular mit sehr vielen Eingabeelementen abgeschickt wird, muss sichergestellt sein, dass die Konfiguration des Webservers diese Parameter nicht abschneidet, wenn sehr viele Sets vorhanden sind. Mit den Standardeinstellungen werden 1000 POST Parameter zugelassen, so dass die Bearbeitung von knapp 500 Sets funktioniert. Einige OAI Server enhalten wesentlich mehr Sets (z.B. uber 2000 auf http://hal.archives-ouvertes.fr/oai/oai.php), so dass hier die Konfiguration angepasst werden muss:\n\n* Ab PHP 5.3.9 begrenzt die Einstellung `max_input_vars` die Anzahl der Parameter (Voreinstellung vermutlich in /etc/php5/apache2/php.ini)\n* Ist Suhosin installiert, mussen die Werte `suhosin.request.max_vars` und `suhosin.post.max_vars` hochgesetzt werden (Voreinstellung vermutlich in /etc/php5/conf.d/suhosin.ini)\n* Die Anzahl der benotigten Parameter sollte mindestens 3 * Anzahl der Sets + 20 sein\n\n\n## Verwaltung der OAI Quellen\nDer Harvester bietet uber den Webserver eine Oberflache zur Verwaltung der geharvesteten OAI Quellen an. Sie zeigt die auf den OAI-Servern verfugbaren Sets and und ermoglicht eine Auswahl.\n\n\n## Harvesting und Indizieren\nZum Ausfuhren des eigentlichen Harvestings:\n\n1. die Umgebungsvariable `HARVESTER_CONFIGURATION_NAME` auf die <ID> der gewunschten Instanz setzen\n2. das Skript *software/scripts/harvester.php* ausfuhren\n3. das Skript *software/scripts/indexer.php* ausfuhren\n\nErfolgs- und Fehlermeldungen dieser Skripte sind in der Weboberflache einsehbar.\n\n\n## Interner Ablauf\nDie Software erfahrt uber die Umgebungsvariable `HARVESTER_CONFIGURATION_NAME` den Namen der gewunschten Konfiguration und ladt dementsprechend die Einstellungen fur Pfade und Datenbankzugriff. In der MySQL-Datenbank sind die bekannten OAI-Repositories, deren Sets und die ausgewahlten Sets gespeichert.\n\nDie geladenen Daten werden im Datenordner data/<ID>/ abgelegt. Dieser kann folgenden Unterordner haben:\n\n* **harvest**: hier werden von harvester.php die geladenen OAI Daten abgelegt\n* **temp**: enthalt kurzzeitig wahrend der Konversion von OAI zu Solr anfallende Daten\n* **archive**: enthalt zip-Dateien mit den geladenen OAI Daten und den daraus erstellten Solr-Dokumenten\n* **error**: enthalt Dateien mit den Fehlermeldungen, die bei den Durchlaufen von software/scripts/harvester.php und software/scripts/indexer.php aufgetreten sind\n\nDiese Ordner enthalten jeweils Unterordnerstrukturen mit dem akutellen Datum, der ID des OAI Servers und der ID des Sets. Zur leichteren Orientierung sind Dateien *source_data.txt* mit den dazugehorigen Namen abgelegt.\n\nDie Daten im Ordner archive konnen nutzlich sein, wenn die Indizierung verandert werden soll. In diesem Fall muss nicht das Harvesting erneut stattfinden, sondern es konnen die zip Dateien entpackt werden und der Inhalt ihrer *harvest* Unterordner kann in den *harvest* Ordner gelegt werden, um dann das Skript software/scripts/indexer.php erneut zu starten. Das Skript software/scripts/reindex.php fuhrt diese Schritte durch.\n\n", 
  "read_at": 1462510933, 
  "description": "OAI harvester with configuration web interface used at SUB Göttingen", 
  "id": 4270430
}