{
  "read_at": 1462548931, 
  "description": "Mirror of the dcnf-fcsp code: https://bitbucket.org/fayao/dcnf-fcsp", 
  "README.md": "# Depth from Single Monocular Images \r\n\r\n- This is the prediction/test code for the paper: \r\n\r\n`Learning Depth from Single Monocular Images Using Deep Convolutional Neural Fields`;\r\navailable at: [http://arxiv.org/abs/1502.07411](http://arxiv.org/abs/1502.07411).\r\n\r\n- This code is tested on Ubuntu 14.04, and requires Matlab 2014a, CUDA 6.5 or later versions.\r\n  Tested GPUs are NVIDIA Titan Black, K40c, GTX 780.\r\n\r\n- [Download this repository](https://bitbucket.org/fayao/dcnf-fcsp/get/f66628a4a991.zip) \r\n\r\n- If this code is useful for your research, please consider to cite our work:\r\n``` \r\n @article{Depth2015Liu,\r\n    author = {Fayao Liu and Chunhua Shen and Guosheng Lin  and Ian Reid},\r\n    title  = {Learning Depth from Single Monocular Images Using Deep Convolutional Neural Fields},\r\n    journal= {Technical report, University of Adelaide},\r\n    volume = {},\r\n    number = {},\r\n    year   = {2015},\r\n    url    = {http://arxiv.org/abs/1502.07411},\r\n    month  = {},\r\n    pages  = {},\r\n}\r\n```\r\n\r\n\r\n\r\n\r\n# Install\r\n\r\nTwo toolboxes are required for using this code. For convenience, they are included in the folder: \r\n\r\n`./libs` and pre-compiled in Linux. These toolboxes are as follows:\r\n\r\n1. MatConvNet is required for the CNN training, which can be downloaded at: http://www.vlfeat.org/matconvnet/\r\n\r\n2. VLFeat is required for generating superpixels, which is available at http://www.vlfeat.org/.\r\nThis code is tested using the VLFeat 0.9.18 version.\r\n\r\n\r\n\r\n# Run \r\n\r\n1. Users need to compile MatConvNet before running our code. \r\nPlease refer to: http://www.vlfeat.org/matconvnet/\r\n\r\n2. We provide a demo file in folder `./demo/`: \r\n \r\n     `demo_DCNF_FCSP_depths_prediction.m`\r\n     \r\n\t This is a demo for predicting depths of given images using our trained model. \r\n\r\n3. We provide two trained models (trained using the Make3D and NYUD2 datasets respectively) in the folder `./model_trained`. \r\n\r\n\r\n\r\n\r\n# Contact\r\n\r\nauthors: Fayao Liu, Chunhua Shen, Guosheng Lin, Ian Reid (University of Adelaide, Australia)\r\n\r\nemail: firstname.lastname@adelaide.edu.au\r\n\r\n\r\n# Copyright\r\n\r\nCopyright (c) The authors, 2015.\r\n\r\nThis program is free software: you can redistribute it and/or modify\r\n    it under the terms of the GNU General Public License as published by\r\n    the Free Software Foundation, either version 3 of the License, or\r\n    (at your option) any later version.\r\n\r\nThis program is distributed in the hope that it will be useful,\r\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\r\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\r\n    GNU General Public License for more details.\r\n\r\nYou should have received a copy of the GNU General Public License\r\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\r\n\r\n\r\nFor commercial applications, please contact Chunhua Shen <http://www.cs.adelaide.edu.au/~chhshen/>.\r\n\r\n03/2015", 
  "id": 43458774
}