{
  "read_at": 1462549050, 
  "description": "Market structure offering both good incentives for forecasters and unconstrained choices for decision makers", 
  "README.md": "# Adaptive Sequential Experiments and Counterfactual Markets\n\nstandard trial designs are not incentive compatible under openness: the non-transfers incentive compatibl policy is greedy, a lottery trivially moves us to epislon greedy. see http://www.sciencedirect.com/science/article/pii/019724569390028C\n\n\nIncentive structures offering good incentives for experts and unconstrained choices for decision makers.\n\n\n[![PDF Status](https://www.sharelatex.com/github/repos/nikete/two-sided-decision-markets/builds/latest/badge.svg)](https://www.sharelatex.com/github/repos/nikete/two-sided-decision-markets/builds/latest/output.pdf)\n\n#TODO\n- understand http://arxiv.org/pdf/1502.02362v2.pdf\n\n#Summary\nFor a market to provide good incentives to inform a deicsion maker of the counsequences of their actions, the decisions have to be scored using a unbiased counterfactual estimate over all actions traded.\nSupose not: then either void the market, leading to manipulation being miopically optimal (and just plain optimal for the last participant in the market) or you are using a biased estimator, which case to maximize the score the forecaster also wants to bias his estimate.\n\nThus a natural way to modify a prediction market to support decisionmaking is to score all markets with a unbiased estiamte of the outcome of that decision.\nIn the case of a single deicison maker and no ability to reference the outcomes of others, as in the models analized in Hanson, Othman and Chen,there is no possible counterfactual estimate, and thus an imposibility  to offer good incentives and make use of the information in the decision, due to a need to maintain fulll support. (this suggest is to extend the chen imposibility to not just the models they analize but any that dont make use of outside world, not for EC, but maybe thesis.)  If there are many decision makers participating in the mechanism instead of a single one, then a loterry  can be used to incentivize a small number of them to take a random action, providing a unbiased coutnerfactual estimate.\nEven under a single decision maker, or in situations when monetary transfers to incentivize a decision may be deemed unethical (as in the example with phrmaceiticals and their effects) there may be other sources of exogenous variation that can be used to estimate unbiased counterfactual estmates of the effects of takignother choices, by leveraging what happens to others and in what circumstances.\n\n## A simple, generic, counterfactual market using a loterry to generate unbiased counterfactual estimates with many decision makers.\nThe family of mechanisms for \"decision markets\" proposed in Hanson and analized in Othman&Sandholm, ChenEtAl consider a single decision makers and many forecasters:\n\n- Forecasters submit expected rewards under different actions by the decision maker\n- Decision maker chooses an action, forecasters rewarded using a proper scoring rule on this actions reward, markets for other actions voided.\n\nThis mechanism has a serious shortcomming in that it is not myopically incentive compatible for forecasters when the decision maker chooses his actions so as to obtain the highest forecasted reward every time. To provide proper incentives the decision makers chocie function must have full support, this may in practice be dificult to comit to.\n\nThe mechanism has the following structure:\n\n- Forecasters predict the reward of different decisions\n- Decision makers see the forecasters predictions and receive an offer for a payment conditonal on taking some action (this is randomized, so each agent faces different payments fo rdifferent actions)/\n- Decision makers choose their action and receive their reward\n- an IV estimate of the effect of the decision on the reward, using the randomized payment as a instrument is used to set the rewards to the forecasters (using a proper scoring rule) \n\nThis combines the good incentives for forecasters (since the aggregate of the deisions of the agents has full support) with alllowing the agents freedom to choose their own actions, by using a exogenous monetary incentive to create the full support over the action distribution.\n\n# M decisionmakers, N traders:\nThe \"event\"is a single joint choice over the M, and a vector valued reward.\n\neven throughone only directly cares about the rich choices, and thus wants to incentive for that, one also care about making that incentive compatibl, which means valua of the loterry will matter, so you can use the expectations conditional on actions for that, thus worth eliciting\n", 
  "id": 43465179
}