{
  "read_at": 1462556514, 
  "description": "This is a strongly simplified version of Judah's code for use it on supercomputers.", 
  "README.md": "# super-judah\nThis is a strongly simplified version of Judah's code for use it on supercomputers.\nSee also the page [Family Robotics - Deep Q-learning with Samu](http://shrek.unideb.hu/~nbatfai/)\n\nJudah will have been ported to the following platforms\n\n- OpenMP\n- Nvidia CUDA\n- Intel Xeon Phi coprocessor\n\n## Genealogy of Judah\n\n1. [Samu](https://github.com/nbatfai/samu)\nThe main purpose of this project is to allow the evaluation and verification of the results of the paper entitled \n**\"A disembodied developmental robotic agent called Samu Batfai\"**, [http://arxiv.org/abs/1511.02889](http://arxiv.org/abs/1511.02889). It is our hope that Samu will be the ancestor of developmental robotics chatter bots that will be able to chat in natural language like humans do.\n2. [Isaac](https://github.com/nbatfai/isaac)\n*\"The son of Samu is Isaac.\"* The project called Isaac is a case study of using deep Q learning with neural networks for predicting the next sentence of a conversation.\n3. [Jacob](https://github.com/nbatfai/jacob)\n*\"The son of Isaac is Jacob.\"* The project called Jacob is an experiment to replace Isaac's (GUI based) visual imagination with a character console. \n4. [Judah](https://github.com/nbatfai/judah)\n*\"The son of Jacob is Judah.\"* In the project called Judah we equip Jacob with a text-based user interface.\n5. [Super-Judah](https://github.com/nbatfai/super-judah)\n6. [Perez](https://github.com/nbatfai/perez)\n*\"The son of Judah is Perez.\"* The project called Perez allows to perform experiments to test several parameter settings. Here each experiment is implemented as a separate git branch.\n7. [Hezron](https://github.com/nbatfai/hezron)\n*\"The son of Perez is Hezron.\"* The project called Hezron gives the opportunity to experiment with different arrangements of SPO triplets in the visual imagery.\n8. [Ram](https://github.com/nbatfai/ram)\n*\"The son of Hezron is Ram.\"* The project called Ram allows to experiment with different deep Q learning algorithms to express feelings when he is talking.\n9. [Amminadab](https://github.com/nbatfai/amminadab)\n*\"The son of Ram is Amminadab.\"* In project called Amminadab we can significantly improve Samu's learning by using the Liv-Zempel-Welch dictionary tree to narrow the scope of selecting Q-actions.\n\n\n# Samu\nOne of the purpose of the original Samu project was only to allow the evaluation and verification of the results of the paper entitled \n**\"A disembodied developmental robotic agent called Samu Batfai\"**, [http://arxiv.org/abs/1511.02889](http://arxiv.org/abs/1511.02889). \nThis paper presents Q learning with neural networks approximators used by Samu. It is our hope and goal that Samu \nwill be the ancestor of developmental robotics chatter bots that will be able to talk and read in natural language like humans do.\nAt this moment Samu is the generic name of rapid prototypes that facilitate achieving this goal.\n\n## Highlights of Samu\n\nSamu\n\n1. directly implements the definition of machine consciousness (such as the definitions of conscious and intuitive computer programs) \nintroduced in the paper entitled [Conscious Machines and Consciousness Oriented Programming](http://arxiv.org/abs/1108.2865).\n2. corresponds the principles of Developmental Robotics, [Some Basic Principles of Developmental Robotics](http://ieeexplore.ieee.org/xpl/login.jsp?tp=&arnumber=5200465&url=http%3A%2F%2Fieeexplore.ieee.org%2Fiel5%2F4563672%2F5290358%2F05200465).\n3. applies Q learning with neural networks approximators\n4. uses multilayer perceptrons for approximation of the Q function, \nit is a deep Q learning feature, [Human-level control through deep reinforcement learning](http://www.nature.com/nature/journal/v518/n7540/full/nature14236.html)\n", 
  "id": 43521783
}