{
  "read_at": 1462556562, 
  "description": "", 
  "README.md": "# Strategies for support quasicones of affine Lie algebras of type A\n\n## How it works\n\nA full description of the theory behind this can be found at my thesis at http://arxiv.org/...\n\n**Steps**\n\n1. Compute the Quasicones below the bound, characterized by 'parameters.max'. The array being returned are iterator instances.\n2. Apply strategies to each of the quasicones and return the Weyl normal form of the result.\n3. The non-solved quasicones are saved in a file (pickled), list_of_exceptionals_r[rank]\n4. The more advance algorithm TreeMap is applied to these non-solved quasicones.\n5. Quasicones still not solved are returned in form of a file (pickled) called 'list_of_extraexceptionals'.\n6. The left-over cases can be solved by try and error with the help of 'Interactive_RootSteps.py' and your own intuition.\n\n- The pickled list of yet unsolved quasicones is printed in shape of a human readable TeX-file. Declare the output file or use the pattern from the run.sh script\n- also the stepwise solution is represented, when opting-in the TeX-output in the files list_of_*.py\n- For the MapTree-algorithm an illustration of the search tree can be produced, by means of the 'Tree_to_TikZ_Graph.py' script\n\n## Complexity\n\nImplementation is still only single threaded, thus multicore-processor can not provide performance boost, yet. Theoretical consideration on the complexity of the proplem is treated in Chapter 5 of the thesis.\n\n### Example\n\nif only run 'list_of_exceptionals'\n- with r = 3 and max = 3, then execution time (on 2.4 GHz machine) < 40 sec\n- with r = 4 and max = 4, then execution time (on 2.4 GHz machine) > 1:03 hs\n\nif only run 'Concatenate_Strategies'\n- with r = 4 and max = 4, then\nexecution time (on 2.4 GHz machine) > 4 hs\n\n\n## Modules of the package Quasicone and dependencies\n\n```\nQuasicone( json )\nQuasicone.Iterator( collections )\nQuasicone.Weyl_normal( numpy.array )\nQuasicone.Strategy( itertools )\nQuasicone.Apply_strategy( numpy, collections, json )\nConcatenate_Strategies( numpy, collections, json, pickle, Quasicone )\nlist_of_exceptionals( copy, numpy, math, pickle )\nTree_to_TikZ_Graph( latex-packages: tikz, tkz-berge, fp )\n\nparameters.json\n```\n", 
  "id": 43540183
}