{
  "read_at": 1462556063, 
  "description": "This is a suite to simulate the protocol for encoding qubits in oscillators proposed in arxiv/1506.05033", 
  "README.md": "# qubit-oscillator\nThis is a suite to simulate the protocol for encoding qubits in oscillators proposed in arxiv/1506.05033\n\nThe paper that most of this work is based on can be found here: http://arxiv.org/pdf/1506.05033v3.pdf\nOf special interest are Figs. 1,2,5,10 and 15. Sec 1C introduces the shift basis used for the analysis of code states.\nA brief explanation of the algorithms used for encoding can be found in sections 2b,c. Section 2e gives details on the analysis of states, including the analytic result for the wave-function in v-space, which is used in feedback.py .\nA brief derivation of arpe can be found in appendix C\n\n## Hirarchy\nThe hirarchy of modules is\nmisc.py\nfeedback.py (used to create fig 15 of the paper)\nstate_simulation.py\nprotocol.py\n\n## Current configuration\nTo simplify finding issues, the protocol currently simulates a perfect circuit, the functions for Hamiltonian evolution are not used.\n\n## Output if the files are called as main:\nthe most interesting tool for the analysis of multiple runs of the protocol is protocol.py\nIf called as main, it shows a plot of N_result columns, where N_result is the number of results analyzed. Feedback mode, measurement results etc. can be changed at the top of the file.\nEach column corresponds to one run of the protocol defined by a measurement result, all columns use the same feedback method.\nthere are 5 rows, from top to bottom:\nWigner function of the cavity state, Cavity state in Fock space (mostly there to check if it is chosen large enough), corrected analytic wave function (to show that the analytic results are self-consistent), uncorrected analytic wave function, simulated wave function.\n\nThe last two should be identical except at the edges of the plot, where the simulated wave function is underestimated (see doc of misc.py)\n\n## Note\nThe analytic wave function assumes a controlled-U gate in the circuit. This is not quite correct, as we actually use the gate U^-1/2 \\ket{0}\\bra{0} U^1/2 \\ket{1}\\bra{1}.\nThis leads to a single Pauli-X shift between the analytic and simulated wave-functions for each round. To correct for this, the analysis gives good results if the oscillator-qubit is encoded in either the state 0 or state 1. Most importantly, this does not lead to the current issues.\n", 
  "id": 44031996
}