{
  "read_at": 1462556006, 
  "description": "Experiment files for the paper \"Do Deep Neural Networks Learn Facial Action Units When Doing Expression Recognition?\", available here: http://arxiv.org/abs/1510.02969", 
  "README.md": "# Do Deep Neural Networks Learn Facial Action Units When Doing Expression Recognition?\nThis repository contains all of experiment files for the paper \"Do Deep Neural Networks Learn Facial Action Units When Doing Expression Recognition?\", available here: http://arxiv.org/abs/1510.02969\n\n![faus_frontpage](./faus_frontpage.png)\n\n## Abstract\nDespite being the appearance-based classifier of choice in recent years, relatively few works have examined how much convolutional neural networks (CNNs) can improve performance on accepted expression recognition benchmarks and, more importantly, examine what it is they actually learn. In this work, not only do we show that CNNs can achieve strong performance, but we also introduce an approach to decipher which portions of the face influence the CNN's predictions. First, we train a zero-bias CNN on facial expression data and achieve, to our knowledge, state-of-the-art performance on two expression recognition benchmarks: the extended Cohn-Kanade (CK+) dataset and the Toronto Face Dataset (TFD). We then qualitatively analyze the network by visualizing the spatial patterns that maximally excite different neurons in the convolutional layers and show how they resemble Facial Action Units (FAUs). Finally, we use the FAU labels provided in the CK+ dataset to verify that the FAUs observed in our filter visualizations indeed align with the subject's facial movements. \n\n### Bibtex\n```\n@article{khorrami2015deep,\n  title={Do Deep Neural Networks Learn Facial Action Units When Doing\n         Expression Recognition?},\n  author={Khorrami, Pooya and Paine, Tom Le and Huang, Thomas S},\n  journal={arXiv preprint arXiv:1510.02969},\n  year={2015}\n}\n```\n\n## About the repo\n\nThe experiments are broken up by dataset:\n\n+ ck_plus \n+ ck_plus_six_class\n+ tfd\n\nThe difference between ``ck_plus`` and ``ck_plus_six_class`` is the ``ck_plus_six_class`` folder evaluates our model's performance on the six basic emotions (anger, disgust, fear, happy, sad, surprise) while the ``ck_plus`` folder\ncontains the basic six along with neutral and contempt.\n\nThe ``README.md`` file in each folder will provide more information on how\nto run and evaluate the experiments.\n\n## Requisite Libraries\n\nIn order to run our experiments, you will need the following software:\n+ Python 2.7 (preferably the [anaconda][anaconda] distribution)\n+ [numpy] - a standard numerical computing library for python\n+ [anna] - our neural network library, which itself depends on [theano] and [pylearn2]\n+ [OpenCV] - common open source computer vision library (needed for face detection)\n+ [cudnn] - a GPU-accelerated library of primitives for deep neural networks\n\n\n[anaconda]:https://www.continuum.io/why-anaconda\n[numpy]:http://www.numpy.org/\n[anna]:https://github.com/ifp-uiuc/anna\n[theano]:http://deeplearning.net/software/theano/\n[pylearn2]:http://deeplearning.net/software/pylearn2/\n[OpenCV]:http://opencv.org/\n[cudnn]:https://developer.nvidia.com/cudnn\n\n", 
  "id": 44194531
}