{
  "read_at": 1462556609, 
  "description": "estimating the reproducibility of science", 
  "README.md": "# Estimating the probabilities of reproducibility, replication, and retraction in science\n\n\"When a scientist doesn't know the answer to a problem, he is ignorant. When he has a hunch as to what the result is, he is uncertain. And when he is pretty damn sure of what the result is going to be, he is still in some doubt. We have found it of paramount importance that in order to progress, we must recognize our ignorance and leave room for doubt. Scientific knowledge is a body of statements of varying degrees of certainty -- some most unsure, some nearly sure, but none absolutely certain.\"  - Richard Feyman\n\nAccross: Venues, Disciplines, Institutions, Authors, Papers, Specific Hypothesis in papers\n\n\n\nTraining:\nThe Yoshitaka Fujii covariate distribution: \"The analysis of 169 randomised controlled trials to test data\nintegrity\" by J. B. Carlisle http://www.anesth.or.jp/english/pdf/news20120629.pdf\nhttp://retractionwatch.com/category/diederik-stapel/\nWhat about the other dubious anesthesiologists?\n\nA psycholgoist, is there a study of his covaraite distribution? p-value distribution?\nhttp://retractionwatch.com/category/diederik-stapel/\n\n\nEvaluation: \nReproducibitility projects\nOSI pre-registered 1000 papers; the replication subset as the outcome?\n\n------\n\n\nhttps://replicationindex.wordpress.com\nseem to be heading in related direction too, but they sadlyt are not addressing rpelication but some ntoion of excess positive results\nsee the ciritique in http://metrics.stanford.edu/resources/metrics-pov/replicability-ranking-not-quite-there-yet\n\n\nExtreme semi-supervised scenario at the moment; \n59 reproductions in macroeconomics (replication in observational fields like macro undefined: forecast post publication?)\n100 replications in psychology (might be able to recover reproducibility for these 100 too), plus the mating motives replciation.\nAbout 1000 retractions from retraction watch. \nThe papers and their authors forma bipartite graph, assuming research practices spread via co-authorship networks it seems natural to build the features from these.\n\nFunel plots Romance, [Risk, and Replication: Can Consumer Choices and Risk-Taking Be Primed by Mating Motives?](http://www.ncbi.nlm.nih.gov/pubmed/26501730). \nGenerating these automatically and using them as a features (involves not only extracting p-values and sample sizes but also clustering studies together.)\n\nWe can also elicit these probabilities, and as new data come avaialble, weight the users by their forecasting ability. Further, open replication attempts can be started for the papers that active learning algorithms request labels for. \n\nThe Economics of Reproducibility in Preclinical Research\nhttp://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.1002165\n\nEstimating Reproducibility in Genome-Wide Association Studies\nhttp://arxiv.org/pdf/1508.06715v1.pdf\n\nExcess positive reuslts in depression reporting\nhttp://journals.cambridge.org/action/displayAbstract?fromPage=online&aid=9477510&fileId=S0033291714001421\n\nThe chemical literature data from http://www.pnas.org/content/early/2015/11/04/1509757112.full.pdf would be good for priors over that part of the network; might be able to then use it to learn features over text and authorship strucutres which carry over.\n", 
  "id": 44523065
}