{
  "id": 4461483, 
  "read_at": 1462509808, 
  "README.rst": "toy_fci\n=======\n\nFull Configuration Interaction (FCI) method for simple quantum systems.\nCurrently the uniform electron gas and a spinless lattice model are\nimplemented.\n\nThis is a particularly naive implementation in python: little attempt is made\nto conserve memory or CPU time.  Nevertheless, it is useful for small test\ncalculations, in particular for investigating ideas about the sign problem in\nthe Full Configuration Interaction Quantum Monte Carlo (FCIQMC) method\ndiscussed by Spencer, Blunt and Foulkes (J. Chem. Phys. 136, 054110 (2012);\narXiv:1110.5479).\n\nNote that no attempt is made to tackle finite size effects.\n\nRequires python 2.6 or later and numpy.  All code is compatible with python 3.\n\n``hamil.py``\n    Python module containing a base Hamiltonian class and generic functions\n    for performing finding excitations connecting pairs of many-particle basis\n    functions.\n``lattice_fci.py``\n    Python module containing classes and functions for performing FCI\n    calculations on spinless fermions hopping on a lattice with nearest\n    neighbour interactions using Slater determinants or Hartree products.\n``ueg_fci.py``\n    Python module containing classes and functions for performing FCI\n    calculations on the uniform electron gas using Slater determinants,\n    permanents or Hartree products.\n``lattice_propogation.py``\n    Example script using the lattice_fci module.\n``ueg_sign_problem.py``\n    Example script using the ueg_fci module.\n\nThe results from ``lattice_propogation.py`` and ``ueg_sign_problem.py`` are used in:\n\n| The effect of quantization on the full configuration interaction quantum Monte Carlo sign problem\n| M. H. Kolodrubetz, J. S. Spencer, B. K. Clark, and W. M.C. Foulkes\n| J. Chem. Phys. 138, 024110 (2013)\n| http://dx.doi.org/10.1063/1.4773819\n|\n| Preprint (identical to published version except minor formatting, free access):\n| arXiv:1209.3044 [physics.comp-ph]\n| http://arxiv.org/abs/1209.3044\n\nDocumentation\n-------------\n\nDocumentation can be found in the ``doc`` subdirectory and (mostly) in the\ndocstrings of the python source files.  Full HTML documentation can be viewed\nat `readthedocs <http://toy_fci.readthedocs.org>`_.\n\nAuthor\n------\n\nJames Spencer, Imperial College London.\n\nLicense\n-------\n\nModified BSD License; see LICENSE for more details.\n\nAcknowledgments\n---------------\n\nThe lattice model was proposed by Michael Kolodrubetz and Bryan Clark\n(Princeton), who showed that an FCIQMC calculation on this system in a Hartree\nproduct basis cannot be distinguished from one in a Slater determinant basis.\n", 
  "description": "Full Configuration Interaction method for the uniform electron gas"
}