{
  "README": "Chang Shi Shi Yong CNNShi Xian Shi Xian Yu Ce \nHui Zhu Bu Cong Jian Dan De Shen Jing Wang Luo Shi Xian Ru Shou ,Da Qi Zi Ji De CNNMo Xing . \n\n\nXiang Mu Jin Zhan Can Kao Wang Zhan :\n\nhttp://paulweihan.github.io\n\nShi Xian LeNet5 model00 done\nGai lenet5 model01-03 done\nGai googlenet model04,05 done\n\nmodel00 De Dao He [ CVPR 2015 ] Appearance-Based Gaze Estimation in the Wild Jin Si De Jie Guo \n\n\nZhu Yao Can Kao :\n    \n    1,Shen Du Xue Xi Jiao Cheng Wang Zhan De pythonDai Ma \n        http://deeplearning.net/tutorial/lenet.html#lenet\n        http://blog.csdn.net/u012162613/article/details/43225445\n        Ji Yu python theanoShi Xian De Jing Dian LeNetJie Gou ,Di Er Ge Lian Jie Dui Di Yi Ge Lian Jie Zhong Gei Chu De Dai Ma Jin Xing Liao Zhu Shi :\n        Dai Ma Lai Zi Yu Shen Du Xue Xi Jiao Cheng :Convolutional Neural Networks (LeNet) [Di Yi Ge Lian Jie ],Zhe Ge Dai Ma Shi Xian De Shi Yi Ge Jian Hua Liao De LeNet5,Ju Ti Ru Xia :\n        Mei You Shi Xian location-specific gain and bias parameters\n        Yong De Shi maxpooling,Er Bu Shi average_pooling\n        Fen Lei Qi Yong De Shi softmax,LeNet5Yong De Shi rbf\n        LeNet5Di Er Ceng Bing Bu Shi Quan Lian Jie De ,Ben Cheng Xu Shi Xian De Shi Quan Lian Jie \n        Ling Wai ,Dai Ma Li Jiang Juan Ji Ceng He Zi Cai Yong Ceng He Zai Yi Qi ,Ding Yi Wei \"LeNetConvPoolLayer\"(Juan Ji Cai Yang Ceng ),Zhe Hao Li Jie ,Yin Wei Ta Men Zong Shi Cheng Dui Chu Xian . Dan Shi You Ge Di Fang Xu Yao Zhu Yi ,Dai Ma Zhong Jiang Juan Ji Hou De Shu Chu Zhi Jie Zuo Wei Zi Cai Yang Ceng De Shu Ru ,Er Mei You Jia Pian Zhi bZai Tong Guo sigmoidHan Shu Jin Xing Ying She ,Ji Mei You Liao Xia Tu Zhong fxHou Mian De bxYi Ji sigmoidYing She ,Ye Ji Zhi Jie You fxDe Dao Cx. \n\n        Zui Hou ,Dai Ma Zhong Di Yi Ge Juan Ji Ceng Yong De Juan Ji He You 20Ge ,Di Er Ge Juan Ji Ceng Yong 50Ge ,Er Bu Shi Shang Mian Na Zhang LeNet5Tu Zhong Suo Shi De 6Ge He 16Ge . \n\n\n    2,Si Tan Fu De cs231nKe Cheng Wang Zhan :\n        http://cs231n.stanford.edu\n        http://cs231n.stanford.edu/syllabus.html\n\n * 3,Hacker's guide to Neural Networks\n        Li Jie BP,SVM,NNSuan Fa Ji Qi Shi Xian \n        http://karpathy.github.io/neuralnets/\n\n * 4,Unsupervised Feature Learning and Deep Learning\n        http://deeplearning.stanford.edu/wiki/index.php/UFLDL_Tutorial\n        Zhu :Zui Xin De Jiao Cheng Wang Zhi Shi :http://ufldl.stanford.edu/\n        Wu En Da /Andrew NgZhu Bian \n        Xue Zhi Qian Xian Kan :Ta De Ji Qi Xue Xi \n        http://openclassroom.stanford.edu/MainFolder/CoursePage.php?course=MachineLearning\n\n    5,Dai Ma Ji Yu githupDe Deep LearningDe toolbox\n        https://github.com/rasmusbergpalm/DeepLearnToolbox\n        http://blog.csdn.net/zouxy09/article/details/9993743/\n\n * 6,CaffeWang Zhan :\n        http://caffe.berkeleyvision.org\n\n        Jia Y, Shelhamer E, Donahue J, et al. Caffe: Convolutional Architecture for Fast Feature Embedding[J]. Eprint Arxiv, 2014.\n\n        http://www.csdn.net/article/2015-01-22/2823663\n\n        CUDA:https://developer.nvidia.com/cuda-downloads\n\n    7, Cai Niao Cong Ling Kai Shi Xue Xi Deep learning\n        http://blog.csdn.net/yihaizhiyan/article/category/2388401\n\n\n    Zhu Yao Lun Wen :\n    [ CVPR 2015 ] Appearance-Based Gaze Estimation in the Wild\n    [ CVPR 2014 ]  Learning-by-Synthesis for Appearance-based 3D Gaze Estimation\n\n    GoogLenet\n        Szegedy C, Liu W, Jia Y, et al. Going Deeper with Convolutions[J]. Eprint Arxiv, 2014.\n\n    DeepID-Net:\n        http://www.ee.cuhk.edu.hk/~wlouyang/projects/imagenetDeepId/index.html\n\n        Ouyang W, Luo P, Zeng X, et al. DeepID-Net: Deformable Deep Convolutional Neural Networks for Object Detection[C]. Computer Vision and Pattern Recognition (CVPR), 2015 IEEE Conference on. IEEE, 2015.\n\n        Ouyang W, Luo P, Zeng X, et al. DeepID-Net: multi-stage and deformable deep convolutional neural networks for object detection[J]. Eprint Arxiv, 2014.\n.       \n        Sun Y, Wang X, Tang X. Deep Learning Face Representation from Predicting 10,000 Classes[C]// Computer Vision and Pattern Recognition (CVPR), 2014 IEEE Conference on. IEEE, 2014:1891-1898.\n\n    RCNN:\n        https://github.com/rbgirshick/rcnn\n        bibtex\n        @inproceedings{girshick14CVPR,\n        Author = {Girshick, Ross and Donahue, Jeff and Darrell, Trevor and Malik, Jitendra},\n        Title = {Rich feature hierarchies for accurate object detection and semantic segmentation},\n        Booktitle = {Computer Vision and Pattern Recognition},\n        Year = {2014}\n        }\n\n    Jing Dian Lun Wen :\n            Notes on Convolutional Neural Networks\n            Gradient-Based Learning Applied to Document Recognition\nMy notes: paulweihan.github.io\n\n", 
  "read_at": 1462556547, 
  "description": "My repository for gaze estimation model based on CNN", 
  "id": 44724921
}