{
  "README": "----------------------------------------------------------------------\nFastJet\n-------\n\nThe FastJet package, written by Matteo Cacciari and Gavin Salam and\nGregory Soyez, provides a fast implementation of several\nlongitudinally invariant sequential recombination jet algorithms, in\nparticular the longitudinally invariant kt jet algorithm, the\ninclusive longitudinally invariant version of the Cambridge/Aachen\njet-algorithm, and the inclusive anti-kt algorithm.\n\nThe implementation is based on the geometrical methods described in\nM. Cacciari and G.P. Salam, Phys. Lett. B 641 (2006) 57\n[hep-ph/0512210]. The full FastJet manual is available as\ndoc/fastjet-doc.tex and also as arXiv:1111.6097.\n\nMeans are also provided for accessing external jet-algorithm software\nvia a common (plugin) interface and the package notably includes\nSISCone, an infrared safe seedless stable-cone type algorithm introduced\nin G.P. Salam and G. Soyez, JHEP 0705 (2007) 086 [arXiv:0704.0292].\n\nVarious tools are also provided related to jet areas and\nsubtraction. They can be used with any infrared safe jet algorithm,\nboth native and plugin. The ideas behind them are described in\nM. Cacciari, G.P. Salam, Phys.Lett.B 659 (2008) 119 [arXiv:0707.1378], and\nM. Cacciari, G.P. Salam and G. Soyez, JHEP 0804 (2008) 005 [arXiv:0802.1188]\n\nTools are also provided to facilitate jet substructure analyses.\n\n----------------------------------------------------------------------\nInstallation\n------------\nInstallation instructions are provided in the INSTALL file.\n\nNote that to benefit from NlnN implementation (relevant for a number\nof particles N greater than 15000 roughly) of the kt (and anti-kt) jet\nalgorithm , you will need to download CGAL from http://www.cgal.org/\nand compile it before compiling the FastJet library. The NlnN\nimplementation of the Cambridge/Aachen jet-algorithm is independent of\nCGAL.\n\nAutomatic documentation can be generated by running the doxygen command \n(if not installed on your system see www.doxygen.org) in the main \ndirectory. It will create the html/ and latex/ directories containing \ndetailed documentation of all classes etc.. More standard\ndocumentation is to be found in the doc/ directory. \n\n----------------------------------------------------------------------\nDirectory structure\n-------------------\n\ndoc/\t\t  Documentation\nsrc/\t\t  the .cc files for the FastJet library\ninclude/\t  the include (.hh) files for the FastJet library\nexample/          contains example programs (list them with \"ls -1 [0-9]*.cc\")\nexample/data/     contains files with data for example events\nexample/root/     an example root script to show jets as calorimeter towers\nplugins/          the various plugin jet algorithms\ntools/            location for a number of the tools (substructure, etc.)\nfortran_wrapper/  an illustration of how to use fastjet from fortran \n\n----------------------------------------------------------------------\nKnown bugs\n----------\n\nSee the BUGS file as well as the web page, http://fastjet.fr/ for\ninformation discovered subsequent to the release.\n\n", 
  "read_at": 1462556245, 
  "description": "import from fastjet.fr", 
  "id": 44743693
}