{
  "README": "Arcfile: Tools for working with low-level data from GCP\n\nThe arcfile package is a library for reading raw data from telescopes\nusing the Generic Control Program (GCP).  Examples are POLARBEAR,\nthe BICEP/Keck series of experiments and the South Pole Telescope\n(see Story et al., http://arxiv.org/abs/1210.4966).  GCP writes data\nin a frame-based file format known as an arc file (\"archive file\").\nThe arcfile package contains C code for efficiently reading compressed\nor uncompressed arc files; binary executables to export arc file\ndata to other formats; and interfaces to work with arc file data in\nMatlab, Octave, and Python.\n\nThis README applies to initial unversioned dump of the arcfile\npackage into Github.\n\nArc file support:\n---------------------\n\nThe arcfile code is known to work with arc files written by the\nBICEP series of experiments, BICEP1, BICEP2, the Keck Array, and\nBICEP3.  It has not been tested on arc files from other experiments.\nIt can read gzipped arc files directly.  There is some support for\nother compression types, although these are not currently well\nintegrated into the build system.\n\nPlatforms supported:\n---------------------\n\nThe arcfile package supports Linux and other Unix-like systems such\nas Mac OSX.  Building on Windows should be possible with MinGW, but\nthis has not been attempted.\n\nCommand-line utilities:\n---------------------\n\n* arc2txt: export to plain text\n* arc2dir: export to dirfile (http://getdata.sourceforge.net/dirfile.html)\n* dumparc: export to hex-encoded values (historical)\n* arcfile: export to multiple formats\n\nMatlab and Octave interfaces:\n--------------------\n\nThe C library is wrapped with a MEX function, readarc.  Rather than using\nthis directly, the M-file function load_arc should be used to load arc file\ndata into Matlab or Octave.\n\nPython interface:\n--------------------\n\nThe arcfile package provides the Python module arcfile, which can be used\nto load arc file data into Python (tested with 2.7) with numpy.\n\nDevelopment:\n--------------------\nThe code is hosted on GitHub at https://github.com/rwogburn/gcp-arcfile.\n", 
  "read_at": 1462556542, 
  "description": "Read telescope data in arcfile format as written by the Generic Control Program (GCP)", 
  "id": 45141690
}