{
  "read_at": 1462556553, 
  "description": "Robust Initialization Vector, a flexible and performant framework for robust authenticated encryption.", 
  "README.md": "# RIV\n\nRobust Initialization Vector, a flexible and performant framework for robust\nauthenticated encryption. \n\nThis repository contains two versions:\n- RIV with XOR-CTR using AES-128 and 128-bit CLHASH, and 128-bit tags.\n- RIV with CTRT using Deoxys-BC-128-128 and 256-bit CLHASH, and 256-bit tags.\n\nThe second is an experimental version. More information regarding RIV can be\nfound soon in the corresponding paper.\n\n## Usage\nEach version contains:\n- A reference version that should run and produce consistent results on\n  32-/64-bit as well as on little- or big-endian architectures.\n- An optimized version which employs AES new instructions (including aesenc for\n  Counter-mode AES and pclmulqdq for carry-less multiplications in CLHASH) for\n  benchmarking.\n- A utils directory with tests and benchmarks.\n- A Makefile for compilation.\n\n\tmake \n\t./all\n\t./ref-test\n\t./ni-test\n\t./ni-bench\n\t./clean\n\n## References\n### CLHASH\nRIV uses a Toeplitz-extended version of the fast universal hashing family\nCLHASH.\n\nDaniel Lemire and Owen Kaser, Faster 64-bit universal hashing using\ncarry-less multiplications, Journal of Cryptographic Engineering, 2015.\n- http://arxiv.org/abs/1503.03465 \n\nCode:\n- https://github.com/lemire/StronglyUniversalStringHashing\n\n### CTRT\nRIV-256 uses a version of the Counter-in-Tweak (CTRT) mode with the (AES-round-\nbased) Deoxys-BC-128-128 tweakable block cipher from the TWEAKEY framework. Our\nversion of CTRT differs in the fact that we employed XOR instead of modular\naddition to increment the tweak:\n\n\tT_i = T xor <ctr>\n\nWe reimplemented the Deoxys-BC-128-128 block cipher according to the optimized\nfirst-round CAESAR implementation of Deoxys that was contained in the SUPERCOP\nframework:\n- http://hyperelliptic.org/ebats/supercop-20141124.tar.bz2\n\nThomas Peyrin and Yannick Seurin: Counter-in-Tweak: Authenticated Encryption\nModes for Tweakable Block Ciphers, 2015. \n- https://eprint.iacr.org/2015/1049\n\n### Deoxys-BC\nJeremy Jean and Ivica Nikolic and Thomas Peyrin:  Tweaks and Keys for Block\nCiphers: the TWEAKEY Framework, ASIACRYPT 2014.\n- http://eprint.iacr.org/2014/831\n- http://www1.spms.ntu.edu.sg/~syllab/m/index.php/Deoxys\n\n## Disclaimer/License\nUse on your own risk. Our code may be susceptible to side-channel attacks. If\nyou reuse our code, a link to our repo would be nice. \n\nThe original CLHASH by Lemire and Kaser is under Apache License 2.0.\n\n", 
  "id": 45176674
}