{
  "read_at": 1462556621, 
  "description": "", 
  "README.md": "This is a test version of SISRS looking for bugs\n\nI do not own the rights to SISRS and all credit goes to Rachel Schwartz whos details can be found below\n\nSISRS\n=====\n\nSISRS: Site Identification from Short Read Sequences  \nVersion 1.6  \nCopyright (c) 2013-2015 Rachel Schwartz <Rachel.Schwartz@asu.edu>  \nhttps://github.com/rachelss/SISRS  \nMore information: http://arxiv.org/abs/1305.3665  \n\nTalk from Evolution 2014 describing SISRS and its application:  \nhttps://www.youtube.com/watch?v=0OMPuWc-J2E&list=UUq2cZF2DnfvIUVg4tyRH5Ng\n\nLicense\n=======\n\nThis program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful, but without any warranty; without even the implied warranty of merchantability or fitness for a particular purpose. See the GNU General Public License for more details.\n\nRequirements\n============\n\n* Velvet (including the perl script for merging paired reads) - http://www.ebi.ac.uk/~zerbino/velvet/\n* Bowtie2 - http://bowtie-bio.sourceforge.net/bowtie2/index.shtml\n* Python 2.7 and Biopython\n* Samtools (http://www.htslib.org/)\n* GNU Parallel (http://www.gnu.org/software/parallel/)\n\nInput\n=====\n\nNext-gen sequence data such as Illumina HiSeq reads.\nData must be sorted into folders by taxon (e.g. species or genus).\nPaired reads in fastq format must be specified by R1 and R2 in the (otherwise identical) filenames.\nThere should be no other R1 or R2 in the filename. If your file name is SRR287599_R2 you must change it to SRr287599_R2 or anything else you prefer.\nPaired and unpaired reads must have a fastq file extension.\n\nRunning SISRS\n=============\n\nUsage:\n\n sisrs command options\n\nBy default, SISRS assumes that\n\n * A reference genome is not available.\n * The K-mer size to be used by Velvet in contig assembly is 21.\n * Only one processor is available.\n * Files are in fastq format.\n * A site is only required to have data for two species to be included\n   in the final alignment.\n * Folders containing reads are in the present working directory.\n * A minimum of three reads are required to call the base at a site\n   for a taxon.\n\nCommands:\n\n * sites : produce an alignment of sites from raw reads\n * alignContigs : run sisrs skipping the composite genome assembly\n * mapContigs : run sisrs, also skipping alignment of reads to composite genome\n * identifyFixedSites : run sisrs, also skipping mapping of contigs to a reference\n * outputAlignment : get sisrs alignment from sites id'd for individual species\n * loci : produce a set of aligned loci based on the most variable regions of\n        the composite genome\n \nFlags:\n    \n * -g : MANDATORY if running sisrs from the beginning - the approximate genome size\n      - this will reduce the size of the composite assembly by using a subset\n      of reads to approximate 10x coverage\n * -p : use this number of processors\n * -r : the path to the reference genome in fasta format\n * -k : k-mer size (for assembly)\n * -f : the folder containing the folders of reads\n * -n : the number of reads required to call a base at a site\n * -t : the threshold for calling a site; e.g. 0.99 means that >99% of\n      bases for that taxon must be one allele; only recommended for\n      low ploidy with <3 individuals\n * -m : the number of species that are allowed to have missing data at\n      a site\n * -l : the number of alleles for sisrs loci\n * -a : change the assembler (specify Velvet or minia)\n\nOutput\n======\n\nNexus file with variable sites in a single alignment. Usable in most major phylogenetics software as a concatenated alignment with a setting for variable-sites-only.\n\nTest Data\n=========\n\nThe folder test_data contains simulated data for 10 species on the tree found in simtree.tre . Using 40 processors this run took 9 minutes. Analysis of the alignment output by sisrs using raxml produced the correct tree.\n\nSample commands\n==============\n\n1. Basic sisrs run: start with fastq files and produce an alignment of variable sites \n\n   sisrs sites -g 1745690\n\n2. Basic sisrs run with modifications\n\n   sisrs sites -g 1745690 -p 40 -m 4 -f test_data -t .99 -a minia\n \n2. Produce an alignment of loci based on the most variable loci in your basic sisrs run. Note - this command will run sisrs sites if (and only if) it was not run previously.\n\n   sisrs loci -g 1745690 -p 40 -l 2 -f .\n   \n3. Get loci from your fastq files given known loci.\n\n   first name your reference loci ref_genes.fa and put in your main folder\n   \n   sisrs loci -p 40 -f test_data\n", 
  "id": 45263602
}