{
  "read_at": 1462556067, 
  "description": "Code used in Spectra of Cayley Graphs of Complex Reflection Groups (B. Foster-Greenwood and C. Kriloff., arXiv 2015)", 
  "README.md": "# Spectra of Cayley Graphs of Complex Reflection Groups\nThis repository contains code used to compute eigenvalues of the adjacency, distance, and codimension matrices associated with the Cayley graph of a complex reflection group.  The code accompanies the following paper:\n\nB. Foster-Greenwood and C. Kriloff. *Spectra of Cayley graphs of complex reflection groups*. http://arxiv.org/abs/1502.07392.  Submitted, 2015.\n\n\n## Background\nLet G be a complex reflection group, and let T be the set of all reflections in G.  The left Cayley graph of G with respect to T has a vertex for each element of the group and an edge joining h to g if gh<sup>-1</sup> is a reflection.  Various matrices associated to the group and Cayley graph arise from a general construction:  Given a class function f on G, define a matrix with rows and columns indexed by the elements of G and (g,h)-entry the value f(gh<sup>-1</sup>).  \n\nSpecifically, the *adjacency matrix* of the Cayley graph arises by using the reflection indicator function \n```\ng -> 1 if g is a reflection and g -> 0 otherwise,\n``` \nthe *distance matrix* of the Cayley graph arises by using the absolute reflection length function \n```\ng -> min number of factors to express g as a product of reflections,\n``` \nand the *codimension matrix* (with respect to the reflection representation) arises from the codimension function \n```\ng -> codimension of the fixed point space of g.\n``` \n\nThe eigenvalues of the adjacency, distance, and codimension matrices can be calculated via a character theoretic formula, and if f is integer-valued and constant on rational conjugacy classes, then the eigenvalues are guaranteed to be integers.  (See the [article](http://arxiv.org/abs/1502.07392) for details and references.)\n\n## Running the code\n\nThe code in this repository is written for use in GAP 3 with the CHEVIE package.  The CHEVIE package contains functionality for working with complex reflection groups and has not yet been ported to GAP 4.  For more information, see [GAP](http://www.gap-system.org) and the [GAP3 distribution](http://webusers.imj-prg.fr/~jean.michel/gap3/) prepared by Jean Michel.\n\nThe purpose of the code in this repository is to calculate eigenvalues of the adjacency, distance, and codimension matrices via the character formula and to determine if absolute reflection length is constant on rational conjugacy classes.  The files \n```\nspectraprompt.gap\nconstantprompt.gap\n```\nprompt the user with how to call the relevant functions from the file\n```\nspectra.gap\n```\nfor the specific reflection groups of interest.\n", 
  "id": 45320415
}