{
  "read_at": 1462554750, 
  "description": "", 
  "readme.txt": "Code used in the paper \"Discriminative Unsupervised Feature Learning with Convolutional Neural Networks\", NIPS 2014\r\n\r\nCopyright (c) 2014 Alexey Dosovitskiy\r\n\r\n------------------------------\r\nTerms of use\r\n------------------------------\r\n\r\nThe code is provided for research purposes only. Any commercial\r\nuse is prohibited. If you are interested in a commercial use, please \r\ncontact the copyright holder. \r\n\r\nIf you used this program in your research work, you should cite the \r\nfollowing publication:\r\n\r\nAlexey Dosovitskiy, Jost Tobias Springenberg, Martin Riedmiller and Thomas Brox,\r\nDiscriminative Unsupervised Feature Learning with Convolutional Neural Networks,\r\nAdvances in Neural Information Processing Systems 27 (NIPS 2014).\r\n\r\nThe code is distributed WITHOUT ANY WARRANTY.\r\n\r\n------------------------------\r\nDependencies\r\n------------------------------\r\n\r\nFor network training and testing we used Caffe software ( http://arxiv.org/abs/1408.5093, http://caffe.berkeleyvision.org/ ), this is a must-have dependency.\r\n\r\nFor testing you'll also need liblinear ( http://www.csie.ntu.edu.tw/~cjlin/liblinear/ )\r\n\r\nFor Spatial Pyramid Pooling (when testing on Caltech-101) we used pooling code from Matthew Zeiler's Adaptive Deconvolutional Networks ( http://www.matthewzeiler.com/ ). This can also in principle be done using caffe or some matlab code.\r\n\r\n------------------------------\r\nDescription\r\n------------------------------\r\n\r\nWe provide code for creating the training data, training and testing of the networks; as well as network configuration files and pre-trained networks.\r\n\r\nFor training a network, see code/training/demo_train_net.sh ( after correcting some paths in the demo and in train_nn_pretrain.sh ). The script allows pretraining with a diferent number of classes, which we do not actually need any more.\r\n\r\nFor testing, see code/testing/demo_test_net.m (matlab), you also need to correct some paths and download some datasets.\r\n\r\nFor dataset creation, see code/make_data/augment_patches_distr.m .\r\n\r\nFor converting data from matlab to leveldb or lmdb, see code/training/demo_convert_data.sh ( after correcting some paths in convert_data.sh ). \r\n\r\nThe configuration files include 'template' files which should be used with train_nn_pretrain.sh script, and test.prototxt files which may be used for testing with a pretrained network. Some of the files are in 'old' format which was previously used by caffe.\r\n\r\n------------------------------\r\nBugs\r\n------------------------------\r\n\r\nPlease report any bugs to Alexey Dosovitskiy ( dosovits@cs.uni-freiburg.de )", 
  "id": 45476936
}