{
  "read_at": 1462554570, 
  "description": "Matlab codes for potential theoretic design of formulas for approximation of functions", 
  "README.md": "<H1>Matlab codes for potential theoretic design of formulas for approximation of functions</H1>\n\nThese are Matlab R2015a (8.5.0.197613) codes for potential theoretic design of formulas for approximation of functions in weighted Hardy spaces. These codes were used to yield the results of the numerical experiments in the article\n\n\"Potential theoretic approach to design of highly accurate formulas for function approximation in weighted Hardy spaces\" (<a href=\"http://arxiv.org/abs/1511.04530\">arXiv:1511.04530</a>),\n\nwhich was written by my collaborators and me. See this article for the technical details of the method.\n\nThe roles of the source files and their relationships are explained below.\n\n[Main program for the design of the proposed formulas]\n\n<ul>\n  <li> MAIN_opt_sample_wrt_N.m &middot;&middot;&middot; A program to generate the sampling points of the proposed formulas. The subroutines and the functions used in this program are listed below.\n  <ul>\n    <li> SUB_alpha.m &middot;&middot;&middot; A subroutine to obtain the approximate value of &alpha;<sup>*</sup><sub>N</sub> with the Newton method. </li>\n    <li> SUB_gen_opt_sample.m &middot;&middot;&middot; A subroutine to generate the sampling points with the Fourier transform. The following auxiliary programs are used. The first two are used to define some mathematical functions and the last one executes fractional FFT.</li>\n    <ul>\n      <li> SC.m </li>\n      <li> FLT.m </li>\n      <li> FFFT.m </li>\n    </ul>\n    <li> LogInvDE.m &middot;&middot;&middot; The logarithm of the inverse of the double-exponential weight.</li>\n  </ul>\n  </li>\n\n</ul>\n\n[Main program for the experiments of approximating functions by the proposed formulas]<br>\n(<a href=\"http://www.advanpix.com/documentation/users-manual/\">ADVANPIX Multiprecision Computing Toolbox</a> is used for mulpi-precision arithmetic)\n\n<ul>\n<li> MAIN_approx_comput.m &middot;&middot;&middot; A program to compute the errors of the approximation of functions by the proposed formula. The following subroutine is used. </li>\n  <ul>\n    <li> SUB_approx_Blaschke_MP.m &middot;&middot;&middot; A subroutine to compute the approximation of functions by the proposed formula with the sampling points generated by \"MAIN_opt_sample_wrt_N.m\".</li>\n\n  </ul>\n</ul>\n", 
  "id": 45774266
}