{
  "read_at": 1462554279, 
  "description": "an implementation of Z-Lin network.", 
  "README.md": "# zlinnet\nThis repo provides an implementation of Z-Lin network. It should reproduce the results on permutation invariant CIFAR-10 reported in the paper:\n - Zhouhan Lin, Roland Memisevic, Kishore Konda, [How far can we go without convolution: Improving fully-connected networks](http://arxiv.org/pdf/1511.02580v1.pdf), arXiv preprint arXiv:1511.02580 (2015).\n\n## Setup\n - Download dependency. First you need to download NeuroBricks. It is a super light framework we use in this repo, which is currently not coverring Recurrent Nets and not documented. There are far more mature and successful ones available, like [blocks](https://github.com/mila-udem/blocks) and [lasagne](https://github.com/Lasagne/Lasagne). Execute the following line to download the source:\n\n       git clone https://github.com/hantek/NeuroBricks.git\n\n - (Optional) In case anything changes in the future, checking out to the snapshot at the time when this repo is published should ensure everything working fine. It may still work without checking out to that snapshot, but just in case.\n\n       git checkout 191704feb5de67ab2815d5891dd633b9f2d04afb\n\n - Import the path you store NeuroBlocks to python's searching directory.\n\n - Specify the data path to wherever you store your CIFAR10 dataset. At line 56 on both .py scripts, modify the line to:\n\n       cifar10_data = CIFAR10(folderpath=\"/path/to/your/cifar-10-batches-py/folder\")\n\nNow you should be able to run the codes with no problem.\n\n## Permutation invariant CIFAR-10\n\nExecute the following commands in your terminal:\n\n       python expr_cifar10_ZLIN_normhid_nolinb_dropout.py\n\nIt should generate an accuracy around 69.62% in the end.\n\n## CIFAR-10 with deformations\n\nIt is basically the same model but with data augmentation. So it's a feed-forward, fully connected network. Type\n\n       python expr_cifar10_ZLIN_normhid_nolinb_dtagmt_dropout.py\n\nto execute. You can expect an 78.62% accuracy after training process finishes.\n\n\n", 
  "id": 45819668
}