{
  "read_at": 1462554764, 
  "README.org": "A cython / python implementation of the [[https://www.pik-potsdam.de/copan][COPAN]] Exploit model.\n\n* Model Descriptions\nThe COPAN:EXPLOIT model demonstrates conceptually that purely social-cultural effects are able to determine whether bio-physical resources collapse from over-use or not. Thereby it illustrates the co-evolution between a social and an ecological sub-system.\n\nThe model is based on an adaptive network on a random graph where the nodes harvest their private renewable resource with either a sustainable or non-sustainable strategy.  This represents two distinct social preferences: i) long-term sustainable yields and ii) short-term profit maximization. The resulting harvest rates are used to update the node's strategies through social preference interactions along the edges of the network, which follow two key principles: imitation and homophily. Note that the interactions among the nodes happens only at the social, cultural level and not through a common-pool resource, which is a widely examined case.\n\nThe agent with the lowest waiting time performs a social update. These waiting times are exponentially distributed with the characteristic social update time scale tau. During a social update one neighbor of the selected agent is chosen randomly. Only if both agents have different sustainable states an actual update is performed. With rewiring probability phi the selected agent cuts the link to the selected neighbor and establishes a link with an agent with the same sustainable state. With probability 1-phi the selected agent is likely to change its sustainable state if the harvest of the selected neighbor outperforms the agents own harvest.\n\nDetails: Use the source!\n\n* Implementation\n- [[file:cyexploit/exploit_core.pyx][exploit_core.py]] : The basic model is implemented in the [[http://cython.org/][cython]] language, combining easy python and fast c.\n- [[file:cyexploit/exploit_explore.py][exploit_explore]] : This derived class (shall) collect methods to explore the Exploit model interactively\n\n* Unittests\nWe are using the python testing framework [[http://pytest.org/latest/][pytest]] with [[https://pypi.python.org/pypi/pytest-pep8][pep8]] style guide and [[https://pypi.python.org/pypi/pytest-flakes][pyflakes]] error checking.\nPlease write corresponding unittests while developing and make sure that all test pass by executing\n\n: py.test\n\nin the root of the project tree.\n\n\n* Related Publications\n\n- Wiedermann, M, Donges, JF, Heitzig, J, Lucht, W, and Kurths, J (2015),\n  *Macroscopic description of complex adaptive networks co-evolving with dynamic node states*,\n  Physical Review E 91, 052801,\n  DOI: [[http://dx.doi.org/10.1103/PhysRevE.91.052801][10.1103/PhysRevE.91.052801]],\n  Preprint: [[http://arxiv.org/abs/1503.05914][arxiv:1503.05914]] [physics.soc-ph].\n* License\n=cyexploit= is [[file:LICENSE.txt][BSD-licensed]] (3 clause)\n", 
  "description": "cython / python implementation of the COPAN:Exploit model", 
  "id": 45836179
}