{
  "read_at": 1462554437, 
  "description": "Do you even science, bro? Using RNN's to predict scientific titles.", 
  "README.md": "# RNN Science titles\n\n#### A recurrent neural network with long short term memory to predict titles of scientific articles. Uses karpathy's [char-rnn](https://github.com/karpathy/char-rnn) as the base implementation. \n\n--------------------------------\n\nI used _every_ title from the [arXiv.org](http://arxiv.org/) to generate models of scientific papers. Each subtopic (over 160!) generated a unique model. \n\n## Presentation\n\nThere is a quick, five-minute [presentation](http://thoppe.github.io/RNN_science_titles/HnT_RNN_arXiv.html) on the project that was given at the DC's Hack && Tell.\n\n## Raw data\n\nThe titles used as input and the auto-generated titles can be found in the [/samples](/samples) directory.\n\n## Analysis\n\nSize matters. The most important takeaway is that the log of the raw character count has an almost perfect exponential decay to the quality of the model. From this, we can predict with high confidence the accuracy of a new data will be with this particular set of hyperparameters. Additionally we can see that there is a lower limit of about 0.75, which is independent of the size of the training set.\n\n![](figures/validation_vs_input.png)\n\n## Models\n\nDue to space contraints the models are not stored in this repo.\n\nYou can recreate these models by using the pre-wrangled input files in the sample directory with the following hyperparameters:\n\n     1024 RNN size\n     2 layers\n     30 max epochs\n     0.5 dropout\n     50 sequence length\n     0.002 learning rate\n     0.97 decay\n     50 batch size\n\n## Instructions\n\nPlace all journal titles, new line separated with extension `*.txt` in the [`raw_input`](/raw_input) directory.\n\nRun `python src/wrangle.py` to convert a limited character map (uses unidecode) and copies them into [`input`](/input) directory.\n\nUse `python build_run_script.py` to build scripts to run the torch commands.\n\n\n\n\n\n\n", 
  "id": 45940090
}