{
  "read_at": 1462554549, 
  "description": "", 
  "README.md": "#OpenCL Caffe\n\nThis is an OpenCL implementation of Caffe, a mainstream DNN framework (https://github.com/BVLC/caffe). It includes a largely complete Caffe feature set as of August 2015. The project is under active development to improve performance and add new features. Contributions from the community are welcome.\n\nOpenCL (https://en.wikipedia.org/wiki/OpenCL) is an open standard parallel programming language for heterogeneous platforms. OpenCL is supported by a variety of commercial chip manufacturers. \n\n#Branches\n We have three braches in this repo.\n \n -stable, the stable branch for users\n \n -dev, the developer branch, we encourage people to contribute on this branch\n \n -master, the original Caffe's master branch against which our code is syncrhonized.\n \n#Design features\n  -All Caffe layers ported to OpenCL\n\n  -Performance improvement by batched implementation for conv layer based on clBLAS\n\n  -The user can choose the optimal batch number depending on H/W properties, image size and minibatch size\n\n  -Supports OpenCL 2.0, 1.2\n  \n  -Implemented in C++ and OpenCL, maintaining the same interfaces as the original Caffe\n\n  -Users can directly run DNN models: AlexNet, VGG-16 and VGG-19\n\nNote: More features are planned in the near future. Currently this implementation has been verified and tuned on AMD devices (CPUs/GPUs/APUs). Compatibility across different chip manufacturers will be considered for future addition.\n\n#Performance\n\nWe intend to keep updating the latest performance as we make optimizations. Fury results are preliminary and are actively being improved.\n\n* Training speed (Model: AlexNet, minibatch size 128)\n\n| Platform | Speed (images per second) |\n|:--------:|:-------------------------:|\n|AMD W9100 & A10-7850k           | 255 |\n|AMD R9 Fury & A10-7850k         | 261 |\n|AMD R290X @1000MHz & A10-7850k  | 268 |\n|AMD S9150 @900MHz & Xeon E5-2640| 227 |\n\n\n* Recognition speed (Model: AlexNet, minibatch size 128)\n\n| Platform | Speed (images per second) |\n|:--------:|:-------------------------:|\n|AMD W9100 & A10-7850k           | 590 |\n|AMD R9 Fury & A10-7850k         | 699 |\n|AMD R290X @1000MHz & A10-7850k  | 606 |\n|AMD S9150 @900MHz & Xeon E5-2640| 452 |\n\n\n#Wiki\nFor more information on how to install, use or contribute to this code base, please visit our wiki page:\n https://github.com/amd/OpenCL-caffe/wiki\n\n#Contributors\nJunli Gu, Yibing Liu, Yuan Gao, Maohua Zhu\n\nWe thank Mauricio Breternitz, Hanjin Chu and Greg Stoner for their technical suggestions and support. \n\nIf you have any questions, please send an email to Junli.Gu@amd.com \n\n#Support needed\n As an open source project, we hope to maintain an open dynamics and sharing culture. We encourage the contribution and support from the community to improve it together.\n\n#License\nThe original Caffe is provided in the [BSD 2-Clause license](https://github.com/BVLC/caffe/blob/master/LICENSE) open source license. The OpenCL ports written by AMD is covered by AMD license. We encourage the contribution and support from external, your contribution will be covered either by BSD 2-Clause license or whichever your preferred license.\n\n# Original Caffe information\n## Caffe\n\nCaffe is a deep learning framework made with expression, speed, and modularity in mind.\nIt is developed by the Berkeley Vision and Learning Center ([BVLC](http://bvlc.eecs.berkeley.edu)) and community contributors.\n\nCheck out the [project site](http://caffe.berkeleyvision.org) for all the details like\n\n- [DIY Deep Learning for Vision with Caffe](https://docs.google.com/presentation/d/1UeKXVgRvvxg9OUdh_UiC5G71UMscNPlvArsWER41PsU/edit#slide=id.p)\n- [Tutorial Documentation](http://caffe.berkeleyvision.org/tutorial/)\n- [BVLC reference models](http://caffe.berkeleyvision.org/model_zoo.html) and the [community model zoo](https://github.com/BVLC/caffe/wiki/Model-Zoo)\n- [Installation instructions](http://caffe.berkeleyvision.org/installation.html)\n\nand step-by-step examples.\n\n[![Join the chat at https://gitter.im/BVLC/caffe](https://badges.gitter.im/Join%20Chat.svg)](https://gitter.im/BVLC/caffe?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=badge)\n\nPlease join the [caffe-users group](https://groups.google.com/forum/#!forum/caffe-users) or [gitter chat](https://gitter.im/BVLC/caffe) to ask questions and talk about methods and models.\nFramework development discussions and thorough bug reports are collected on [Issues](https://github.com/BVLC/caffe/issues).\n\nHappy brewing!\n\n## License and Citation\n\nCaffe is released under the [BSD 2-Clause license](https://github.com/BVLC/caffe/blob/master/LICENSE).\nThe BVLC reference models are released for unrestricted use.\n\nPlease cite Caffe in your publications if it helps your research:\n\n    @article{jia2014caffe,\n      Author = {Jia, Yangqing and Shelhamer, Evan and Donahue, Jeff and Karayev, Sergey and Long, Jonathan and Girshick, Ross and Guadarrama, Sergio and Darrell, Trevor},\n      Journal = {arXiv preprint arXiv:1408.5093},\n      Title = {Caffe: Convolutional Architecture for Fast Feature Embedding},\n      Year = {2014}\n    }\n", 
  "id": 46116508
}