{
  "read_at": 1462554473, 
  "description": "Code to simulate biases introduced by using different limb-darkening laws as explained in Espinoza & Jordán (2016)", 
  "README.md": "# ld-exosim\n\nThis repository stores codes to (1) select the optimal (i.e. best estimator in a MSE \nsense) limb-darkening law for a given transiting exoplanet lightcurve and (2) calculate \nthe limb-darkening induced biases on various exoplanet parameters. \n\nThe details of the codes are explained in Espinoza & Jordan (2016, MNRAS, in press.; \narXiv e-print: http://arxiv.org/abs/1601.05485). Source code of the paper (including \ngeneration of all figures): https://github.com/nespinoza/lds_which_law_2_use. \n\nDEPENDENCIES\n------------\n\nThis code makes use of three important libraries:\n\n    + The Bad-Ass Transit Model cAlculatioN (batman) package: http://astro.uchicago.edu/~kreidberg/batman/\n    + The latest version of the lmfit fitter (https://lmfit.github.io/lmfit-py/)\n    + The LDC3.py code wrote by David Kipping (https://github.com/davidkipping/LDC3)\n\nThis last code might be updated with time, but I have copied here the October 29th, 2015 version of it\nfor reference: be sure to use the latest version of D. Kipping's code!\n\nUSAGE\n------------\nThe usage of the code is simple, depending on what you want to do:\n\n1. **Do you want to know which law to use in a given application?**\n\n   You are looking for the `which_law_should_i_use.py` code. Simply modify \n   the parameters inside the code and let the simulations run. At the end, \n   the code will print out the Bias/Precision values for each law so you can \n   select the optimal one for your application.\n\n2. **You want to perform bias simulations for several transit parameters?**\n\n   Then you want to use the `run_ld_exosim.py` code. In the code just define \n   the parameters you woud like to explore and run it. The results will be \n   saved in a folder named \"results\" for your simulation, where the biases \n   for both fixed and free parameters will be stored. \n\nBoth codes make use of limb-darkening tables stored in the `ld_tables` folder, \nwhich already has a table containing all the limb-darkening coefficients using \nthe ATLAS models and the Kepler bandpass. To generate your own table, you can use \nour code at https://github.com/nespinoza/limb-darkening and put the result inside.\n\n", 
  "id": 46152904
}