{
  "read_at": 1462554731, 
  "description": "", 
  "README.md": "# Image Specificity\n\nThese scripts are intended to reproduce the results in the paper \"Image Specificity\".\n\n- [project webpage](http://jasmainak.github.io/specificity/)\n- [arXiV preprint](http://arxiv.org/abs/1502.04569)\n- [dataset browser](https://computing.ece.vt.edu/~mainak/specificity-dataset-browser/)\n- [demo](http://godel.ece.vt.edu/image_specificity)\n- [pretrained imagenet model](https://copy.com/L7Kvh1R3IGyuSb4k)\n\n## Citation\n\nPlease cite the following publication if you use this code in your research:\n\n\t@inproceedings{jas2015specificity,\n\tAuthor = {Mainak Jas and Devi Parikh},\n\tTitle = {{Image Specificity}},\n\tYear = {2015},\n\tbooktitle = {{IEEE Conference on Computer Vision and Pattern Recognition (CVPR)}}\n\t}\n\n## License\n\nRedistribution and reuse is allowed under the simplified BSD license.\n\n```\nCopyright (c) 2015, Mainak Jas\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this\nlist of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice,\nthis list of conditions and the following disclaimer in the documentation and/or other\nmaterials provided with the distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY\nEXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL\nTHE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;\nOR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER\nIN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING\nIN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGE.\n```\n", 
  "id": 46301111
}