{
  "read_at": 1462554169, 
  "description": "Generative image model with learned similarity measures", 
  "README.md": "## Autoencoding beyond pixels using a learned similarity measure\n\n*[Anders Boesen Lindbo Larsen](https://github.com/andersbll)*, *[Soren Kaae Sonderby](https://github.com/skaae)*, *[Hugo Larochelle](http://www.dmi.usherb.ca/~larocheh)*, *[Ole Winther](http://cogsys.imm.dtu.dk/staff/winther)*\n\nImplementation of the method described in our [Arxiv paper](http://arxiv.org/abs/1512.09300).\n\n\n### Abstract\nWe present an autoencoder that leverages learned representations to better measure similarities in data space.\nBy combining a variational autoencoder with a generative adversarial network we can use learned feature representations in the GAN discriminator as basis for the VAE reconstruction objective.\nThereby, we replace element-wise errors with feature-wise errors to better capture the data distribution while offering invariance towards e.g. translation.\nWe apply our method to images of faces and show that it outperforms VAEs with element-wise similarity measures in terms of visual fidelity.\nMoreover, we show that the method learns an embedding in which high-level abstract visual features (e.g. wearing glasses) can be modified using simple arithmetic.\n\n\n### Getting started\nWe have tried automatizing everything from data fetching to generating pretty images.\nThis means that you can get started in two steps:\n\n 1. Install [CUDArray](https://github.com/andersbll/cudarray) and [DeepPy](https://github.com/andersbll/deeppy).\n 2. Run `python celeba_aegan.py`.\n\nYou can also try out the other scripts if you want to experiment with different models/datasets.\n\n\n### Examples\nComing soon ...\n\n\n### Implementation references\nWe wish to thank the authors of the following projects for inspiration.\nOur method would never have gotten off the ground without the insights gained from inspecting their code.\n - [The Eyescream Project](https://github.com/facebook/eyescream).\n - [Unsupervised Representation Learning with Deep Convolutional Generative Adversarial Networks](https://github.com/Newmu/dcgan_code).\n - Joost van Amersfoort's VAE implementations ([Theano](https://github.com/y0ast/Variational-Autoencoder) and [Torch](https://github.com/y0ast/VAE-Torch)).\n - [Ian Goodfellow's GAN implementation](https://github.com/goodfeli/adversarial).\n - [Parmesan](https://github.com/casperkaae/parmesan)\n", 
  "id": 46422467
}