{
  "read_at": 1462554455, 
  "description": "Course page for the UVA \"Random Matrices\" course in Spring 2016", 
  "README.md": "## MATH 8380 Random Matrices - Syllabus\n##### Spring 2016. Department of Mathematics, University of Virginia\n\n**Instructor.** Leonid Petrov (lenia.petrov@gmail.com, petrov@virginia.edu), [http://faculty.virginia.edu/petrov/](http://faculty.virginia.edu/petrov/)\n\nThe class meets on Mondays and Wednesdays, 2:00-3:15PM in Kerchof 317. Office hours are on Mondays, 3:30-4:30PM, and Wednesdays, 11:00AM-12:00PM, or by appointment. Office is Kerchof 209.\n\n**Description.** Study of random matrices is an exciting topic with first major advances in the mid-20th century in connection with statistical (quantum) physics. Since then it found numerous connections to algebra, geometry, combinatorics, as well as to the core of the probability theory. The applications are also numerous: e.g., statistics, number theory, engineering, neuroscience; with more of them discovered every month. The course will discuss fundamental problems and results of Random Matrix Theory, and their connections to tools of algebra and combinatorics.\n\n**Course homepage.** This GitHub repository will contain syllabus and lecture notes for the course. They will be continuously updated.\n\n**Structure.** The course covers 5 main themes:\n\n1. Limit shape results for random matrices (such as Wigner's Semicircle Law). Connections to Free Probability.\n2. Concrete ensembles of random matrices (GUE, circular, and Beta ensembles). Bulk and edge asymptotics via exact computations. Connection to determinantal point processes.\n3. Dyson's Brownian Motion and related stochastic calculus.\n4. Universality of random matrix asymptotics.\n5. (optional, depending on time available) Discrete analogues of random matrix models: random permutations, random tilings, interacting particle systems.\n\n**References.** There are three main textbooks which will be used in the course. It is not required to buy any of them to successfully participate in the course.\n\n1. Mehta, M.L. *\"Random Matrices\"*.\n2. Anderson, G.W., Guionnet, A. and Zeitouni, O. *\"An Introduction to Random Matrices\"*.\n3. Pastur, L. and Shcherbina, M. *\"Eigenvalue Distribution of Large Random Matrices\"*.\n4. Tao, T. *\"Topics in random matrix theory\"*.\n\n**Grading.** To receive grade, each student enrolled in the course is expected to take part in typing up the lecture notes ([notes on TeXing](https://github.com/lenis2000/RMT_Spring_2016/blob/master/TeXing.md)), and make at least one 30-minute presentation on a reading assignment or on student's own research. The presentations will be mainly scheduled in the end of February and in the end of the semester. \n\nPossible reading + talk assignments (please first discuss your choice with me!):\n\n1. [taken] Combinatorics of Catalan Numbers\n2. [taken] Free probability and von Neumann algebras and factors\n2. Persi Diaconis, Peter J. Forrester \"A. Hurwitz and the origins of random matrix theory in mathematics\" [http://arxiv.org/abs/1512.09229](http://arxiv.org/abs/1512.09229): the goal is to figure out and report on one of the computations of the volume of the group O(N) or U(N), and also enjoy the related historical background\n3. Statistics of elliptic curves and free probability (some references are in section 1.6 in [http://arxiv.org/abs/1205.2097](http://arxiv.org/abs/1205.2097))\n4. Examples of determinantal point processes - in particular, uniform spanning trees - a starting point can be section 8 in the survey [http://arxiv.org/abs/0911.1153](http://arxiv.org/abs/0911.1153)\n5. [taken] Tridiagonalization of Gaussian unitary matrices\n6. [taken] Hermite polynomials and orthogonal polynomials in general\n7. [taken] Steepest descent method\n8. Something that you can suggest :)\n\n-----\n\n<sub>**Required official statement.** All students with special needs requiring accommodations should present the appropriate paperwork from the Student Disability Access Center (SDAC). It is the student's responsibility to present this paperwork in a timely fashion and follow up with the instructor about the accommodations being offered. Accommodations for test-taking (e.g., extended time) should be arranged at least 5 business days before an exam.</sub>\n", 
  "id": 46484925
}