{
  "id": 46704128, 
  "read_at": 1462554737, 
  "README.rst": "technologyspace\n====\nThis is the code accompanying the paper:\nJeff Alstott, Giorgio Triulzi, Bowen Yan, Jianxi Luo. (2016). \"Mapping Technology Space by Normalizing Technology Relatedness Networks.\" Available at `arXiv:1509.07285 [physics.soc-ph]`__\n\n__ http://arxiv.org/abs/1509.07285\n\nHow to Use\n====\nThe code base is organized as a set of `IPython notebooks`__, which are also duplicated as simple Python ``.py`` script files. The only thing you should need to touch directly is the notebook `Manuscript_Code`__ , which walks through all the steps of:\n\n1. organizing the raw empirical data\n2. creating technology relatedness networks from the empirical data\n3. creating randomized versions of the data and calculating technology relatedness networks from it.\n4. comparing the empirical and randomized versions of the networks\n5. creating figures for the `manuscript`__, the source code for which is also contained in this repository.\n\n__ http://ipython.org/notebook.html\n__ https://github.com/jeffalstott/technologyspace/blob/master/src/Manuscript_Code.ipynb\n__ http://arxiv.org/abs/1509.07285\n\nThe raw data files we use are too large to host on Github (>100MB), and we are figuring out an external place to host them. Once this is done, the `Manuscript_Code` notebook will automatically download the raw data before processing it.\n\n[More details forthcoming].\n\nRandomization with a cluster\n====\nThis pipeline involves creating thousands of randomized versions of the historical patent data. In order to do this, we employ a computational cluster running the `PBS`__ job scheduling system. Running this code currently assumes you have one of those. If you are lucky enough to be from the future, maybe you have a big enough machine that you can simply create and analyze thousands of randomized versions of the historical patent data using a simple ``for`` loop. We don't yet support that.\n\n__ https://en.wikipedia.org/wiki/Portable_Batch_System\n\n\nDependencies\n====\n- Python 3.x\n- `powerlaw`__\n- `seaborn`__\n- `pyBiRewire`__\n- the standard scientific computing Python stack, which we recommend setting up by simply using the `Anaconda Python distributon`__. Relevant packages include:\n- - numpy\n- - scipy\n- - matplotlib\n\n__ https://github.com/jeffalstott/powerlaw\n__ http://stanford.edu/~mwaskom/software/seaborn/\n__ https://github.com/andreagobbi/pyBiRewire\n__ http://docs.continuum.io/anaconda/index\n\nOriginal Data Files\n====\n- citing_cited.csv\n- PATENT_US_CLASS_SUBCLASSES_1975_2011.csv\n- pid_issdate_ipc.csv\n- disamb_data_ipc_citations_2.csv\n- pnts_multiple_ipcs_76_06_valid_ipc.csv\n- patent_ipc_1976_2010.csv\n", 
  "description": "Code accompanying paper \"Mapping Technology Space by Normalizing Technology Relatedness Networks.\""
}