{
  "read_at": 1462554138, 
  "description": "Deep Convolutional Generative Adversarial Networks", 
  "README.md": "# Unsupervised Representation Learning with Deep Convolutional Generative Adversarial Networks\n## [Alec Radford]((https://github.com/newmu)), [Luke Metz](https://github.com/lukemetz), [Soumith Chintala](https://github.com/soumith)\n\nAll images in this paper are generated by a neural network. They are NOT REAL.\n\nFull paper here: [http://arxiv.org/abs/1511.06434](http://arxiv.org/abs/1511.06434)\n\n###Other implementations of DCGAN\n* [Torch](https://github.com/soumith/dcgan.torch)\n* [Chainer](https://github.com/mattya/chainer-DCGAN)\n* [TensorFlow](https://github.com/carpedm20/DCGAN-tensorflow)\n\n##Summary of DCGAN\nWe \n- stabilize Generative Adversarial networks with some architectural constraints\n  - Replace any pooling layers with strided convolutions (discriminator) and fractional-strided\nconvolutions (generator).\n  - Use batchnorm in both the generator and the discriminator\n  - Remove fully connected hidden layers for deeper architectures. Just use average pooling at the end.\n  - Use ReLU activation in generator for all layers except for the output, which uses Tanh.\n  - Use LeakyReLU activation in the discriminator for all layers.\n- use the discriminator as a pre-trained net for CIFAR-10 classification and show pretty decent results.\n- generate really cool bedroom images that look super real\n- To convince you that the network is not cheating:\n  - show the interpolated latent space, where transitions are really smooth and every image in the latent space is a bedroom.\n  - show bedrooms after one epoch of training (with a 0.0002 learning rate), come on the network cant really memorize at this stage.\n- To explore what the representations that the network learnt,\n  - show deconvolution over the filters, to show that maximal activations occur at objects like windows and beds\n  - figure out a way to identify and remove filters that draw windows in generation. \n    - Now you can control the generator to not output certain objects.\n- Because we are tripping\n  - Smiling woman - neutral woman + neutral man = Smiling man. Whuttttt!\n  - man with glasses - man without glasses + woman without glasses = woman with glasses. Omg!!!!\n- learnt a latent space in a completely unsupervised fashion where ROTATIONS ARE LINEAR in this latent space. WHHHAAATT????!!!!!!\n- Figure 11, trained on imagenet has a plane with bird legs. so cooool.\n\n# Bedrooms after 5 epochs\nGenerated bedrooms after five epochs of training. There appears to be evidence of visual\nunder-fitting via repeated textures across multiple samples.\n![](images/lsun_bedrooms_five_epoch_samples.png)\n\n# Bedrooms after 1 epoch\nGenerated bedrooms after one training pass through the dataset. Theoretically, the model\ncould learn to memorize training examples, but this is experimentally unlikely as we train with a\nsmall learning rate and minibatch SGD. We are aware of no prior empirical evidence demonstrating\nmemorization with SGD and a small learning rate in only one epoch.\n![](images/lsun_bedrooms_one_epoch_samples.png)\n\n# Walking from one point to another in bedroom latent space\n\nInterpolation between a series of 9 random points in Z show that the space\nlearned has smooth transitions, with every image in the space plausibly looking like a bedroom. In\nthe 6th row, you see a room without a window slowly transforming into a room with a giant window.\nIn the 10th row, you see what appears to be a TV slowly being transformed into a window.\n\n![](images/lsun_bedrooms_five_epochs_interps.png)\n\n# Forgetting to draw windows\n\nTop row: un-modified samples from model. Bottom row: the same samples generated\nwith dropping out \"window\" filters. Some windows are removed, others are transformed into objects\nwith similar visual appearance such as doors and mirrors. Although visual quality decreased, overall\nscene composition stayed similar, suggesting the generator has done a good job disentangling scene\nrepresentation from object representation. Extended experiments could be done to remove other\nobjects from the image and modify the objects the generator draws.\n\n![](images/lsun_bedrooms_window_drop_test.png)\n\n# Google image search from generations\n\n![](images/googsearch_dcgan.png)\n\n\n# Arithmetic on faces\n\n![](images/faces_arithmetic_collage.png)\n\n# Rotations are linear in latent space\n\n![](images/turn_vector.png)\n\n# More faces\n\n![](images/faces_128_filter_samples.png)\n\n# Album covers\n\n![](images/albums_128px.png)\n\n# Imagenet generations\n\n![](images/50.png)\n", 
  "id": 46723165
}