{
  "read_at": 1462554476, 
  "description": "A numerical framework for computing approximations to stationary solutions of general evolution equations", 
  "README.md": "## Steady-State Approximation\n\nThis software package is distributed in the hope that it will be useful for the asymptotic analysis\nof size-structured population models. The theoretical framework for this software has been developed in Mirzaev I., and Bortz D.M., (2016), where we \ndeveloped a numerical framework for computing approximations to stationary solutions of general evolution equations. This software can also be used \nto produce existence and stability regions for steady states of size-structured population models. \n\n**Two particular applications are given:**\n\n1. Population balance equations (see Mirzaev, I., & Bortz, D. M. (2015). *arXiv:1507.07127* )\n2. Sinko-Streifer size-structured population model (see Sinko, J. W., and Streifer, W. (1967), *Ecology, 48(6):910-918.* ) \n\n\n## Dependencies\nThe program is written purely in Python 2.7. It depends on some famous libraries: *SciPy, NumPy, matplotlib, multiprocessing, etc*.\nAll the dependencies can be solved by installing *Anaconda* software package. Installation instructions can be found at\n*https://www.continuum.io/downloads*\n\n\n## Basic Usage\n\nFor example to generate existence and stability regions for the population balance equations:\n\n1. Navigate to the folder, where you have extracted this software package.\n2. Change model rates in **pbe_model_rates.py** file as you desire (instructions available in the python file).\n3. Run the following command in your terminal\n```\n python pbe_exixtence_region.py \n``` \nGenerated existence and stability regions can be found in **images** folder. Similarly, run programs **pbe_jacobian_eigenvalue_plots.py** and **pbe_stability_plots.py** \n\nNote that to simulate Sinko-Streifer model. Model rates should be updated in **sinko_model_rates.py** and the program **sinko_existence_region.py** should be run according to above instructions. \n\n\n\n## Citation\nIf you use this program to do research that leads to publication, we ask that you acknowledge use of this program by citing the following in your publication::\n\n\nCite the paper: \n\n```\nMirzaev I., Bortz D. M. (2016) A numerical framework for computing steady states of size-structured population models and their stability , arXiv:1602.07033\n```\n\nCite the software package:\n\n```\nMirzaev, I. (2016). Steady state approximation. https://github.com/MathBioCU/SteadyStateApproximation.\n```\n\n## More Information\n\nFor further information please contact me at mirzaev@colorado.edu\n\n\n", 
  "id": 46742286
}