{
  "read_at": 1462554441, 
  "description": "Extract Most Frequented Locations from individual spatio-temporal trajectories", 
  "README.md": "Extract Most Frequented Locations from individual spatio-temporal trajectories\n========================================================================\n\n Copyright 2015 Maxime Lenormand. All rights reserved. Code under License GPLv3.\n______________________________________________________________________________________\n\nThis script returns the location most frequented by an individual (called MFL) during  weekdays' daytime and nighttime\naccording to a certain time window. The MFL during a given time windows is defined as the  location in which \nthe individual has spent most of his/her time. In this algorithm, two scales are considered, hours and days. \nHopefully, for a given individual, the MFLs detected at the two scales should be the same.\n\n## Input\n\nThe algorithm takes as input a 6 columns csv file with column names, **the value separator is a semicolon \";\"**. Each row of the file represents a spatio-temporal position of an individual's trajectory. The time is given by the columns 2 to 5 (year, month, day and hour).\nIt is important to note that the table should be **SORTED** by individual ID and time.\n\n1. **ID of the individual**\n2. **Year**\n3. **Month**\n4. **Day**\n5. **Hour**\n6. **ID of the geographical location** \n\n## Parameters\n \nThe algorithm has 6 parameters:\n\n1. **wdinput:**  Path of the input file (ex: \"input.csv\")\n2. **wdoutput:** Path of the output file (ex: \"outputoftheawsomemaximelenormandsalgorithm.csv\")\n3. **minH:** Lower bound (included) of the night time window (ex: 20h)\n4. **maxH:** Upper bound (included) of the night time window (ex: 7h)\n5. **minW:** Lower bound (included) of the day time window (ex: 8h)\n6. **maxW:** Upper bound (included) of the day time window (ex: 19h)\n\n## Output\n\nThe algorithm returns a 15 columns csv file with column names, **the value separator is a semicolon \";\"**. Each row represents an individual:\n\n1.  **ID:** ID of the individual\n2.  **NbMonths:** Number of distinct months covered by the trajectory\n3.  **NbConsMonths:** Maximum number of consecutive months covered by the trajectory \n4.  **MFLHomeDays:** MFL during nighttime (day scale), 'NoMFL' if NbDaysHome=0 \n5.  **MFLHomeDays2:** Second MFL during nighttime (day scale) if ex aqueo, 'NoMFL' otherwise  \n6.  **NbDaysHomeMFL:** Number of distinct days (during nighttime) spent in the MFL\n7.  **NbDaysHome:** Number of distinct days covered by the trajectory (during nighttime)\n8.  **MFLHomeHours:** MFL during nighttime (hour scale), 'NoMFL' if NbHoursHome=0\n9.  **MFLHomeHours2:** Second MFL during nighttime (hour scale) if ex aqueo, 'NoMFL' otherwise  \n10. **NbHoursHomeMFL:** Number of distinct hours spent in the MFL (during nighttime)\n11. **NbHoursHome:** Number of distinct hours covered by the trajectory (during nighttime)\n12. **MFLWorkDays:** MFL during daytime (day scale), 'NoMFL' if NbDaysWork=0\n13. **MFLWorkDays2:** Second MFL during daytime (day scale) if ex aqueo, 'NoMFL' otherwise \n14. **NbDaysWorkMFL:** Number of distinct days spent in the MFL (during daytime)\n15. **NbDaysWork:** Number of distinct days covered by the trajectory (during daytime)\n16. **MFLWorkHours:** MFL during daytime (hour scale), 'NoMFL' if NbHoursWork=0\n17. **MFLWorkHours2:** Second MFL during daytime (hour scale) if ex aqueo, 'NoMFL' otherwise\n18. **NbHoursWorkMFL:** Number of distinct days spent in the MFL (during daytime)\n19. **NbHoursWork:** Number of distinct hours covered by the trajectory (during daytime)\n\n## Execution\n\nYou can run the code using the command:\n\n*python MFL.py 'input.csv' 'output.csv' 20 7 8 19*\n\n## Citation\n\nIf you use this code, please cite:\n\nLouail T, Lenormand M, Murillo Arias M & Ramasco JJ (2015) Crowdsourcing the Robin Hood effect in the city. *Arxiv e-print*, arXiv:1604.08394.\n\nIf you need help, find a bug, want to give me advice or feedback, please contact me!\nYou can reach me at maxime.lenormand[at]irstea.fr\n\n## References\n\n[1] Louail *et al.* (2015) [Crowdsourcing the Robin Hood effect in the city.](http://arxiv.org/abs/1604.08394). *Arxiv e-print*, arXiv:1604.08394.\n\n\n", 
  "id": 46791579
}