{
  "read_at": 1462554787, 
  "description": "An MPTCP-aware SDN controller that provides deterministic subflow assignment to paths", 
  "README.md": "# MPTCP-aware SDN controller\n\nThis implementation is based on Floodlight v1.1. Results with the use of this controller can be found in http://arxiv.org/pdf/1511.09295.pdf\n\n#### Main Components/Files Modified from base Floodlight\n- **Forwarding.java** :Provides random or deterministic assignment of subflows to paths. You can configure the forwarding by tweaking the following parameters that are in the Forwarding file.\n\n  - ***randomForwarding*** : Set to false if you want to use the MPTCP-aware approach\n  - ***topo***: Set to either \"ft\" or \"jelly\". Used in TopologyManager. The reason is that the filtering process of paths is different in these topologies. \nFor instance in FatTree we retrieve from the shortest paths while in jelly\nwe retrieve from all the calculated paths\n            \n  - ***isDisjoint***: Set to true if you want to calculate disjoint paths\n\n  - ***k***: Set the number of paths that you want to retrieve. By setting to zero the TopologyManager retrieves \n            all the shortest paths.\n           \n    Note that to use 8-edge-disjoint paths you have to set isDisjoint=true and k=8    \n- **TopologyManager.java** : Extended so it finds all the available paths (*searchDFS* method). Then it filters all the available paths according to the request (*getRoutes* method ). Request might involve *shortest* paths, *k-shortest* paths and *k-edge-disjoint* paths\n- **TCP.java (net.floodlightcontroller.packet)**: Added methods to extract MPTCP-options and data from the packets\n\n- **Added helpful classes such as MptcpConnection,IpRoutes,ExpiringMap (net.floodlightcontroller.util)**\n\n#### Our testbed setup\n\n- Ubuntu 14.04.2 LTS \n- MPTCP Linux Kernel Implementation version 0.90\n- Mininet version 2.2.1\n- Open vSwitch version 2.0.2\n\n##### Topologies Configuration\n\n- 8-ary FatTree: 128 hosts with 80 switches.\n- Jellyfish Topology: 120 hosts with 60 switches and 10 ports per switch. \n- DH-Jellyfish Topology: 120 hosts with 60 switches and 10 ports per switch\n\nIn all the above topologies all links are set to 1MB/s and have a maximum queue size of 100 packets. The capacities are scaled down to avoid the reception of erratic results due to host CPU bottleneck.\n\nNote that in our experiments we computed the sets of paths and stored them to the Forwarding Module before the actual experiments. This decision was made to provide fairness between each experiment. Recall that upon the calculation of a set of paths we store the set to the Forwarding Module for future use. If we didn't computed the sets in advance then the first experiment would have been penalized by the extra overhead of calculating the paths while all subsequent experiments will not have that extra overhead. To achieve similar behavior you can send a \"dummy\" request for each pair of source/destination IP addresses pair and then start your actual experiments\n\n\nFloodlight v1.1 can be found on GitHub at:  \nhttp://github.com/floodlight/floodlight/tree/v1.1.\n\n\n\n\n", 
  "id": 46937773
}