{
  "read_at": 1462554742, 
  "description": "This simulation con visualization models the cold uniform spherical collapse of open clusters as described in M. Joyce, B. Marcos, and F. Sylos Labini, \"Cold uniform spherical collapse revisited\", AIP Conf. Proc. 1241, 955 (2010)", 
  "README.md": "# Cold uniform spherical collapse revisited\n\nThis simulation/visualization implements a mean-field cold uniform spherical\ncollapse simulation from a velocity-less, uniform spherical configuration\n(as is found in open/galactic clusters of stars formed from a single stellar\nnursery) and the resulting ejection of mass. The model is based on the paper\n\"Cold uniform spherical collapse revisited\" by M. Joyce, B. Marcos, and\nF. Sylos Labini, published in AIP Conf. Proc. 1241, 955 (2010); see [1].\n\n# BUILDING\n\nThe project uses CMake for building and requires the GLM, GLEW, SDL2 for\nbuilding as well as a functional OpenGL driver for the visualization.\n\nThe file \"configuration.hpp.in\" contains compile-time configuration options such\nas floating point precision options, smoothing factors et cetera.\n\nNote that the build-system hardcodes the resource path for shader files\nin the binary, so the resulting executable sources shader files directly\nfrom the source folder.\n\n# RUNNING\n\nrun `twobody` or `multibody`\n\n# TODO\n- OpenCL/CrossCL parallelization (simulation is re-scaled, needs some testing with 32-bit floats)\n- better configuration management\n- octtree spatialization\n- distribution over several machines\n- workstealing -- at 100 000+ particles, uneven workloads start to become a significant issue\n- automated running of many headless simulations\n- caching or otherwise unifying computation of potential energy -- some duplicated work done right now\n- logging is messy and needs to be better controlled by config management, esp. so that no duplicated work is done for logging\n  maybe logging can become a part of the dataset object?\n\n# REFERENCES\n\n- [1] M. Joyce, B. Marcos, and F. Sylos Labini, Cold uniform spherical collapse revisited, AIP Conf. Proc. 1241, 955 (2010); http://dx.doi.org/10.1063/1.3462740 and arXiv1011.0614 (2011), http://arxiv.org/abs/1011.0614.\n\n- [2] P. J. E. Peebles, The Large-Scale Structure of the Universe, Princeton University Press,\n1980. See also C. Payne-Gaposchkin, Stars and clusters, (Cambridge, Harvard University\nPress, 1979), or just https://en.wikipedia.org/wiki/Open_cluster.\n\n- [3] A. Friedman, On the Curvature of Space, General Relativity and Gravitation 31, 1991\n(1999), or just https://en.wikipedia.org/wiki/Friedmann_equations.\n", 
  "id": 46977814
}