{
  "read_at": 1462554762, 
  "description": "Files associated to \"General method for constructing local-hidden-state (and -variable) models for multiqubit entangled states\"", 
  "README.md": "# localhiddenstatemodels\nData files associated to \n\n\"General method for constructing local-hidden-state (and -variable) models for multiqubit entangled states\"\nDaniel Cavalcanti, Leonardo Guerini, Rafael Rabelo and Paul Skrzypczyk\nhttp://arxiv.org/abs/1512.00277\n\nAll files are MATLAB data files (.mat) and contain the example states which are entangled but have LHS models (either for projective measurements or for POVMs).\n\nIn total there are 8 data files:\n\n1. examples1SFIXROB.mat\n2. examples1SGENROB.mat\n3. examples1SRANROB.mat\n4. examplesGENROB.mat\n5. examplesRANROB.mat\n6. examplesBSA.mat\n7. examplesNEG.mat\n8. examplesPOVM.mat\n\nThe first seven sets contain the examples found by from quantitative entanglement witnesses (with quantifier corresponding to the name), and contain examples which are local for all projective measurements. The last set contains the examples found which are local for all POVM measurements (using a random choice of quantatative entanglement witness).\n\nEach of the files contains 8 variables:\n\nAlist - 2 x 2 x 12 x n matlab array. Contains the pair of 2 x 2 matrices corresponding to the measurement operators for the 6 randomly chosen measurements for each of the n examples. The measurement operators are listed sequentially in the 3rd dimension (i.e. 1st (x=0,a=0), 2nd (x=0,a=1), 3rd (x=1,a=0), etc).\n\nlambdalist - 1 x n matlab array. Contains the radius of the largest ball which fits inside the polytope defined by the measurement operators.\n\nrholist - 4 x 4 x n matlab array. Contains the examples of states which are entangled and have LHS models for all projective/POVM measurements (as appropriate).\n\nrlist - 12 x 3 x n matlab array. Contains the (x,y,z) components of the bloch vectors corresponding to each measurement operator.\n\nslist - 1 x n matlab array. Contains the value of the associated quantifier for the example state.\n\nUlist - 4 x 4 x n matlab array. Contains the randomly chosen unitary matrices used to pick at random an initial entanglement witness. In particular, the first column was used to generate a random pure state of 2 qubits, and from this random pure state the optimal witness (for the given quantifer) was generated as the initial random witness.\n\nWlist - 4 x 4 x n matlab array. Final quantitative entanglement witness, which certifies the entanglement of the state rho, and whose value is s. \n", 
  "id": 47123316
}