{
  "read_at": 1462554839, 
  "description": "Perform stellar classifications using a galactic population synthesis model", 
  "README.md": "# galclassify\nPerform stellar classifications using a synthetic population generated by Galaxia\n\n###Documentation:\n- Sharma et al. (2011): http://adsabs.harvard.edu/abs/2011ApJ...730....3S\n- Huber et al., ApJS, in press: http://arxiv.org/abs/1512.02643\n\n\n###Dependencies:\n* Galaxia: http://galaxia.sourceforge.net/ (the galaxia executable needs to be in your path; NB galaxia is only needed if you're generating new catalogs) <br/>\n* IDL/GDL: ASTROLIB, Coyote Library, and EBF (http://ebfformat.sourceforge.net/build/intro.html) <br/> \n* Code is tested and functional with GDL 0.9.5 (open source implementation of IDL; using GDL additionally requires installation of the CMSVLIB library: https://www.physics.wisc.edu/~craigm/idl/cmsave.html to restore IDL save files)\n\n\n##galclassifyk2:\n\nCode used to classify stellar sources targeted by the K2 mission, which can be used to e.g. extract posteriors for any given EPIC target or derive classifications for a new campaign. \n\n####Prerequisites:\n\ngalclassifyk2 uses databases which need be generated/downloaded before classifications can be done. Assuming you're starting from scratch, the procedure is as follows:\n\n1) Download and unzip the spectroscopic input catalogs (LAMOST DR1, APOGEE DR12, RAVE DR4) here:\nhttps://www.dropbox.com/sh/wbisca484fvemuq/AAChIyTDhfirZOW07J4peNOaa?dl=0\nand place them in the catalogs/ directory. \n\n2) Download and unzip an EPIC from MAST:\nhttp://archive.stsci.edu/missions/k2/catalogs/\nYou want catalogs without 'missing' in the filename, i.e. the original EPIC for a given campaign. For C1, for example, this will be d1435_02_epic_field1_dmc.mrg (see epicfiles.txt for the filenames for other campaigns). Place the EPIC file in the epics/ directory.\n\n3) Run the readepic.pro script, which creates a data structure from the EPIC file downloaded in step 2. Assuming you want to do C1, run:\n```\t\n.compile main\nreadepic,cam=1\n```\t\nThis will create the file epics/c1epic.ebf. \n\n\n4) Download and unzip the Galaxia synthetic population for a given campaign here:\nhttps://www.dropbox.com/sh/9dwfnexjm08h39p/AABAMZjAfcPQZ4InB_Otdh8Ya?dl=0\nand place it in the galaxia/ directory. \n\nNow everything should be ready to run classifications. Other campaigns can be done in the same way by setting the cam keyword to the desired campaign number (assuming you've already downloaded the corresponding EPIC). \n\n\n####Examples:\n\nExample calling sequences from IDL/GDL for C1:\n\nCheck result for EPIC201121245 only:\n```\t\nclassifyk2,epicin=201121245\n```\t\n\nThe result should be something like: <br />\n[parameter median +1sig -1sig originalstep adjustedstep] <br />\nTeff       4899.1720       78.495985       78.495985       49.059991       19.623996 <br />\nlog(g)       2.9718189      0.46199999      0.53899999   0.00500000     0.076999998 <br />\n[Fe/H]     -0.39738958      0.29999995      0.35999994    0.0500000     0.059999990 <br />\nRad       4.8207513       4.5357750       1.6357121   0.00100000     0.035999990 <br />\nmass       1.0046383      0.22135916      0.10061780    0.0091470726     0.020123560 <br />\nrho    0.0063197528     0.022567087    0.0054866470   0.00500000      0.10999999 <br />\ndistance       601.48027       445.69961       196.69803   0.00100000     0.034399986 <br />\nE(B-V)     0.031316837     0.017600000     0.011000000   0.00100000    0.0022000000\n\n\nRun the whole C1 target sample and plot the output for each star (you'll be prompted after each star):\n```\t\nclassifyk2,cam=1,/pl\n```\t\n\nCheck result for EPIC201121245 & EPIC201122521, and plot result:\n```\t\nclassifyk2,epicin=[201122521,201121245],/pl\n```\t\n\nCheck result for EPIC201121245, plot result, and output 10000 posterior samples:\n```\t\nclassifyk2,epicin=201121245,/pl,sample=10000\n```\t\n\nRun the whole C1 target sample without plotting:\n```\t\nclassifyk2,cam=1\n```\t\n\n####Random and important notes:\n\n- The directory location of the files in step 1, 2 and 3 as well as the output directory can be modified the \"paths.txt\" file.\n- If you change the names of EPIC input files downloaded from MAST, make sure to edit the epicfiles.txt file which links each campaign number to the file name.\n- The spectroscopic catalog cross-matching routine is crude, and might throw a memory allocation error depending on your setup. If that's the case, try to increase the search radius parameter in classifyk2.pro (search for range = 3./60./60.). The catalog matching also takes some time, so if you're running multiple stars make sure to pass arrays of EPIC IDs as input.\n\n\n####Generating new catalogs:\n\nIf you want to generate new classifications (i.e. for campaigns not covered in the paper), the procedure is as follows:\n\n- Repeat steps 2 and 3 above for the desired campaign.\n- Update coords.txt with the coordinates for the field.\n- Generate a Galaxia synthetic population for the field. To do this, run:\n\n```\t\nmakegalaxiasim,cam=x\n```\t\n\nwhere x is the desired campaign number. This will create the file galaxia/cx_model.ebf.\n\n- Run classifyk2 on all stars:\n```\t\nclassifyk2,cam=x\n```\t\nThis generates a file named k2cx_stparas_raw.idl in the output directory. \n\n- Run the consolidation routine:\n```\t\nconsolidate,cam=x\n```\nThis generates a files named k2cx_stparas.idl and k2cx_stparas.txt in the output directory. \n\n\n\n\n\n##galclassify:\n\nStand-alone version of the Galaxia classification code to classify any given star (not necessarily observed by K2) given some input observables. Unlike galclassifyk2 this code generates a synthetic population for each star given some radius, rather than using a precomputed population over a large field. Suitable for individual stellar classifications, but slow if you want to classify large samples of stars.\n\n####Usage:\n\nCalling sequence from IDL/GDL:\n```\ngalclassify,input=input\n```\n\n**Required input parameters:**\t<br/>\ninput ... plain ascii file containing observables in a fixed format; see tychostar.txt for an example <br/>\n\n**Optional input parameters:**\t<br/>\nsample\t... specifies how many posterior samples should be saved in a text file  <br/>\npl      ... set if you want to see plots\n\n**Output:**\t<br/>\nIf sample is not set, the default output will be the median and 1-sigma confidence interval for each parameter (printed in the terminal) and graphical output of posteriors and observables. If sample is set, the text files containing the posteriors (both discrete and sampled) will be written to the output/ directory\n\n**Example:** <br/>\nClassify some random Tycho star:\n```\t\ngalclassify,input=\"tychostar.txt\"\n```\n\nClassify some random Tycho star and save posteriors with 10000 samples:\n```\t\ngalclassify,input=\"tychostar.txt\",sample=10000\n```\n\nClassify the Sun at J=10mag and plot result:\n```\t\ngalclassify,input=\"sun_at_J10.txt\",/pl\n```\n\n####Random and important notes:\n* For bright stars Galaxia will take a very long time to run, and most likely the population will still be too sparse for meaningful inference - in this case it's better to use traditional isochrone modeling.\n* The posterior sampling is still very crude, and for stars with poor model coverage the samples will be dominated by a few distinct models\n", 
  "id": 47144137
}