{
  "read_at": 1462550297, 
  "description": "Attention Network Test implemented in PsychoPy", 
  "README.md": "# ANT (Attention Network Test) \n\nThis module implements the ANT (Attention Network Test) in PsychoPy2\n\n## Use\n\nTo use this class, do something like the following:\n\n\n    from ant import ANTExp # or some such\n\n    # Create the ANT Experimental class\n    exp = ANTExp(mon, win, winsize, refresh, globalClock, startTime, alog)\n\n    # Show the instructions to the user\n    noPractice = exp.displayInstructions()\n\n    # Run the practice block\n    exp.practiceBlock():\n\n    # Run the real experiment as 3*2 runs\n    for r in range(6):\n        if r%2 == 0:\n            if exp.displayText(\"Starting experimental block %d of 3\\nHit any key when ready to start.\" % (r/2+1), showLine=False):\n                break\n            core.wait(1)\n\n        block = exp.fullExperiment()\n\n        if block == None:\n            break\n        if allData == None:\n            allData = block\n        else:\n            allData = np.concatenate((allData, block))\n\n    # do something with allData (or use the logfiles, that log ;-separated experimental data)\n\nThere is a working example in the testant.py file.\n\n\nFor a full description of the original experiment, see:\n\n    Jin Fan, Bruce D. McCandliss, Tobias Sommer, Amir Raz, and Michael I. Posner:\n    \"Testing the Efficiency and Independence of Attentional Networks\"\n    Journal of Cognitive Neuroscience 14:3, pp. 340-347 (2002)\n\n## Quoting\n\nIf you use this for your research, I would appreciate either a citation to this article:\n\n    Baekgaard, Per, Michael Kai Petersen, and Jakob Eg Larsen.\n    \"Assessing Levels of Attention using Low Cost Eye Tracking\"\n    (To appear in proceedings from the Human Computer Interaction International 2016 by Springer).\n\nwhich is currently available as a preprint:\n\n    Baekgaard, Per, Michael Kai Petersen, and Jakob Eg Larsen. \n    \"Assessing Levels of Attention using Low Cost Eye Tracking.\" \n    arXiv preprint arXiv:1512.05497 (2015).\n\nor a reference to the GitHub repository\n\n    https://github.com/baekgaard/ant\n\n\n## Licence\n\nCreated by Per Baekgaard / pgba@dtu.dk / baekgaard@b4net.dk, September 2015\n\nLicensed under the MIT License:\n\nCopyright (c) 2015,2016 Per Baekgaard, Technical University of Denmark, DTU Informatics, Cognitive Systems Section\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated\ndocumentation files (the \"Software\"), to deal in the Software without restriction, including without\nlimitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the\nSoftware, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions\nof the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT\nLIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\nWHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE\nOR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n", 
  "id": 47212689
}