{
  "read_at": 1462550028, 
  "description": "", 
  "README.md": "## A key phrase extractor based on wikipedia miner.\n\nTested under python 2.7.6, no extra libraries needed.\n\nThe server we use is the wikify service under [wikipedia miner](http://wikipedia-miner.cms.waikato.ac.nz/services/). Because the phrase extraction algorithm of wikipedia miner is able to process each document separately, we send a http request for each paper sequentially. Please see the [paper](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.178.2266&rep=rep1&type=pdf) for more algorithm details.\n\n### Data:\n - *`data/arxiv_cs_xml/arxiv_cs.xml`*: original XML file of 78129 arxiv computer science papers.\n - *`data/arxiv_cs_json/arxiv_cs.json`*: extracted contents from the XML file by the script *`xml_parsing.py`*.\n - *`data/arxiv_cs_json_1000/arxiv_cs_1000.json`*: first 1000 papers of the whole data, for testing.\n\n### Scripts:\n - *`xml_parsing.py`*\n - *`wiki_miner.py`*\n - *`manual_add_phrase.py`*\n - *`combine_t_a_k.py`*\n\n### General pipline:\n1. use *`xml_parsing.py`* to parse XML file, and save the contents in a json file. If the json file already exists, this can be skipped.\n1. use *`wiki_miner.py`* to extract phrases with a specific probability threshold (0.5 by default) under the `common` mode.\n2. use *`wiki_miner.py`* to extract phrases with a lower probability threshold (0 by default) under the `fill` mode, for those documents with empty phrase list from the first step.\n3. use *`manual_add_phrase.py`* to manually add key phrases for the documents still without any key phrases by now.\n4. use *`combine_t_a_k.py`* to combine the extracted phrases with the corresponding titles and abstracts.\n\nNote that an error may occur when running *`wiki_miner.py`* due to the instability of the server. The script will save the extracted phrases if an error occurs. Just run the command again to extract the remaining papers. If there is keyboard interrupt, the extracted phrases will also be saved.\n\n### A running example:\n1. run \n\n    ``python wiki_miner.py data/arxiv_cs_json/arxiv_cs common 0.5``\n\n2. run\n\n    ``python wiki_miner.py data/arxiv_cs_json/arxiv_cs fill 0``\n\n3. run\n\n    ``python manual_add_phrase.py data/arxiv_cs_json/arxiv_cs``\n\n4. run\n\n    ``python combine_t_a_k.py data/arxiv_cs_json/arxiv_cs``\n\nFinally, the target file will be generated as *`data/arxiv_cs_json/arxiv_cs_t_a_k.json`*, containing title, abstract and extracted key pharses of the papers.\n\n", 
  "id": 47219970
}