{
  "read_at": 1462550290, 
  "description": "", 
  "README.md": "## DeepLab\r\n\r\n### Introduction\r\n\r\nDeepLab is a state-of-art deep learning system for semantic image segmentation built on top of [Caffe](http://caffe.berkeleyvision.org).\r\n\r\nIt combines densely-computed deep convolutional neural network (CNN) responses with densely connected conditional random fields (CRF).\r\n\r\nThis distribution provides a publicly available implementation for the key model ingredients first reported in an [arXiv paper](http://arxiv.org/abs/1412.7062), accepted in revised form as conference publication to the ICLR-2015 conference. \r\nIt also contains implementations for methods supporting model learning using only weakly labeled examples, described in a second follow-up [arXiv paper](http://arxiv.org/abs/1502.02734).\r\nPlease consult and consider citing the following papers:\r\n\r\n    @inproceedings{chen14semantic,\r\n      title={Semantic Image Segmentation with Deep Convolutional Nets and Fully Connected CRFs},\r\n      author={Liang-Chieh Chen and George Papandreou and Iasonas Kokkinos and Kevin Murphy and Alan L Yuille},\r\n      booktitle={ICLR},\r\n      url={http://arxiv.org/abs/1412.7062},\r\n      year={2015}\r\n    }\r\n\r\n    @article{papandreou15weak,\r\n      title={Weakly- and Semi-Supervised Learning of a DCNN for Semantic Image Segmentation},\r\n      author={George Papandreou and Liang-Chieh Chen and Kevin Murphy and Alan L Yuille},\r\n      journal={arxiv:1502.02734},\r\n      year={2015}\r\n    }\r\n\r\nNote that if you use the densecrf implementation, please consult and cite the following paper:\r\n\r\n    @inproceedings{KrahenbuhlK11,\r\n      title={Efficient Inference in Fully Connected CRFs with Gaussian Edge Potentials},\r\n      author={Philipp Kr{\\\"{a}}henb{\\\"{u}}hl and Vladlen Koltun},\r\n      booktitle={NIPS},      \r\n      year={2011}\r\n    }\r\n\r\n### Performance\r\n\r\nDeepLab currently achieves 73.9% on the challenging PASCAL VOC 2012 image segmentation task -- see the [leaderboard](http://host.robots.ox.ac.uk:8080/leaderboard/displaylb.php?challengeid=11&compid=6). \r\n\r\n### Pre-trained models\r\n\r\nWe have released several trained models and corresponding prototxt files at [here](http://ccvl.stat.ucla.edu/software/deeplab/). Please check it for more model details.\r\n\r\nThe best model among the released ones yields 73.6% on PASCAL VOC 2012 test set.\r\n\r\n### Experimental set-up\r\n\r\n1. The scripts we used for our experiments:\r\n    1. [run_pascal.sh](http://www.cs.ucla.edu/~lcchen/deeplab-public/run_pascal.sh): the script for training/testing on the PASCAL VOC 2012 dataset. __Note__ You also need to download this [file](http://www.cs.ucla.edu/~lcchen/deeplab-public/sub.sed)\r\n    2. [run_densecrf.sh](http://www.cs.ucla.edu/~lcchen/deeplab-public/run_densecrf.sh) and [run_densecrf_grid_search.sh](http://www.cs.ucla.edu/~lcchen/deeplab-public/run_densecrf_grid_search.sh): the scripts we used for post-processing the DCNN computed results by DenseCRF.\r\n2. The image list files used in our experiments:\r\n    * The [list folder](http://www.cs.ucla.edu/~lcchen/deeplab-public/list) stores the list files for the PASCAL VOC 2012 dataset. You can download the zipped file [here](http://www.cs.ucla.edu/~lcchen/deeplab-public/list.zip) (i.e., all the lists).\r\n3. To use the mat_read_layer and mat_write_layer, please download and install [matio](http://sourceforge.net/projects/matio/files/matio/1.5.2/).\r\n\r\n### FAQ\r\n\r\nCheck [FAQ](http://ccvl.stat.ucla.edu/deeplab_faq/) if you have some problems while using the code.\r\n\r\n### How to run DeepLab\r\n\r\nThere are several variants of DeepLab. To begin with, we suggest DeepLab-LargeFOV, which has good performance and faster training time.\r\n\r\nSuppose the codes are located at deeplab/code\r\n\r\n1. mkdir deeplab/exper (Create a folder for experiments)\r\n2. mkdir deeplab/exper/voc12 (Create a folder for your specific experiment. Let's take PASCAL VOC 2012 for example.)\r\n3. Create folders for config files and so on.\r\n    1. mkdir deeplab/exper/voc12/config  (where network config files are saved.)\r\n    2. mkdir deeplab/exper/voc12/features  (where the computed features will be saved (when train on train))\r\n    3. mkdir deeplab/exper/voc12/features2 (where the computed features will be saved (when train on trainval))\r\n    4. mkdir deeplab/exper/voc12/list (where you save the train, val, and test file lists)\r\n    5. mkdir deeplab/exper/voc12/log (where the training/test logs will be saved)\r\n    6. mkdir deeplab/exper/voc12/model (where the trained models will be saved)\r\n    7. mkdir deeplab/exper/voc12/res (where the evaluation results will be saved)\r\n4. mkdir deeplab/exper/voc12/config/deeplab_largeFOV (test your own network. Create a folder under config. For example, deeplab_largeFOV is the network you want to experiment with. Add your train.prototxt and test.prototxt in that folder (you can check some provided examples for reference).)\r\n5. Set up your init.caffemodel at deeplab/exper/voc12/model/deeplab_largeFOV. You may want to soft link init.caffemodel to the modified VGG-16 net. For example, run \"ln -s vgg16.caffemodel init.caffemodel\" at voc12/model/deeplab_largeFOV.\r\n6. Modify the provided script, run_pascal.sh, for experiments. You should change the paths according to your setting. For example, you should specify where the caffe is by changing CAFFE_DIR. Note You may need to modify sub.sed, if you want to replace some variables with your desired values in train.prototxt or test.prototxt.\r\n7. The computed features are saved at folders features or features2, and you can run provided MATLAB scripts to evaluate the results (e.g., check the script at code/matlab/my_script/EvalSegResults).\r\n\r\n### Python\r\n\r\nSeyed Ali Mousavi has implemented a python version of run_pascal.sh (Thanks, Ali!). If you are more familiar with Python, you may want to take a look at [this](https://github.com/TheLegendAli/CCVL). \r\n", 
  "id": 47257412
}