{
  "read_at": 1462550344, 
  "description": "Automatically exported from code.google.com/p/fdes", 
  "README.txt": "FDES\n\n\tThis tool offers a behavioral comparison of process models \n\tand computes feedback about encountered differences. \n\tIt is based on a model of concurrency, Asymmetric Event \n\tStructures (AES). \n\tThe general idea of the technique is to compute the AES of \n\ta process model (it can be derived from its PES) and apply \n\tthe reduction technique\tpresented in http://arxiv.org/abs/1403.7181. \n\tIn order to compute a canonical representation for the behavior \n\tof an AES, the Nauty (see reference at the bottom of the \n\tfile) library is used to compute the canonical order of the \n\tevents in a PES. \n\tAdditionally, in order to obtain a finite representation of \n\ta process with cycles, an unfolding technique is presented \n\tto compute a complete prefix unfolding (it was built on top \n\tof the library UMA, see reference at the bottom of the file). \n\tSuch prefix is the used to compute the corresponding AES. \n\tIn order to find matching of events between a pair of AES, an\n\terror-tolerant graph matching technique is used.\n\tIt is under testing and further optimizations will be added in order\n\tto cope with larger process models. \n\nInstall\n   - Given that we rely on Nauty, it is necessary to place the folder of Nauty in the \n     same directory of the FDES.jar file. See below the structure of the folder:\t\n\t.\n\t+-- README.txt\n\t+-- models\n\t+-- nauty\n\t|   +-- dreadnaut\n\t|   +-- ...\n\t+-- FDES.jar\n\n   - The first time the .jar is executed, it might be necessary to enable the permission for the file in nautyIO/runNauty.sh\n   \n   - The folder 'models' contains a set of variants of process models that can be used for testing the tool. \n\n\nHow to run\n\n\tjava -jar FDES.jar -m1 model1 -m2 model2 -ES AES -C -EPC\n\n\t\n    Parameters:\n\t-C   : Specifies if the computation (and reduction) of the AES will be \n\t       canonical\n \t-EPC : Specifies if the input models are EPCs in XML format, if it is not \n\t       specified, program is expecting a BPMN in XML format\n \t-ES <arg> : Select the event structure to use: AES (under testing FES or AES-FES)\n \t-m1 <arg> and -m2 <arg> : Specifies the pairs of models to compare. \n\n\nReferences:\n\t- http://www.win.tue.nl/~dfahland/tools.html\n\t- http://cs.anu.edu.au/~bdm/nauty/\n\n", 
  "id": 47257328
}