{
  "read_at": 1462550135, 
  "description": "", 
  "README.md": "# CoCoA - Distributed Optimization with Arbitrary Local Solvers\n\nThis code contains efficient C++ implementations of the communication efficient CoCoA+ distributed optimization framework, as described in [the paper](http://arxiv.org/abs/1512.04039) below.\nMPI is used for communication accross machines.\nThe current code supports a variety of loss functions (such as Hinge loss, quadratic/least squares loss and logistic loss), with strongly convex regularizers. Different implementations of many local solvers are provided for comparison.\nAccuracy certificates in the form of the duality gap are readily computed and can be plotted.\n\nBoth additive or averaging udpates of the local solvers are available, as supported by the CoCoA+ algorithm framework.\n\nFor the experiments in the paper, the code was run on the public Amazon EC2 cloud.\n\n### Getting Started\nuse `./configure` and `make`. (This assumes you have `automake` installed on your system).\nAssuming executable program is named \"Cocoa\":\n\n```\nmpirun -np 4 Cocoa -A data/a1a.4/a1a -l 0.0001 -C 50 -I 100 -f 3 -a 1 -M 0\n\nThe meaning of the parameters:\n-A: path of dataset\n-l: value of the regularization parameter \\lambda\n-C: number of outer iterations of CoCoA+ algorithm that you wish to run\n-I: number of inner iterations of local solvers during each epoch\n-f: type of loss functions, can be set\n        0 (Logistic Loss),\n        1 (Hinge Loss),\n        2 (Squared Hinge Loss),\n        3 (Quadratic Loss)\n-a: set to 0 if using the default cocoa+ subproblems, set to 1 for using more aggressive subproblems \n-M: type of local solver, default 0 is using SDCA solver for the local subproblems\n```\n\n## References\nThe algorithmic framework is described in more detail in the following paper:\n\n_Chenxin Ma, Jakub Konecny, Martin Jaggi, Virginia Smith, Michael I. Jordan, Peter Richtarik, Martin Takac [Distributed Optimization with Arbitrary Local Solvers](http://arxiv.org/abs/1512.04039). arXiv 2015._\n", 
  "id": 47410620
}