{
  "read_at": 1462550299, 
  "description": "Assigns a Yelp review a positive/negative sentiment or a rating between 1 and 5", 
  "README.md": "# Yelp Review Sentiment Predictor\n\n## About\n\nGiven a Yelp review, this project builds two types of classifiers to assign to the review 1) a positive or negative sentiment, and 2) a rating in the interval [1, 5]. The classifier is trained with either Naive Bayes, SVM, or Logistic Regression as the model, and the [Yelp dataset](http://www.yelp.com/dataset_challenge/). The corresponding paper *Predicting the Sentiment Polarity and Rating of Yelp Reviews* may be found on arXiv [here](http://arxiv.org/abs/1512.06303).\n\n## Motivation\n\nFrom Section 1.2 of *Predicting the Sentiment Polarity and Rating of Yelp Reviews*: \"It is useful for Yelp to associate review text with a star rating (or at least a positive or negative assignment) accurately in order to judge how helpful and reliable certain reviews are. Perhaps users could give a good review but a bad rating, or vice versa. Also Yelp might be interested in automating the rating process, so that all users would have to do is write the review, and Yelp could give a suggested rating.\"\n\n## Example\n\nThe user can specify which type of classification to perform (positive/negative or 5-star), which technique to use (Naive Bayes, SVM, or Logistic Regression), and how much data to use.\n\nAssuming you have the Yelp review dataset in the same directory as `classify.py`, the following will build a Logistic Regression classifier for 5-star classification using 80% of the data:\n\n```\nclassify.py svm False 80\n```\n\nIn general, the classifier is used as follows:\n\n```\nclassify.py <nb/svm/lr> <True/False> <number in [0, 100]>\n```\n\nwhere `True` indicates positive/negative classification, and `False` indicates 5-star classification.\n\n## Installation\n\n1. Get the Yelp data [here](https://www.yelp.com/dataset_challenge/dataset).\n\n2. [Install scikit-learn](http://scikit-learn.org/stable/install.html).\n\n3. Save `classify.py` and `yelp_utils.py` in the same directory as the Yelp data, and run `classify.py` as described in the Example section above.\n\n## License\n\nCopyright (c) 2015 Andrew Elkouri, released under the MIT license.\n", 
  "id": 47433203
}