{
  "read_at": 1462550329, 
  "description": "extract prioritized clusters of anomalous samples and their salient (continuous, real-valued) feature subsets", 
  "README.md": "# GAD_MLSP2015\n\nMAIN FILE:\n\nget_top_anomaly.py\n\nGOAL: \n\nextract prioritized clusters of anomalous samples and their salient (continuous, real-valued) feature subsets from DATA\n\nBased on our MLSP paper:\n\nDetecting Clusters of Anomalies on Low-Dimensional Feature Subsets with\nApplication to Network Traffic Flow Data\n\nIn that paper, public-domain TCPdump traces of background web enterprise network packet traffic and botnet command and control traffic that also uses port 80 (two different domains) were processed by wireshark to create netflows/sessions from which the bidirectional sequence of packet sizes were extracted to form the DATA used in this case study. The anomaly detection framework is fully unsupervised in that the botnet activity to be detected is only resident in the (unlabelled) test set, together with a fraction of the (nominal) background traffic samples (multifold cross validation was performed). We therefore did not use the categorical features from the headers. Also, the packet payloads were unavailable (public-domain datasets), and the timing features were not used (because the background and botnet traces were recorded in different domains). \n\nPaper Links: \n\narvix: \n\nhttp://arxiv.org/pdf/1511.01047.pdf\n\nMLSP'15 IEEE Xplore:  \n\nhttp://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=7324326&tag=1\n\n\nAlso see: actively learning to distinguish suspicious from innocuous anomalies in a batch of vehicle tracks\n\nActive learning paper in spie for 2 classes to distinguish suspicious from innocuous anomalies.\n\nPaper Link:\n\nhttp://proceedings.spiedigitallibrary.org/proceeding.aspx?articleid=1881997\n\nPending journal paper that describes a both active and semi-supervised framework for >2 (generally novel/rare) classes.\n\n###################################################\n-----------------------------------------------------\nVariables:\n\nTRAIN:\n\n1) a .txt file, 2-d array with (n_sample,n_feature)\n\n2) used to train the background model (GMMs, MIs)\n\nDATA:\n\n1) a .txt file, 2-d array with (n_sample,n_feature)\n\n2) extract group anomalies from DATA\n\nLABEL:\n\n1) each DATA sample's label\n\nnormal_cat:\n\nindicate the normal label\n\nM_max:\n\nmax number of components each gmm can attain\n", 
  "id": 47569375
}