{
  "read_at": 1462550110, 
  "description": "Soft Computing 2015/16 Project - Semantic Classification of Sentences", 
  "README.md": "University of Novi Sad\nFaculty of Technical Science\n\nSoft Computing 2015/2016 ( https://github.com/ftn-ai-lab )\n\nNenad Todorovic RA 78/2012\nDragan Vidakovic RA 134/2012\n\n# Semantic Classification of Sentences\n\nAutomatically assigning input sentences to a set of categories. Sentence assigning process is based on it's semantic. Categories are defined with the indicator words.\n\n# Data\n\n\"Sentence Classification Data Set\" downloaded from Machine Learning Repository of Center for Machine Learning and Intelligent Systems - University of California, Irvine (http://cml.ics.uci.edu/).\nData Set contains data for  classification of sentences in scientific articles into categories:\n  1. AIMX - The specific research goal of the paper\n  2. OWNX - The author's own work (methods, results, conclusions...)\n  3. CONT - Contrast, comparasion or critique of past work\n  4. BASE - Past work that provides the basis for the work in the article\n  5. MISC - Any other sentences.\n\nData Set contains sentences from the abstract and introduction of 90 scientific article from three different domains:\n  1. PLoS Computational Biology (PLOS)\n  2. The Machine Learning repository on arXiv (ARXIV)\n  3. The rsychology journal Judgment and Decision Making (JDM).\n\n# Directories\n\n1. \"training_set\"\n  - 24 PLOS articles with 893 sentences\n  - 24 ARXIV articles with 793 sentences\n  - 24 JDM articles with 814 sentences\n\n2. \"test_set\"\n  - 6 PLOS articles with 220 sentences\n  - 6 ARXIV articles with 197 sentences\n  - 6 JDM articles with 200 sentences\n\n3. \"word_lists\"\n\n  This directory contains one plaintext file for each of the 4 categories AIMX, OWNX, CONT and BASE. Each plaintext file lists the indicator words for the corresponding category. This directory also contains a stopwords file. The stopwords file contains stopwords that are not likely to be important for the taske of sentence classification (how, show, our...). File contains a set of stopwords that are not likely to be strong features for this task and thus can be safely removed.\n  \n# Implementation\n\n- Naive Bayes Classifier\n- Decision Tree Classifier\n- Support Vector Machines\n\nImplementation relied on NLTK (http://www.nltk.org/) and TextBlob (http://textblob.readthedocs.org/en/dev/) Python libraries. \n\nAdded \"new_labeled_data\" directory with 18000+ new sentences from scientific articles, labeled using implemented classifiers.\n", 
  "id": 47900044
}