{
  "read_at": 1462550220, 
  "description": "Julia and C++ code for the acoustic Helmholtz equation applied to liquid spheroids (prolate and oblate)", 
  "README.md": "#Liquid Spheroid codes\n\n\tJulia and C++ code for calculations of acoustic scattering by liquid spheroids (prolate and oblate).\n\tThis code calculates the scattering far-field acoustic pressure pattern using the software executables\n\t(pro_sphwv, obl_sphwv) for the spheroidal wave function calculation developed by Adelman, Gumerov and \n\tDuraiswami available at https://github.com/radelman/scattering.git (see http://arxiv.org/abs/1408.0074\n\tfor further details).\n\t\n\tTo use our code download to a folder the contents of folder Linux or Windows according to your operative\n\tsystem. In Linux it can be necessary to give execution rights to the executables and the shell scripts.\n\t\n\tIn linux start a Julia shell from the command line and load the file \"JUL.main.jl\": this loads the core\n\troutines in \"JUL.routines.jl\" and auxiliary functions in \"JUL.auxiliar.jl\". Some example scripts are\n\tprovided for calculation of diverse cases of oblate and prolate far-field patterns in particular cases.\n\tThese examples are based on the material exhibited in a paper submitted to Acta Acustica United with\n\tAcustica and also in the one that will be probably at arXiv in the near future.\n\t\n##License\n\n\tThe scattering executables (pro_sphwv, obl_sphwv) are Copyright (c) 2014, Ross Adelman, Nail A. Gumerov, \n\tand Ramani Duraiswami, and were released under the BSD 2-Clause License \n\t(http://opensource.org/licenses/BSD-2-Clause).\n\t\n##GSL package on Julia\n\t\n\tThe Julia codes uses the \"GSL\" (GNU Scientific Library) package for a marginal routine.\n\tThe basic setup implies:\n```julia\nPkg.add(\"GSL\")\nPkg.build(\"GSL\")\n```\n\tbut under certain circumstances one command or both fail miserably.\n\tThis is a bug related to a dependency on linux package gsl-devel. A workaround is to install previously\n\tthis package, via\n```console\n$ sudo dnf install gsl-devel\n```\n\tand then run \n```console\n$ sudo ldconfig\n```\n\tto refresh the library database. And of course, update the Julia environment also.\n", 
  "id": 47997715
}