{
  "read_at": 1462550308, 
  "description": "A programm used to create the CONACyT SNI bibliography file", 
  "README.md": "**WARNING: este programa genera un fichero que TIENES QUE VERIFICAR, porque puede ser que aun tiene errores, por ejemplo:**\n* hay varias maneras de codificar los acentos, que no son todas compatibles.\n* puede aparecer dos veces el mismo articulo en la lista de citas: uno de ArXiv, otro de la revista \"real\". Hay que quitar el ArXiv...\n\n**UPDATE: Version 5.x es mucho mas eficiente y no deberia tener problemas con el limite de numero de conexiones. Pero se requiere ads version 0.11.3 (30 dec. 2015), tienes que hacer el update si no es el caso.**\n\nEste programa esta hecho para generar el documento que CONACyT pide para los investigadores que renovan o entran en el SNI. En particular lo siguiente:\n\n_\" En la Seccion Citas de Articulos adjunte un archivo en formato PDF no mayor a  2MB, que  contenga  la  relacion  de  las  citas  externas  globales  a  su  obra, separando las citas por:_\n* _Tipo A: Aquellas realizadas en productos de investigacion firmadas por uno o  varios  autores  dentro  de  los  cuales  no  hay  ninguno  que  sea  autor  del trabajo referido a la cita._\n* _Tipo B: Aquellas realizadas en productos de investigacion firmadas por uno o varios autores dentro de los cuales puede haber uno o varios autores del  trabajo referido en la cita pero no el investigador mismo._\n\n_Se  sugiere  realizar  la  busqueda de  las  citas a  traves  de  alguna  de  las  bases  de  datos internacionales especializadas.\"_\n\nSe usa ADS para buscar la informacion requirida. Elprimer problema a arreglar es el filtro de ADS que impide hacer multiples busquedas en sequido (para evitar que los robotes que poblan el WWW se pongan a chupar todos los articulos...). Para evitar este problema, hay que registrarse a la pagina: https://ui.adsabs.harvard.edu/#user/account/register\nUna ves registrado, uno puede pedir un \"token\", o sea un clave que se requiere para tener acceso a la base ADS.\n\nSe hace por aca:\nhttps://ui.adsabs.harvard.edu/#user/settings/token\n. Hay que recuperar una clave de este tipo:\n\"5K123456789HCzvJWn7312345678987M\"\n\nOtro paso antes de correr el programa es la instalacion de la librarya python \"ads\". Se requiere la mas reciente version (0.11.3, del 30 de dic. de 2015).\nSupongo que tienen una distribucion de python en buen estado, con el programa de manejo de paquetes. En este caso, solo hacer (para instalar o hacer el update):\n\n`pip install -U ads`\n\nPuede ser que necesiten tambien unidecode (si ya lo tienen, lo siguiente no va hacer danos):\n\n`pip install unidecode`\n\nEt voila!\n\nYa pueden descargar el programa que hice desde aca: https://github.com/Morisset/SNI_ads/raw/master/SNI_ads.py\n\nNEW in version 4.x: Hay que guardarlo donde quieren, cambiar los derechos para que sea un ejecutable (chmod a+x SNI_ads.py) y ejecutar desde el directorio donde esta guardado:\n\n`SNI_ads.py 'Morisset, Christophe' -t \"5K123456789HCzvJWn7312345678987M\"`\n\ndonde se da el nombre del author (mejor poner en nombre y el apelido) que buscas y el token que has recuperado del sitio ADS (el que esta en este ejemplo NO funciona).\n\nDeberia resultar en un fichero LaTex de nombre en este caso \"refs_MorissetChristophe.tex\" , de lo cual se genera un PDF bonito. \n\nSi tienes un nombre bastane comun pero que tienes ya una lista de los bibcodes que coresponden a tus articulos en un fichero por ejemplo nombrado in_refs.dat de este tipo (puede ser que los [] sean (), no importa):\n```\n[2016A&A...585A..69G] \n\n[2015EAS....71..313G] \n\n[2015arXiv151004548M] \n\n[2015MNRAS.452.2606G] \n\n[2015MNRAS.452.1764R] \n\n[2015IAUGA..2255587P] \n```\n\npuedes usar:\n\n`SNI_ads.py  -t \"5K123456789HCzvJWn7312345678987M\" -in in_refs.dat \"Morisset, C.\"` \n\nSi se debe mencionar un autor, para que se puede separar las citas de tipo B y C.\n\n", 
  "id": 48004891
}