{
  "read_at": 1462546832, 
  "description": "Ukb: graph-based WSD and similarity", 
  "Readme.txt": "UKB: Graph Based Word Sense Disambiguation and Similarity\n\nUKB is a collection of programs for performing graph-based Word Sense\nDisambiguation and lexical similarity/relatedness using a pre-existing\nknowledge base.\n\nUKB has been developed by the IXA group in the University of the Basque\nCountry. UKB applies the so-called Personalized PageRank on a Lexical\nKnowledge Base (LKB) to rank the vertices of the LKB and thus perform\ndisambiguation. The details of the method are described in [1]. It has also\nbeen applied on WSD on specific domains [2,5] and Named Entity\nDisambiguation [6]. The algorithm can also be used to calculate lexical\nsimilarity/relatedness of words/sentences. See [3,4,6] for applications of\nUKB to similarity.\n\nVisit http://ixa2.si.ehu.es/ukb/ for more information about UKB.\n\nThe latest source code for git can be found here:\n\nhttps://github.com/asoroa/ukb.git\n\n\nReferences\n**********\n\n[1] Eneko Agirre and Aitor Soroa. 2009. Personalizing PageRank for\nWord Sense Disambiguation. Proceedings of the 12th conference of the\nEuropean chapter of the Association for Computational Linguistics\n(EACL-2009). Athens, Greece.\n\n[2] Eneko Agirre, Oier Lopez de Lacalle and Aitor\nSoroa. 2009. Knowledge-based WSD and specific domains: performing over\nsupervised WSD. Proceedings of IJCAI. Pasadena, USA.\n\n[3] Eneko Agirre, Enrique Alfonseca, Keith Hall, Jana Kravalova,\nMarius Pasca and Aitor Soroa. 2009. A Study on Similarity and\nRelatedness Using Distributional and WordNet-based\nApproaches. Proceedings of NAACL-HLT 09. Boulder, USA.\n\n[4] Eneko Agirre, Montse Cuadros, German Rigau and Aitor Soroa. 2010.\nExploring Knowledge Bases for Similarity. Proceedings of LREC\n2010. Valletta, Malta.\n\n[5] Eneko Agirre, Aitor Soroa, Mark Stevenson. 2010. Graph-based Word\nSense Disambiguation of Biomedical Documents. Bioinformatics, Oxford\nUniversity Press. Bioinformatics Vol. 26(22) pp: 2889-2896\n\n[6] Eneko Agirre, Ander Barrena and Aitor Soroa. 2015. Studying the\nWikipedia Hyperlink Graph for Relatedness and Disambiguation. \nhttp://arxiv.org/abs/1503.01655\n\n\nFiles under this catalogue:\n***************************\n\nsrc/                    Source code. See README, INSTALL, LICENSE.\nbin/                    Statically compiled binaries for x86-64 linux\n                        platforms.\nUKBsim/                 Scripts for similarity. See README, INSTALL, LICENSE.\nscripts/                Scripts for converting Wordnet to ukb input files\n\nCheck README files in the respective catalogue.\n\nGetting the resources\n*********************\n\n* WordNet\n\n- English WordNet (versions 1.7 and 3.0) can be found here:\nhttp://ixa2.si.ehu.es/ukb/lkb_sources.tar.bz2\n\n- Spanish WordNet is here:\nhttp://ixa2.si.ehu.es/ukb/lkb_sources.tar.bz2\n\n- More WordNet versions can be converted to UKB format using the scripts in\n  \"scripts/\" directory.\n\n* Wikipedia\n\n- A graph derived from Wikipedia (dump 04 April 2013) is here:\nhttp://ixa2.si.ehu.eus/ukb/ukb-wiki.tar.bz2\n", 
  "id": 4805709
}