{
  "read_at": 1462550371, 
  "description": "Description of One Codex B. anthracis marker panel design and testing", 
  "README.md": "# One Codex fork of Paper Now\nThis is a simple fork of the base PeerJ Paper Now project, that we'll try to keep in sync with github.com/peerj/paper-now. Here are the main differences and guidelines:\n* The `_config.yml` file is updated to use forked versions of the style guide and research article component. The latter is probably unnecessary, the former makes a few style tweaks. `_config_dev.yml` is removed.\n* `article.html` includes a few necessary extra elements in the `<head>`, e.g., a favicon, custom fonts, etc.\n* **Local editing**: Run `./serve.sh` to keep your docs updated while editing. By default, the page will be available at `http://localhost:4000/paper-now/`. Note you'll need the dependencies (`bundle install` should grab them for you)\n* **\"Staging\"**: By default, if you push a `gh-pages` branch, you will be able to see the article at `https://onecodex.github.io/<REPO_NAME>`. As a consequence of this, it's a good practice to name the repo to match the ultimate intended deployment location (see below).\n* **Deployment**: Run `./sync.sh` to deploy (you'll need appropriate AWS credentials). Note that you need to edit the `baseurl` variable in `_config.yml` and `LOCATION` environment variable in `sync.sh` to match - and this will be where the article gets hosted, e.g., `LOCATION=microbiome-16s-vs-shotgun` would host the article at `https://science.onecodex.com/microbiome-16s-vs-shotgun/`\n* **Feedback and commentary**: You can comment on draft articles via Hypothes.is. Please use the `https://onecodex.github.io/<REPO_NAME>/` link when doing so. Note that this apparently only really works in Chrome. :(\n \n# Paper Now\n\nCreate, edit and (optionally) display a journal article, entirely in GitHub.\n\nIn contrast to the more traditional process of `submit > peer review > publish` at [PeerJ](https://peerj.com), or even the less formal preprints at _PeerJ Preprints_ or _arXiv_, _Paper Now_ is an experiment to see where the future may go with scholarly communication. Initially, it may be that co-authors collaborate either privately or publicly on GitHub and then proceed to submitting to PeerJ or other journals for formal peer-review or preprinting. Or perhaps this is where the traditional medium of publication begins to diverge. There is no end goal other than to see what the academic community wants, which is why this is completely open to fork, extend, and build upon.\n\n## Examples\n\n* [Searching for anthrax in the New York City subway metagenome](https://read-lab-confederation.github.io/nyc-subway-anthrax-study/)\n* [Collapse of the world's largest herbivores](http://git.macropus.org/collapse-largest-herbivores/)\n* [Evidence for embodied predictive coding: the anterior insula coordinates cortical processing of tactile deviancy](http://git.macropus.org/allen-insula/)\n* [Capsules of the diatom _Achnanthidium minutissimum_ arise from fibrillar precursors and foster attachment of bacteria](https://katrinleinweber.github.io/paper-now/)\n* [Paper Now example article](https://peerj.github.io/paper-now/)\n\n## Instructions\n\n1. Clone this repository to your own account, by visiting [GitHub's importer](https://import.github.com/new/?import_url=https://github.com/peerj/paper-now/).\n1. [Edit the article metadata](_data/article.yml)\n1. Add [data](data)* and [figures](_figures)\n1. [Edit each section](_sections)\n1. [View your article](https://peerj.github.io/paper-now/) in GitHub Pages at https://{username}.github.io/paper-now\n\n## Notes\n\n* Paper Now is at a very experimental stage; it may progress further if people find it useful.\n* Paper Now is inspired by [Jekyll Now](https://github.com/barryclark/jekyll-now); the sidebar layout is inspired by [Lens](https://github.com/elifesciences/lens).\n* If you rename your repository, you also need to change the `baseurl` setting in [_config.yml](_config.yml) to match.\n* *There isn't currently a way to upload binary files using GitHub's web interface, so you'll need to do this locally. [GitHub's desktop client](https://guides.github.com/introduction/getting-your-project-on-github/#desktop) is probably the easiest way to clone a repository, add files and push the changes back to GitHub.\n* The article styles and scripts are in [a separate web component](https://github.com/PeerJ/research-article), so can be updated independently of the article content.\n\n## Feedback\n\n* Does this article structure make sense? Would it be better all in one file? [Create an issue](https://github.com/peerj/paper-now/issues) to discuss it.\n* Made changes to the layout templates or some other part of the code? [Fork this repository](https://github.com/peerj/paper-now/fork), make your changes, and [send a pull request](https://github.com/peerj/paper-now/pulls).\n", 
  "id": 48093163
}