{
  "read_at": 1462550315, 
  "description": "MagDots: Magnetization dynamics of nanoelement arrays", 
  "README.md": "# MagDots: Magnetization dynamics of nanoelement arrays\n\n[![DOI](https://zenodo.org/badge/19702/ivlis/MagDots.svg)](https://zenodo.org/badge/latestdoi/19702/ivlis/MagDots)\n\n## Purpose\n\nThe program is capable to calculate a spin-wave spectrum and a distribution of an internal magnetic\nfield in infinite and semi-infinite arrays of magnetic elements arranged in period lattice with a\ncomplex elementary cell. The program implements ideas proposed in [\"Theoretical formalism for\ncollective spin-wave edge excitations in arrays of dipolarly interacting magnetic\nnanodots\"](http://arxiv.org/abs/1511.08483).\n\n## Installation\n\n### Requirements\n* Python 3.4 or later\n* Cython and a C compiler\n* NumPy and SciPy\n* Matplotlib for plotting\n\nTo compile the Cython code execute the Makefile. Compilation was tested on Linux-based systems only,\nhowever, should work on other systems with Cython and a C compiler installed. \n\nHaving the Cython code complied, one can run examples from the `examples` directory\n\n## Usage\n\nThe program has two modes for bulk and edge spectra calculations. Examples in the `examples`\ndirectory are self-explanatory, but it is implied that a user is familiar with the method of calculation.\n\n### Examples\n\n#### Bulk spin-wave modes\n* `bulk/calc_FM.py` calculation of *bulk* spin-wave spectra of an array of circular pillars arranged in a\n  square lattice in a ferromagnetic ground state\n* `bulk/calc_CAFM.py` the same as for the above, but for a chessboard antiferromagnetic ground state\n* `bulk/calc_equilibrium.py` calculate spin-wave spectra of an array of nanoelements arranged in a\n  hexagonal lattice , magnetized by a bias magnetic field in an arbitrary direction\n\n#### Edge spin-wave modes\n* `edge/calc_FM.py` calculation of *edge* spin-wave spectra of an array of circular pillars arranged in a\n  square lattice in a ferromagnetic ground state\n* `edge/calc_CAFM.py` the same as for the above, but for a chessboard antiferromagnetic ground state\n* `edge/calc_CAFM_domain_wall.py` calculation of a domain-wall spin-wave spectrum existing between\n  two chessboard antiferromagnetic ground states\n\n### How to cite \n\nIf you are using this program or/and produce scientific publications based on it,\nwe kindly ask you cite it as:\n\n> Ivan Lisenkov, Vasyl Tyberkevych, Sergey Nikitov, Andrei Slavin  \n> Theoretical formalism for collective spin-wave edge excitations in arrays of dipolarly interacting magnetic nanodots  \n> arXiv:1511.08483  \n> http://arxiv.org/abs/1511.08483\n\n\n### Copyright\n\nThe program is written by Ivan Lisenkov. The analytical theory is developed by Ivan Lisenkov, Vasyl\nTyberkevych and Andrei Slavin at The Department of Physics, Oakland University, Rochester, Michigan, USA.\n\n(C) 2015 Ivan Lisenkov\n\nDepartment of Physics  \nOakland University  \n2200 N. Squirrel Rd  \nRochester, MI, U.S.A.  \n48309-4401\n\nMagDots is free software: you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\n\nMagDots is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with MagDots.  If not, see <http://www.gnu.org/licenses/>.\n\n\n\n", 
  "id": 48213578
}