{
  "read_at": 1462550295, 
  "description": "krk bibliography ", 
  "README.txt": "\nKRKbib bibliography README file\nv. 0.02b \nJacek Grela 19.01.2016\n\nThis readme file contains most of the information needed to use and maintain the krkbib bibliography file in a consistent manner. \n\n      I. Getting started\n        a) compile the template\n        b) basic bib(la)tex commands\n      II. Bibtex files\n        a) structure of the files\n        b) modify the bibtex file (with JabRef)\n      III. Tips & Troubleshooting\n      IV. Files description\n\n\n\nI. Getting started\n\n\n\ta) compile the template\n\n      bibtemp.tex is the template file useful in setting up your favourite latex editor. A standard procedure to run latex+biblatex is the same as bibtex and can contains three compilation steps:\n\n\n    latex foobar.tex\n    bibtex foobar.aux\n    latex foobar.tex\n\n\n      which first produces a file foobar.aux and only afterwards the foobar.dvi - a rendered document file. We encourage to set up your favourite latex editor so that the bibtemp.tex gets compiled without errors. \n\n\n\n\tb) basic biblatex commands\n\n      * First, biblatex needs a package of the same name:\n\n\n    \\usepackage[backend=bibtex,style=phys]{biblatex}\n\n\n      * Second, a bibliography file is needed:\n\n\n    \\addbibresource{krkbib2015.bib}\n\n\n      * Lastly, to print the bibliography we use:\n\n\n    \\printbibliography[title={Bibliography}]\n\n\n      which will include all citations in the text. For advanced options check ftp://sunsite.icm.edu.pl/pub/CTAN/macros/latex/contrib/biblatex/doc/biblatex.pdf\n\n    \n\nII. Bibtex files\n\t\n\n\ta) structure of the files\n\n      Bibtex files have the following naming structure:\n\n\n    krkbibYEAR.bib\n\n\n      where YEAR is the year of krkbib existence. Authors are encouraged to add references to the current-year file. \n      \n      Bibtex file contains of records of mainly three types: @Article (articles), @Book (whole books) and @Unpublished (preprints). The general naming scheme of references is the following\n\n\n\t  AuthorsYear:DESCRIPTION\n\n\n      * \"Authors\" part\n        \n        We use abbreviated last names of all authors (if few) as appears in the paper or use \"etal\" in case of large collaborations. The length of abbreviations are as follows:\n\n        1 authors - three letters of the last name\n        2-4 authors - one letter for each author\n        more than 4 authors - one letter of first three authors and \"+\" sign in the end\n\n        It is advisable to drop this naming scheme if there is any confusion arising f.e. if two different groups has the same initials.\n\n      * \"Year\" field\n        \n        It is the publication year (in case of articles and books) or, in case of preprints, the publication on the arxiv.\n\n      * \"DESCRIPTION\" field\n\n        It is given in CAPITAL letters and should succinctly describe the paper in one or two words.\n        We describe below properties for each type of entry:\n\n\n      We provide examples:\n\n    CM1998:EIGENVECTOR\n\n      for a paper on eigenvectors of two authors Chalker and Mehlig published in 1998.\n\n    BGN+2015:HERMDETS\n\n      this paper on hermitian determinants was published by 4 authors: Blaizot, Grela, Nowak and Warchol. Date of publication is 2015.\n\n\n      Below we describe the most popular entries and the COMPULSORY properties for each type of entry. Some optional items are also listed however with the OPTIONAL caption.\n      It is possible to add more information however one should be especially careful around certain fields. The policy is that more information is almost always better.\n\n\t      1. @Article:\n\n          Title - title as appeared in the journal/arxiv\n          Author - authors in the  preferable format: \"Lastname, Firstname and Lastname2, Firstname2. and Lastname3, Firstname3\", irst name can be abbreviated if unknown\n          Doi (OPTIONAL) - digital object identification number (check the validity at https://www.doi.org/), often non-existent for older articles\n          Journal - journal title in the abbreviated form i.e. Phys. Rev. E or J. Math. Phys. (check jourabbr for popular journals)\n          Keywords - keywords identifying the content (check keywords file for a list)\n          Number - journal number or issue (WARNING: a similar \"Issue\" property should NOT be used)\n          Pages - first page of the article\n          Url (OPTIONAL) - an external url to the page with the article. Most often the sources are available from aps.org, sciencedirect.com, iop.org and springer.com \n          Volume - volume of the journal \n          Year - publication year\n          Owner - identifier of the reference creator\n          Timestamp - modification date\n\n        Example:\n\n          @Article{Sni2002:BROWNMEASURE,\n            Title                    = {Random Regularization of Brown Spectral Measure},\n            Author                   = {\\'Sniady, Piotr},\n            Doi                      = {10.1006/jfan.2001.3935},\n            Journal                  = {J. Funct. Anal.},\n            Keywords                 = {brown,freeprob},\n            Number                   = {2},\n            Pages                    = {291},\n            Url                      = {http://www.sciencedirect.com/science/article/pii/S0022123601939357},\n            Volume                   = {193},\n            Year                     = {2002},\n            Owner                    = {grela},\n            Timestamp                = {2016.01.13}\n          }\n\n\n\n        2. @Book\n\n          Title - book title\n          Author - authors of the book\n          Edition - arabic number of edition\n          Publisher - publisher of the book\n          Year - editions' publication date\n          Owner - see @Article\n          Timestamp - see @Article\n\n        Example:\n\n          @Book{AnAsRo1999:SPECIALFUNC,\n            Title                    = {Special Functions},\n            Author                   = {Andrews, G. E. and Askey, G. and Roy, R.},\n            Edition                  = {1},\n            Publisher                = {Cambridge University Press},\n            Year                     = {1999},\n            Owner                    = {grela},\n            Timestamp                = {2016.01.10}\n          }\n\n\n\n        3. @Unpublished\n\n          Title - preprint's title\n          Arxivid - id number on the arxiv.org\n          Author - authors\n          Keywords - keywords identifying the content (check keywords file for a list)\n          Note - note of the form: \"unpublished, arXiv:NUMBER\" where NUMBER should be the same as in the entry Arxivid.\n          Url - URL of the preprint as on arxiv\n          Year - publication date\n          Owner - as in @Article\n          Timestamp - as in @Article\n\n        Example:\n\n          @Unpublished{AlBuBo2014:HERMEV,\n            Title                    = {The eigenvectors of Gaussian matrices with an external source},\n            Arxivid                  = {1412.7108},\n            Author                   = {Allez, Romain and Bun, Joel and Bouchaud, Jean-Paul},\n            Keywords                 = {rmt,eigenvector,externalsource},\n            Note                     = {unpublished, arXiv:1412.7108},\n            Url                      = {http://arxiv.org/abs/1412.7108},\n            Year                     = {2014},\n            Owner                    = {grela},\n            Timestamp                = {2016.01.10}\n          }\n\n\n\n      One may also need (less-popular) entries like:\n\n        4. @InProceedings (to refer to articles appearing in conference proceedings)\n\n          Title - self-explanatory\n          Author - self-explanatory\n          Booktitle - proceedings title (full, as it is a book)\n          Keywords - keywords identifying the content (check keywords file for a list)\n          Year - publication year\n          Editor (OPTIONAL) - editors of the proceedings\n          Pages - first page of the article\n          Publisher - publisher\n          Owner - as in @Article\n          Timestamp - as in @Article\n\n        Example:\n\n          @Inproceedings{Spo1998:DYSON,\n            Title                    = {Dyson's model of interacting Brownian motions at arbitrary coupling strength},\n            Author                   = {Spohn, Herbert},\n            Booktitle                = {Markov Proc. Rel. Fields},\n            Keywords                 = {brown},\n            Year                     = {1998},\n            Pages                    = {649},\n\n            Owner                    = {grela},\n            Timestamp                = {2016.01.13}\n          }\n\n\n\n        5. @InBook (to cite chapters/parts of a book)\n\n          Title - title of the chapter\n          Author - author of the chapter\n          Chapter (OPTIONAL) - which chapter\n          Pages - which page\n          Publisher - who published\n          Year - publication year\n          Volume (OPTIONAL) - which volume, if applicable\n          Booktitle - title of the book\n          Owner - as in @Article\n          Timestamp - as in @Article\n\n        Example:\n\n          @InBook{For1998:LOGGAS,\n            Title                    = {Random matrices, log-gases and the Calogero-Sutherland model},\n            Author                   = {Forrester, Peter J.},\n            Pages                    = {97},\n            Publisher                = {The Mathematical Society of Japan},\n            Year                     = {1998},\n            Volume                   = {1},\n            Booktitle                = {Quantum Many-Body Problems and Representation Theory},\n            Doi                      = {10.2969/msjmemoirs/00101C020},\n            Owner                    = {grela},\n            Timestamp                = {2016.01.14},\n            Url                      = {http://dx.doi.org/10.2969/msjmemoirs/00101C020}\n          }\n\n\n\n\tb) modify the bibtex file (using JabRef)\n\n    Although manual addition of records is possible, authors are encouraged to add to the existing bibliography by the use of an external referencing tool i.e. JabRef ( http://www.jabref.org/ ). \n    It is a cross-platform, Java-based tool whose sole purpose is to ease the management of bibliographies. To run the whole process one needs export the preferences contained in the jabrefset.xml file. \n\n    We shall briefly describe useful JabRef features:\n\n    * able to import databases (in particular from webpages)\n\n      References are most easily extracted from pages like aps.org, sciencedirect.com, iop.org and springer.com. We can simply copy&paste them into JabRef and modify accordingly.\n\n    * journal abbreviation\n\n      Toggle abbreviation button shortens the names of journals appropriately. It uses and needs the jourabbr file.\n\n    * automatic naming (BibTex key generation)\n\n      The naming described in Sec. IIa is implemented automatically under Tools -> Autogenerate BibTex keys, the description can be changed manually if need be.\n\n    * groups\n\n      Groups or categories are implemented in JabRef and written inside the bibtex file as @comment entries. A very useful feature to create sets of papers cited in your own research.\n\n\n\nIII. Tips and troubleshooting:\n\n  1. Be sure that new entries does not contain UTF-8 coded greek letters. Instead use math-environment i.e. {$\\alpha$} instead of a. \n  Although no problems should occur when compiling, UTF-8 greek letters won't be properly interpreted by latex.\n\n  2. Math environment inside records need parentheses i.e. {$\\alpha$}. Absence of these parentheses will produce compiling errors:\n\n\t  ! Extra }, or forgotten $.\n\t  <recently read> }\n\n  3. Make sure only standard hyphen is used i.e. \n\n    U+002D -\n\n  non standard hyphens include:\n\n    U+2010 -\n    U+2011 -\n    U+2012 -\n    U+2013 -\n    U+2014 --\n    U+2015 --\n\n  among others. These will almost surely be wrongly interpreted by latex as can be checked by compiling the bib-all.tex file. \n\n  4. Altogether avoid the abstract field which is almost always added when entries are imported from various websites. \n  This field remains the main source of problems with coding discussed before. \n\n\nIV. File description\n\n  Files contained in the krkbib directory are the following:\n\n    bib-all.tex - a tex file with all (uses biblatex)\n    temp-biblatex.tex - template file with the bibliography set up (uses biblatex)\n    temp-revtex.tex - template file with the bibliography set up, compatible with revtex (uses bibtex)\n    jabrefset.xml - JabRef standard settings (used by JabRef)\n    jourabbr - journal abbreviation (used by JabRef)\n    keywords - list of keywords used to group the entries\n    krkbib2015.bib - main bibliography file, this file contains all information needed for external projects\n    README.txt - this readme file\n", 
  "id": 48383470
}