{
  "read_at": 1462551206, 
  "description": "R package additivityTests", 
  "README.md": "# additivityTests\n\nadditivityTests is R package for additivity tests in the two way ANOVA with just one observation per cell.\n\n## Introduction\n\nIn many applications of statistical methods, it is assumed that the response\nvariable is a sum of several factors and a random noise. In a real world this may\nnot be an appropriate model. For example, some patients may react differently\nto the same drug treatment or the effect of fertilizer may be influenced\nby the type of a soil. There might exist an interaction between factors. \n\nIf there is more than one observation per cell then standard ANOVA techniques\nmay be applied. Unfortunately, in many cases it is infeasible to get\nmore than one observation taken under the same conditions. For instance, it\nis not logical to ask the same student the same question twice.\n\nSix tests of additivity hypothesis (under various alternatives) have been included in this package: \nTukey test, modified Tukey test, Johnson-Graybill test, LBI test, Mandel test and Tusell test.\n\n## Example\n\nLet us generate 10 random subjects, 10 random treatmeants and combine them into a dataset (with no interaction):\n\n```S\n    set.seed(123)\n    subjects = rnorm(10)\n    treatments = rnorm(10)\n    noise = rnorm(100)/100\n    Y = matrix(rep(subjects,10), 10, 10) + matrix(rep(treatments, each=10), 10, 10) + noise\n```\n\nThe tests should **not** reject the additive hypothesis: \n\n```S\n    tukey.test(Y)\n    mandel.test(Y)\n    lbi.test(Y)\n    tusell.test(Y)\n    johnson.graybill.test(Y)\n    mandel.test(Y)\n    mtukey.test(Y, correction=2, Nboot=1000)\n```\n\nNow, the extra effect will be added to the last 5 subjects. The tests **should** reject the additive hypothesis:   \n\n```S\n    Y[1:5,] = Y[1:5,] + 10*rep(treatments, each=5)\n    \n    tukey.test(Y)\n    mandel.test(Y)\n    lbi.test(Y)\n    tusell.test(Y)\n    johnson.graybill.test(Y)\n    mandel.test(Y)\n    mtukey.test(Y, correction=2, Nboot=1000)\n```\n\n## Installation\n\nTo install the additivityTests from Github, it's easiest to use the `devtools` package:\n\n```S\n    # install.packages(\"devtools\")\n    library(devtools)\n    install_github(\"simecek/additivityTests\")\n```    \n\nOr you can access the stable package version available on [[CRAN]](http://cran.r-project.org/web/packages/additivityTests/)\n\n## References\n\nSimecek, Petr and Simeckova, Marie. \"Modification of Tukey's additivity test.\" Journal of Statistical Planning and Inference (2012). [[ScienceDirect]](http://www.sciencedirect.com/science/article/pii/S037837581200239X) [[arXiv]](http://arxiv.org/abs/1207.2883)\n\nRasch, Dieter, et al. \"Tests of additivity in mixed and fixed effect two-way ANOVA models with single sub-class numbers.\" Statistical Papers 50.4 (2009): 905-916. [[Springer]](http://rd.springer.com/article/10.1007/s00362-009-0254-4#page-1)\n", 
  "id": 4852339
}