{
  "read_at": 1462550260, 
  "description": "The 1998 proof of the Kepler Conjecture by Sam Ferguson and Tom Hales (original code).", 
  "README.md": "# The 1998 Proof of the Kepler Conjecture\n\nThe Kepler conjecture asserts that no packing of congruent balls in Euclidean 3-space has\ndensity greater than the familiar pyramid-shaped packing used to stack oranges at the market.\n\nThis repository contains the computer code and other documentation for the\n1998 proof of the Kepler Conjecture by Sam Ferguson and Tom Hales.  This code\nis not regularly maintained, but it has been deposited at github as a historical record.\n\n## The non-computer portions of proof are given in a series of eight papers available from the arXiv.\n\n* [An overview of the Kepler Conjecture](http://arxiv.org/abs/math/9811071)\n* [A Formulation of the Kepler Conjecture](http://arxiv.org/abs/math/9811072)\n* [Sphere Packings I](http://arxiv.org/abs/math/9811073)\n* [Sphere Packings II](http://arxiv.org/abs/math/9811074)\n* [Sphere Packings III](http://arxiv.org/abs/math/9811075)\n* [Sphere Packings IV](http://arxiv.org/abs/math/9811076)\n* [Sphere Packings V](http://arxiv.org/abs/math/9811077)\n* [the Kepler Conjecture](http://arxiv.org/abs/math/9811078)\n\n## Other repositories\n\nPortions of this code have been deposited at the [arXiv](http://arxiv.org/abs/math/9811078) and with the \n[Annals of Mathematics](http://annals.math.princeton.edu/2005/162-3/p01).\n\n## Computer portions of the proof\n\nThe computer portions of the proof fall into three main bodies of code, as reflected below in the directory\nstructure.\n\n* The verification of nonlinear inequalities by [`interval`](interval) arithmetic.\n* The verification of [`linear`](linear) programs.  \n* The generation of all planar [`graphs`](graph) satisfying a technical list of properties.\n\n## Directory structure\n\n[`documents/index.html`](documents/index.html) This is the entry point for all html documentation.\n\n[`documents`](documents) Html code, graphics, and other documentation.\n\n[`dodec`](dodec) Materials related to Sean McLaughlin's proof of the dodecahedral conjecture.\t\n\n[`graph`](graph) A java program to generate tame planar graphs.\n\n[`honey`](honey) Materials related to the proof of the honeycomb conjecture.\n\n[`interval`](interval) Interval arithmetic verification of nonlinear inequalities.\n\n[`linear`](linear) Linear programming.  This directory contains the bulk of the project code in the form\nof \n\n[`numerical`](numerical) Code for the numerical verification of nonlinear inequalities.  This part is not\nmathematically rigorous.\n\n[`samf`](samf)  Sam Ferguson's code related to the Kepler Conjecture.\n\n## Changes\n\nThis repository of code is essentially the same as the collection of files available from Hales's website\nat the University of Michigan and the University of Pittsburgh, from around 1997-2013.  Html files have been\nmoved to a new documents subdirectory, updating some links.\n\nTo accommodate github's 100MB size limits on files, we have split the\nzip file in [`linear/SHORT/PENT`](linear/SHORT/PENT) in two.\n\nA more recent project, github.com/flyspeck/flyspeck, gives a formal proof of the Kepler conjecture.\n", 
  "id": 48559728
}