{
  "read_at": 1462550226, 
  "description": "An Electron app which finds out some meaningful topics from PDF files by Latent Dirichlet Allocation using SCVB0 inference method", 
  "README.md": "# PDFTopicker\n\nPDFTopickerhaLun Wen nadoFu Shu noPDFhuairukaraikutsukano[topitsuku] woChou Chu suruapuridesu. \ntopitsukuwoYong iteFu Shu noPDFhuairuwoYao Yue saserukotode, Yi tsuYi tsunoPDFhuairuwoJian zuniQuan Ti noHua Ti woBa Wo surukotogadekimasu. \napurikeshiyonhaElectron( http://electron.atom.io )woYong iteGou Cheng sareteori, topitsukuwoChou Chu suruarugorizumutoshite\nLatent Dirichlet Allocation (LDA)woYong iteimasu. matasonoTui Lun Shou Fa toshiteKDD2013deTi An saretaStochastic Collapsed Variational Bayesian Inference ( http://arxiv.org/abs/1305.2452 ) toiuShou Fa woJavaScriptdeShi Zhuang shimashita. \n\n\n## Shi iFang \n\nYi Xia nokomandodeapuriworokarunikuronshi, Qi Dong shimasu. (OS XnomideDong Zuo Que Ren Ji mi)\n\n```bash\ngit clone https://github.com/naruaway/PDFTopicker.git && cd PDFTopicker && npm install && npm start\n```\napuriQi Dong Hou , Shang Bu no'drop here'toShu itearuzonniPDFhuairuwodorotsupushitekudasai. (Ying Yu noPDFnomiDui Ying )\ndorotsupusaretahuairuniDui shiteZi Dong De niQian Chu Li gaZou ri, Chu Li Ji minohuairuhaXia Bu no'Processed Files'niYi Dong shimasu. \nPDFhuairuniyotsutehaChu Li gaumakuikazu, Chu Li gaZhi matsuteshimauChang He gaarimasu. konoyounaChang He haapuriwoZai Qi Dong shiteChu Li Ke Neng naPDFhuairunomiwodorotsupushiZhi shitekudasai. \n![Jie Xi Qian noHua Mian ](images/before-analyzing.png)\n\n\nFen Xi Dui Xiang toshitaihuairugasubete'Processed Files'niarukotowoQue Ren shitekara, 'Start Analyzing'botanwoYa sutoFen Xi gaKai Shi shimasu. \nFen Xi Zhong Liao Hou , Chou Chu sareta5tsunotopitsukugaBiao Shi saremasu. Shang Wei noDan Yu hodosonotopitsukuwoyoriTe Zheng Fu keruYu tonatsuteimasu. \n![topitsukuYi Lan Hua Mian ](images/topics.png)\n\n## Shi Yang \n\n* PDFhuairuwodorotsupusurudakedetopitsukuFen Xi gadekiru\n* Pu Tong noPCdemoShi Fen naSu Du deShi Xing Ke Neng \n* topitsukumoderunoarugorizumuwoHan metesubeteJavaScript (ES2015)deShi Zhuang \n\n## Gong Fu shitaDian \n\n* Jin Nian Ti An sareteBi Jiao De Su iLDAnoTui Lun arugorizumutoshite Stochastic Collapsed Variational Bayesian Inference ( http://arxiv.org/abs/1305.2452 )woJavaScriptdeShi Zhuang \n* Cycle.js ( http://cycle.js.org ) woYong irukotodeUIniGuan warukodonodetahurowowakariyasukushita\n* PDFkaranoDan Yu Chou Chu totopitsukuJie Xi nihaaruCheng Du Shi Jian gakakarutame, Bie purosesudeChu Li shi, Jie Guo wopurosesuJian Tong Xin woYong iteFei Tong Qi niFan su\n\n\n## Shi Yong Ji Shu hurekuwakuraiburari\n\n* apurikeshiyonQuan Ti toshiteElectron ( http://electron.atom.io ) woShi Yong \n* topitsukuFen Xi nokodowoHan metekodohasubeteJavaScript (ES2015)\n* UIGuan Lian nokodoniha Cycle.js ( http://cycle.js.org ) woCai Yong shi, Model-View-Intent deShe Ji \n* Nei Bu nodetaGou Zao toshiteYi Bu  immutable.js ( https://facebook.github.io/immutable-js/ ) woShi Yong \n* PDFkaraDan Yu woChou Chu surutamenipdf2json ( https://github.com/modesty/pdf2json ) woShi Yong \n\n\n## Ji Zhi noZhi Yue \n* PDFhuairuniyotsutepdf2jsongaeraibentowoTu kazuniZhi marukotogaaru. \n", 
  "id": 48836614
}