{
  "read_at": 1462552388, 
  "description": "Salient Object Detection: A Benchmark", 
  "README.md": "# SalBenchmark\nSalient Object Detection: A Benchmark\n\n\nThe Saliency Benchmark compare, qualitatively and quantitatively, 42 state-of-the-art models(30 salient object detection, 10 fixation prediction, 1 objectness, and 1 baseline) over 6 challenging datasets for the purpose of benchmarking salient object detection and segmentation methods. \n\n\nPlease refer our project page for the url of each method: http://mmcheng.net/salobjbenchmark/\n\n\nThis is a sample code for the Benchmark evaluation.\n\n#Table of Contents\n=================\n\n- Quick Start\n\t1. Download the code from this Git project page: https://github.com/MingMingCheng/SalBenchmark.\n\t2. Install OpenCV (2.0 and 3.0 are both OK).\n\t3. Run ./Code/matlab/RunAll.m to produce SaliencyMap.\n\t4. Open ./Code/Demo.sln (Visual Studio 2013).\n\t5. Press \"Ctrl + F5\" in release x64(recommend).\n\t6. OK,you have got all materials (saliency maps for each image, tables and figures in our paper, etc.).\n\t\n- Noets\n\t1. There are tow DataSets named \"DataSet1\" and \"DataSet2\" in ./Data Folder.\n\t2. In the DataSet exist one Folder named \"Imgs\", which include Source images and correspond Ground Truth. \n\t3. You can put your own Dataset using the format above.\n\t4. If \"Quick Start\" is finished, You will get a Folder-\"Results\", which include all the results. In this Folder, you can run \"DataSet***.m\" by Matlab to get all evaluate curve in correspond DataSet. And run the Results.tex, you can get all charts.\t\n\t5. Questions directly related to my source code and project is welcome. Please refer to the project page for detailed contact information. Emails regarding questions like how to install and configure OpenCV will not be replied.\n\t\n- Warning\n\t1. You should not put this sample in the Folder using ChineseName or name with space.\n\n- The source code is for educational and research use only. If you use any part of the source code, please cite related papers.\n\t1. Salient Object Detection: A Benchmark, Ali Borji, Ming-Ming Cheng, Huaizu Jiang, Jia Li, IEEE TIP, 2015.\n\t2. Salient Object Detection: A Survey, Ali Borji, Ming-Ming Cheng, Huaizu Jiang, Jia Li, arXiv eprint, 2014.\n\t3. Global Contrast based Salient Region Detection. Ming-Ming Cheng, Niloy J. Mitra, Xiaolei Huang, Philip H. S. Torr, Shi-Min Hu. IEEE TPAMI, 2015.\n", 
  "id": 48909769
}