{
  "read_at": 1462552760, 
  "description": "", 
  "README.md": "# L1AdaptiveTrendFilter.jl\n\nL1AdaptiveTrendFilter.jl is a Julia package for filtering and identifying unknown underlying trends of a given noisy signal. It is originally a supplemental material for our paper [\"L1 Adaptive Trend Filter via Fast Coordinate Descent\"][l1adaptivepaper].\n\n## Installing\n\nIn order to use it, download the package in the julia prompt with the command:\n```\nPkg.clone(\"git://github.com/joaquimg/L1AdaptiveTrendFilter.jl.git\")\n```\n\nThen simply include the command `using L1AdaptiveTrendFilter` to import the package.\n\n## Filtering\n\nThe function `l1_adaptive_trend_filter` performs the filtering via coordinate descent and takes the following required inputs:\n\n* y : Signal or time-series to be filtered;\n* components: List of integers corresponding to the types of components to be considered.\n\nOptional inputs:\n\n* f: Vector of overcomplete frequencies (Default=o);\n* numl: Size of the regularizer path for the parameter l (Default=40);\n* numg: Size of the regularizer path for the parameter g (Default=10);\n* MAXITER: Maximum number of iterations (Default=500);\n* verbose: Boolean flag for displaying progress of algorithm (Default=false);\n* lower_bounds: List of lower bounds for each component type (Default=[-[?],-[?],-[?],-[?],-[?]]);\n* upper_bounds: List of upper bpunds for each component type (Default=[+[?],+[?],+[?],+[?],+[?]]).\n\nThis function returns:\n\n*  b_path: Path of components coefficients;\n*  y_path: Path of filtered signals;\n*  b_best: Best components coefficients according to the EBIC criteria;\n*  y_best: Best filtered signal according to the EBIC criteria;\n*  l_best: Best value for the l regularizer according to the EBIC criteria;\n*  g_best: Best value for the g regularizer according to the EBIC criteria.\n\n## Example\n\n## Citing this package\n\nPlease use the following Bibtex reference:\n```\n@article{souto2016ell_1,\n  title={$$\\backslash$ ell\\_1 $ Adaptive Trend Filter via Fast Coordinate Descent},\n  author={Souto, Mario and Garcia, Joaquim D and Amaral, Gustavo C},\n  journal={arXiv preprint arXiv:1603.03799},\n  year={2016}\n}\n```\n\n[l1adaptivepaper]: http://arxiv.org/pdf/1603.03799.pdf\n", 
  "id": 49203842
}