{
  "read_at": 1462552721, 
  "description": "Route planning for large graphs", 
  "README.md": "potato-nav\n==========\nA work in progress navigation/path planning library for planet sized graphs.  Heavily inspired by the following work:\n\n* D. Delling, A. Goldberg, T. Pajor, R. Werneck. (2014) \"[Robust Exact Distance Queries on Massive Networks](http://research-srv.microsoft.com/pubs/208867/complexTR-rev2.pdf)\" MSR Technical Report\n\nThis project is organized as a collection of small programs that perform various graph processing related tasks and communicate with some common file formats.\n\nOnce the preprocessing works well enough, it should be possible to take an index that this project generates and serve this over some content-addressable store (like bittorrent), thus allowing for fast peer-to-peer GPS navigation.  Maybe even in a web browser!\n\n# Set up\n\n## Building\n\nFirst install cmake, then run the following commands:\n\n```\nmkdir build\ncd build\ncmake ..\n```\n\nThat will give you a Makefile which you can run using `make`. This project won't work on Windows or systems that don't have gcc/modern mmap features, but I am ok with this.\n\n## Testing\n\nOnce all code objects are built, you can test the program using\n\n## Workflow\n\n1. Convert input data into arc list\n1. Convert arc list into CSR file\n1. Generate a transposed CSR file\n1. Construct index from forward and transposed CSR file\n1. Query index to get fast network distances\n\nUp to querying, the first 4 steps in this process will eventually get wrapped into a shell script once everything is working.  The index files will be served on something like IPFS or WebTorrent and a JavaScript client for generating routes and querying the index will be written.\n\n## Testing\n\n**TODO**\n\n# Tools\n\n### `arc2csr`\nConverts an ARC list into a CSR adjacency list.\n\n### `csr2arc`\nConverts a CSR adjacency list into an ARC list.\n\n### `transpose`\nTransposes a CSR list.\n\n### `sssp`\nSingle Source Shortest Path: Computes all path distances from a single source node.\n\n# File formats\n\n### ARC: Arc list\n\nA plain text file giving a list of arcs and their lengths.  The first line in the file is a single number giving the total number of vertices in the graph, followed by a list of directed arcs, each represnted as a `source target length` triple.  For example, a file with `n` vertices and arcs `(s0,t0), (s1,t1), ...` with respective arc lengths of `l0, l1, ...` would look like this:\n\n```\nn\ns0 t0 l0\ns1 t1 l1\ns2 t2 l2\n...\n```\n\n### CSR: Compressed sparse adjacency list (binary)\n\nA compressed binary adjacency list.  This is similar to an arc list, except that it uses less memory and can be directly `mmap`'d  and queried.\n\n### NAV: Navigation index (binary)\n\nA compressed and query-able index for distance queries.\n\n# Bibliography\n\n* D. Delling, A. Goldberg, R. Werneck. (2014) \"[Hub Labeling (2-Hop Labeling)]( http://www.cs.princeton.edu/~rwerneck/papers/DGW14-hl-encyclopedia.pdf)\"\n\n* D. Delling, A. Goldberg, T. Pajor, R. Werneck. (2014) \"[Robust Exact Distance Queries on Massive Networks](http://research-srv.microsoft.com/pubs/208867/complexTR-rev2.pdf)\" MSR Technical Report\n\n* D. Delling, J. Dibbelt, T. Pajor, R. Werneck. (2015) \"[Public Transit Labeling](http://arxiv.org/pdf/1505.01446.pdf)\" arxiv:1505.01446\n\n# License\n(c) 2015 Mikola Lysenko. MIT License\n", 
  "id": 49379179
}