{
  "read_at": 1462552339, 
  "description": "Software to calculate the Higgs boson lineshape. Can be used to restore the results from the paper arXiv:1509.02406 [hep-ph]", 
  "Readme.md": " \nISR Higgs lineshape calculator\n\n\n\nAuthors:\n\nStanislaw Jadach\n\nStanislaw.Jadach@cern.ch\n\nThe Henryk Niewodniczanski Institute of Nuclear Physics,\nPolish Academy of Sciences,\nul. Radzikowskiego 152, \n31-342 Krakow, Poland\n\n\n\nRadoslaw A. Kycia\n\nrkycia@pk.edu.pl\n\nThe Faculty of Physics, Mathematics and Computer Science\nCracow University of Technology\nul. Warszawska 24,\n31-155 Krakow, Poland\n\n\nBrief description:\n\nProgram calculates ISR infuence for the Higgs lineshape and its broadening by beam energy spread.\nDescription can be found in(software description [1]; theory [2]):\n\n[1] S. Jadach, R.A. Kycia Software for calculations of the Higgs boson lineshape in future lepton colliders; arXiv:1601.02854 [hep-ph]\n\n[2] S. Jadach, R.A. Kycia Lineshape of the Higgs boson in future lepton colliders; Physics Letters B, Volume 755, 10 April 2016, Pages 58-63; doi:10.1016/j.physletb.2016.01.065\n\n\nWarinigs:\n\n1. The programs were written by means of high standards, however, authors are not responsible for any damages that result from the use of these program. Use them at your own risk.\n\n2. If you have any comments, suggestions, questions please write. We will try to answer them in reasonable time.\n\n\n\nDependence:\n\n- GNU C++ compiler - for compilation\n- GNU Make - handling compilation, running visualization. Treat as interpreter.\n- CERN ROOT library\n- Doxygen  - generation of documentation\n- Valgrind - for debugging\n- OpenMPI - for MPI programs\n\nContent:\n- ./Simple  - contains simplified version of program for educational purposes;\n- ./Full    - contains full version of program that creates results published in  arXiv:1509.02406 [hep-ph];\n- ./MPI     - contains MPI version of program from ./Full directory;\n- ./MPI/sigEPlots - contains program that prepares plots of the cross section dependence on beam energy spread;\n- ./MPI/Basic  - contains program that prepare allother plots of ./Full version of the program;\n\n\nThere are following options (type in terminal to see the output):\n\n- make run - compile and run program. \n- make Generate-doc - generates documentation from the code in html and TeX formats using Doxygen.\n- make clean - clean the directory from compilation and output files.\n\n\nLicense:\n\nThis file is part of ISR Higgs lineshape calculator.\n\n    It is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License any later version.\n\n    ISR Higgs lineshape calculator is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with the ISR Higgs lineshape calculator. If not, see <http://www.gnu.org/licenses/>.\n\n\n", 
  "id": 49432084
}