{
  "read_at": 1462552758, 
  "description": "A collection of short movies highlighting the position-position-velocity structure of molecular gas ", 
  "README.md": "================================================================================\nPPV MOVIES\n================================================================================\n\nAbout\n=====\n\nA collection of short movies highlighting the position-position-velocity (PPV)\nstructure of molecular gas. These movies are generated in IDL using the output\nresults from SCOUSE (https://github.com/jdhenshaw/SCOUSE).\n\nContents\n========\n\n1. CMZ_3mm_HNCO_60.mp4 - associated publication: Henshaw et al. (2016), MNRAS\naccepted, arXiv:1601.03732\n\n  A PPV movie highlighting the large-scale kinematic structure of the CMZ. Each\n  pixel denotes the location and centroid velocity of a Gaussian component\n  identified in HNCO emission and extracted using Scouse. The size\n  (from small to large) and colour (from light to dark) of each data point is\n  proportional to the peak intensity of the corresponding spectral component. At\n  the base of the plot, in logarithmic colour-scale, is the Herschel-derived\n  molecular hydrogen column density map (Battersby et al., in prep.). Column\n  densities range from 10^22-10^24 cm^-2. Overlaid are contours highlighting the\n  distribution of HNCO integrated emission. Contour levels are, 5, 25, 45, 65,\n  and 85 per cent of peak (integrated) emission.\n\n2. SgrB2_3mm_HNCO_60.mp4 - associated publication: Henshaw et al. (2016), MNRAS\naccepted, arXiv:1601.03732\n\n  A PPV movie highlighting the kinematic structure of Sgr B2. Each pixel denotes\n  the location and centroid velocity of a Gaussian component identified in HNCO\n  emission and extracted using Scouse. The size (from small to large) and colour\n  (from light to dark) of each data point is proportional to the peak intensity\n  of the corresponding spectral component. At the base of the plot, in\n  logarithmic colour-scale, is the Herschel-derived molecular hydrogen column\n  density map (Battersby et al., in prep.). Column densities range from\n  10^22-10^24 cm^-2. Overlaid are contours highlighting the distribution of HNCO\n  integrated emission. Contour levels are, 5, 25, 45, 65, and 85 per cent of\n  peak (integrated) emission.\n", 
  "id": 49861062
}