{
  "read_at": 1462552980, 
  "description": "", 
  "README.md": "# Rank Aggregation Problem\n\nThis code was developed as part of the course ***Design and Analysis of Algorithms*** of the Graduate Program in Computer Science of the Federal University of Minas Gerais.\n\n## The work\n\nIn this work is presented some heuristics and approximation algorithms to solve the Rank Aggregation Problem based on [Kameny Young](https://en.wikipedia.org/wiki/Kemeny%E2%80%93Young_method) method. ***Rank aggregation problem***\ncan be defined as: *\"The problem of computing a consensus ranking of the alternatives, given the individual ranking preferences of several judges\"[[1](http://www10.org/cdrom/papers/pdf/p577.pdf)]*.\n\n## Brief motivation\nRank aggragation has been extensively studied in the context of social choice theory, where many vote systems were proposed.\nThe Kemeny-Young method is one of the most classical and natural. The problem of computing Kemeny-Young ranking is NP-hard[[2](http://www.ime.usp.br/~rbrito/docs/voting/BF00303169.pdf)] even if there are 4 voters.\n\n## Heuristics and Approximation Algorithms\nThe implmented algorithms are the followings:\n- Pick_A_List: 2-approximation algorithm\n- kPick_A_List: 2-approximation algorithm with locally kamenization(guarantees Condorcet winner)\n- FAS_pivot: 2-approximation algorithm\n- kFas_pivot: 2-approximation algorithm with locally kamenization(guarantees Condorcet winner)\n- FHP_greedy: greedy algorithm\n- kFHP_greedy: greedy algorithm with locally kamenization(guarantees Condorcet winner)\n- Mixed: meta-heuristic, returns the best result among the results of the above algorithms\n\nFor further details consult the file Final_Project_PAA.pdf which is found in this repository(Unfortunately, it is portuguese because I had no time to translate it to English - sorry)\n\n### References\n- [[3](http://dimacs.rutgers.edu/~alantha/papers2/acn05conf.pdf)] N.  Ailon,  M.  Charikar,  and  A.  Newman.   Aggregation  inconsistent  information:  Ranking and clustering.  2005.\n- [3] A. Bar-Noy and J. Naor. Sorting, minimal feedback sets and hamilton paths in tournaments. 1988.\n- [5] C. Dwork, R. Kumar, M. Naor, and D. Sivakumar. Rank Aggregation Methods for the Web. WWW10, 2001.\n- [6] C.  Dwork,  R.  Kumar,  M.  Naor,  and  D.  Sivakumar. Rank  Aggregation  Revisited. 10th International World Wide Web Conference, May 2001.\n- [7] J. Kleinberg and E. Tardos. Algorithm Design .  Addison Wesley, 2006.\n- [8] G. Lv. An Analysis of Rank Aggregation Algorithms.arxiv.org, 2014.\n- [9] H. P. Young. Condorcet's theory of voting. AMERICAN POLITICAL SCIENCE REVIEW,84(4), December 1988\n", 
  "id": 49986784
}