{
  "read_at": 1462552575, 
  "description": "Paedic Topic Models", 
  "README.md": "# Paedic Topic Models\n\n## Topic Modeling \n* The ptm/tm directory contains  code used for topic modeling:  \n  * the ptm_funcs.R file contains the functions used to process raw data, run LDA, and extract concepts and concept distributions.\n  * the ptm_driver.R shows how to use the functions in ptm_funcs.R  .\n  * the lda_1.4.3.tar.gz file contains modified C code to run the \"PTM1\" model. It is based on [the R package lda](https://cran.r-project.org/web/packages/lda/).\n    * To install it from the command line, run: R CMD INSTALL lda_1.4.3.tar.gz. **Warning: this will overwrite your current version of lda**.\n* To download the raw data, click [here](https://www.dropbox.com/s/u93t9fzn3knbxnr/PTM_DATA_01.tar.gz?dl=0).  \n  * The stat-th_pruned directory contains a pruned subset (38) of the wikipedia documents corresponding to \"Statistical Theory\"  \n  * The arxiv_processed_trunc directory contains 3631 documents listed under the 'stat-th' category.  \n    * The document have been truncated at 1000 words and the LaTeX has been stripped. \n    * Date range: 03/2011 - 11/2015  \n\n## tf-idf \n* The ptm/tf-idf directory contains code for generating tf-idf scores for purposes of finding relevant mathematical/statistical topics for arxiv papers.\n\t* The ptm/tf-idf/keyword_search directory contains code which, given a list of concepts (provided in the directory) computes tf-idf scores for this list of concepts for each document in a specified corpus.\n\t\t* The keyword_functions.py file contains functions used to generate regular expressions and to compute tf-idf scores. The tf-idf scores are stored in python dictionaries.\n\t\t* The keyword_driver.py file shows how to use the functions in keyword_functions.py.\n\t* okapi_bm25 scores have been added as well.\n\n* The raw text data for wiki pages and arxiv papers used can be found [here](https://drive.google.com/file/d/0B3wYZ-b_JMsWSHB0NE1jQ2hmWG8/view?usp=sharing)\n* This may be the same data that Matt specified above, but this is what I specifically used.\n", 
  "id": 50066992
}