{
  "read_at": 1462552308, 
  "description": "Generator for exclusive processes - see description in http://arxiv.org/abs/1411.6035", 
  "README.md": "Program name:  \"GenEx\" Generator\n\nWarnings: \n\n1. This is development verison, so if you find any errors/problems do not hesitate to write.\n\n2. The program was written by means of high standards, however, the authors are not responsible for any damages that result from the use of this program. Use it at your own risk.\n\n\n\nAuthors:\n\nRadoslaw Kycia\nrkycia@pk.edu.pl                       \nCracow University of Technology\nKrakow, Poland\n\nJanusz Chwastowski\njchwastowski@pk.edu.pl                       \nCracow University of Technology\nKrakow, Poland\n\nRafal Staszewski\nrafal.staszewski@gmail.com                       \nInstitute of Nuclear Physics, Polish Academy of Sciences \nKrakow, Poland                                                   \n\nJacek Turnau \njacek.turnau@ifj.edu.pl                        \nInstitute of Nuclear Physics, Polish Academy of Sciences \nKrakow, Poland   \n\nBrief descritpion:\n\nGenerator provides universal scheme for HEP generation. It is configured for models of exclusive production of hadron pairs.\nCurrently it implements model of Lebiedowicz and Szczurek [1] (see also [2]) of reaction (see [3]) \\f$2p->2p + \\pi^{+} + \\pi^{-}\\f$ and \\f$2p->2p + K^{+} + K^{-}\\f$, but it is not restricetd to these models.\n\n\nBibliography:\n\n[1] P. Lebiedowicz, A. Szczurek ,,Exclusive \\f$2p->2p + \\pi^{+} + \\pi^{-}\\f$ reaction: from the threshold to LHC'', arXiv:0912.0190\n\n[2] L.A. Harland-Lang, V.A. Khoze , M.G. Ryskin, W.J. ,,Stirling The phenomenology of central exclusive production at hadron colliders'', arXiv:1204.4803 [hep-ph] \n\n[3] A. Szczurek, P. Lebiedowicz, arXiv:1110.4787[hep-ph]\n\n[4] S. Jadach ,,Rapidity Generator for Monte-Carlo Calculations of Cylindrical Phase Space'' Comp. Phys. Comm. 9 (1975) 297\n\n[5] S. Jadach ,,Foam: A General-Purpose Cellular Monte Carlo Event Generator'', arXiv:physics/0203033 [physics.comp-ph]\n\n[6] ROOT framework, (access date: 04/01/2013): http://root.cern.ch/drupal/\n\n[7] TFoam documentation (access date: 04/01/2013): http://root.cern.ch/root/html/TFoam.html\n\n[8] Gnu Scientific Library, (access date: 04/01/2013):  http://www.gnu.org/software/gsl/\n\n[9] Doxygen documentation, (access date: 04/01/2013): http://www.stack.nl/~dimitri/doxygen/\n\n\nDependence:\n\nProgram depends highly on ROOT framework [6]. Every properly installed ROOT with FOAM generator(default for new ROOTs)\nshould work. For FOAM consult [5].\n\nFor compiling (GNU) make system and c++ compiler is required - if ROOT was installed properly from \nthe source then all necessary things to run generator should be installed.\n\n\nThere is a simple (GNU) Makefile available. Before run please check if locations to ROOT folder, ROOT includes and\nROOT libraries in your linking system were set properly.\n\nWarnings:\n1. Underlaying random number generator TRandom3 from ROOT package has the period = 2^19937-1. It is big but finite number. It should be large enough for any today's applications, however anyone who seriously consider generation of much larger set of events should change the generator, change the seed/use the presistency or use hardware random number generators.\n2. It is assumed that first two particles are leading ones.\n\nCommands\n\n- To compile and run type: make all \n  \n  Executable is in ./bin directory\n\n- To compile and run type: make run\n\n- To run example test type: make test\n  \n  Restoring oryginal Generator.dat (with comments) is by selection 0 option.\n\n- To restore folder to original state type: make clean\n\n- To count lines of the program type: make line_count\n\n- To generate Doxygen documentation [9] type: make Generate-doc\n\n\nDirectory structure:\n\n - ./ - main directory contains Makefile, configuration file Generator.dat and scripts that perform various operations.\n - /bin - contains main.x generator program appears after compilation. It is wiped by make clean command.\n - /include - contains header files.\n - /src - contains source files and the main generator file \\b main.cxx\n - /build - is temporary directory for building. It is created by main run command and deleted with all the content by make clean command.\n - /EVENTS - contains files with saved events form the run.\n - /MODEL_DATA - contains configuration (text) files for different models (e.g. matrix elements) used in generation.\n - /ACCEPTANCE_CUTS - contains files with cuts.\n - /Tests - contains sorted generator configuration files sortedConfigLog.log which are used in the second mode of generator running make test \n\nSetup:\n\nThe main configuration file is Generator.dat. It is heavily commented.\n", 
  "id": 50264557
}