{
  "read_at": 1462552582, 
  "description": "This is a GitHub archive for the best known solutions and solvers of the low autocorrelation binary sequence (labs) problem. It also is a testbed for rigorous, transparent, and reproducible performance testing of labs solvers. Maintained by Borko Bošković, Faculty of Electrical Engineering and Computer Science, University of Maribor, Slovenia.", 
  "README.md": "The minimization of the autocorrelation (energy) function, or equivalently the maximization of the binary \nsequence merit factor, has important applications in communication engineering. To physicists, the optimum\nsolution of the labs problem corresponds to the ground state of a generalized one-dimensional Ising spin system\nwith long range 4-spin interactions, also known as the Bernasconi model with **aperiodic autocorrelation**. \nFinding optimum sequences of the labs problem is significantly harder than solving the Ising spin-glass problems\nwith limited interaction and periodic boundary conditions. \n\nIn fact, the runtime asymptotic complexity of the labs problem is much harder than the Optimal Golomb Ruler problem\nthat continues to be solved under massively parallel computation for the past few decades \n(see http://en.wikipedia.org/wiki/Golomb_ruler and http://www.distributed.net/OGR).\n\nPlease use this citation when referring to this archive:\n\nB. Boskovic, F. Brglez and J. Brest, **A GitHub Archive for Solvers and Solutions of the labs problem**, 2016\n\n\n@misc{OPUS2-git_labs-Boskovic,\n\n\tAuthor = {B. Bo\\v{s}kovi\\'{c} and F. Brglez and J. Brest},\n\n\tHowpublished = {{For updates, see \\url{https://github.com/borkob/git_labs}. }},\n\n\tMonth = {January},\n\n\tTitle = {{A GitHub Archive for Solvers and Solutions of the {\\tt labs} problem}},\n\n\tYear = {2016}\n\n}\n\nThe organization of this archive, including the open-source state-of-the-art solvers and summaries of experimental results,\nis based on this paper:\n\n\nB. Boskovic, F. Brglez and J. Brest, **Low-Autocorrelation Binary Sequences: On Improved Merit Factors and Runtime Predictions to Achieve Them**, http://arxiv.org/abs/1406.5301, under review\n\n@article{OPUS2-labs-2016-arxiv-Boskovic,\n\n\tAuthor = {B. Bo\\v{s}kovi\\'{c} and F. Brglez and J. Brest},\n\n\tJournal = {http://arxiv.org/abs/1406.5301, also under journal review}},\n\n\tTitle = {{Low-Autocorrelation Binary Sequences: On Improved Merit Factors and Runtime Predictions to Achieve Them}},\n\n\tYear = {2016}\n\n}\n\n", 
  "id": 50493186
}