{
  "read_at": 1462552960, 
  "description": "Files and notebooks related to Feiden (2016, A&A)", 
  "README.md": "# A Consistent 10 Myr Age for Upper Scorpius\n\nFiles and notebooks related to Feiden (2016, A&amp;A, re-submitted)\n\n## Abstract\n\nWhen determining absolute ages of identifiably young stellar populations, results \nstrongly depend on which stars are studied. Cooler (K, M) stars typically yield \nages that are systematically younger than warmer (A, F, G) stars by a factor of \ntwo. I explore the possibility that these age discrepancies are the result of magnetic \ninhibition of convection in young cool stars by using magnetic stellar evolution \nisochrones to determine the age of the Upper Scorpius subgroup of the Scorpius-Centaurus \nOB Association. A median age of 10 Myr consistent across spectral types A through \nM is found, except for a subset of F-type stars that appear significantly older. \nAgreement is shown for ages derived from the Hertzsprung-Russell diagram and from \nthe empirical mass-radius relationship defined by eclipsing multiple-star systems. \nSurface magnetic field strengths required to produce agreement are of order 2.5 kG \nand are predicted from _a priori_ estimates of equipartition values. A \nregion in the HR diagram is identified that plausibly connects stars whose structures \nare weakly influenced by the presence of magnetic fields with those whose structures \nare strongly influenced by magnetic fields. The models suggest this region is \ncharacterized by stars with rapidly thinning outer convective envelopes where the \nradiative core mass is greater than 80% of the total stellar mass. Furthermore, \ndepletion of lithium predicted from magnetic models appears in better agreement \nwith observed lithium equivalent widths than predictions from non-magnetic models. \nThese results suggest that magnetic inhibition of convection plays an important \nrole in the early evolution of low-mass stars and that it may be responsible for \nnoted age discrepancies in young stellar populations.\n\nSubmitted: 21 Oct 2016; Re-submitted: 27 Apr 2016\n\n## Reference\n\nThe manuscript is under review with Astronomy & Astrophysics, but a pre-print \nmay be downloaded from the arXiv/astro-ph.\n\n", 
  "id": 50675386
}