{
  "read_at": 1462553022, 
  "description": "For simulation of AS isoforms for in-silico differential AS studies", 
  "README.txt": "SPLICESIM 1.8\n=======================\n\nThis is the BETA release of SpliceSim for the simulation of RNA-seq reads for in-silico differential Alternative Splicing (AS) studies. It is a collection of Python scripts designed to conveniently simulate read counts of all genes (in .fastq file format) with a designated set of true AS genes from studying existing experimental datasets (in .sam file format) for the analysis of differential AS quantification studies or comparisons of differential AS quantification schemas available in literature.  \n\nTo use them, you will need the R statistical computing environment (version 3.2.x or later), Python computing environment (version 2.7.x releases) and several Python packages: rpy2, numpy, scipy and HTSeq [1] (available from http://www.lfd.uci.edu/~gohlke/pythonlibs/ as Windows Binaries and http://www-huber.embl.de/users/anders/HTSeq/doc/overview.html respectively) and the Flux Simulator [2] (available from http://sammeth.net/confluence/display/SIM/Home). The Flux Simulator is chosen for its extensive documentation, user-friendliness and its successful application in a similar study [3]. \n\nSpliceSim follows a similar framework applied in a recent study [3] with several features added and the correction of several bugs. Users can also expect a more comprehensive documentation to follow. Currently from our testing, a 64-bit Operating System (OS) installed with a 64-bit Java Virtual Machine i.e. JVM (available from: https://java.com/en/download/manual.jsp) is recommended for simulations. \n\nThe scripts are currently in the BETA stage of development, meaning features will continue to be added and streamlined, though their interfaces are to be kept as consistent as possible as newer versions are to be released subsequently. \n\n*Multivariate Adaptive Regression Splines (MARS) [4] and LOESS with 2-Fold Generalized Cross Validation (GCV) and Monte Carlo GCV have been recently introduced in GenCounts.py for users who are interested in comparison against LOESS. To use MARS, Python packages: scikit-learn and pyearth are required (available from https://github.com/jcrudy/py-earth). Git and Microsoft Visual C++ Compiler for Python 2.7 (available from https://www.microsoft.com/en-us/download/details.aspx?id=44266) may be required for installation of the Python packages.\n\n**There are currently 2 releases of SpliceSim. Initial two releases of SpliceSim (0.99.0 & 1.0) consist of two scripts: GenCounts.py and GenRNAseq.py for Windows platforms which can afford the required dedicated physical memory. Subsequent releases of SpliceSim (1.1 or later) consists of three scripts: GenCounts.py, GenPar.py and GenRNAseqPar.py where GenRNAseq.py is streamlined into GenPar.py and GenRNAseqPar.py.\n\n***The release of SpliceSim 1.8 is updated as of 28/3/2016.\n\nReferences and Acknowledgements:\n\n[1]: Anders S, Pyl PT, Huber W: HTSeq -- A Python framework to work with high-throughput sequencing data. Bioinformatics 2014. Doi:10.1093/bioinformatics/btu638\n\n[2]: Pachter L: Models for transcript quantification from RNA-Seq. arXiv:1104.3889v2 2011. http://arvix.org/abs/1104.3889.\n\n[3]: Liu RL, Loraine AE, Dickerson JA: Comparisons of computational methods for differential alternative splicing detection using RNA-seq in plant systems. BMC Bioinformatics 2014 15:364.\n\n[4]: Friedman J: Multivariate adaptive regression splines. The Annals of Statistics, 1991. 19(1), 1-67. http://www.jstor.org/stable/10.2307/2241837\n", 
  "id": 50709496
}