{
  "_README.txt": "=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n=-=-=-=-=-=-=-=-=-=-=-= ROBOROBO.3=-=-=-=-=-=-=-=\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n=- 2008-2016 -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n-=-=-=-= nicolas.bredeche(at)upmc.fr -=-=-=-=-=-=\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nHow to know about current version and target build? Launch \"roborobo -v\" in the console.\n\nCheck _INSTALL.TXT for installation guide.\n\nCheck _FAQ.TXT for trouble shooting.\n\nCheck this file for anything else.\n\n\n==== QUICK START : COMPILING AND RUNNING ROBOROBO ====\n\n>>> Check _INSTALL.TXT <<<\n\nIf roborobo is installed and running, and you want to quickly get into the code, check Section DEVELOPER'S QUICK START below.\n\n==== DESCRIPTION ====\n\nRoborobo! is a fast and simple 2D mobile robot simulator written in C++ loosely based on a khepera/epuck model. It is targeted for fast single and multi-robots simulation (primary motivation is evolutionary robotics et swarm/collective robotics). Its dependencies to external libraries are kept to the minimum (SDL 2 and BOOST) and the code rely on a simple philosophy: \"Keep it simple\". It can be compiled with a simple Makefile. And new projects can be introduced quickly and easily. Any new project can be created in a dedicated location in the prj/ directory, without any modifications to the roborobo core.\n\nSome random bits of information:\n- Robot position and mouvement are real-valued (ie. precise)\n- Collision is performed on a pixel-based information for fast speed (ie. fast but not precise)\n- Robot-robot collision can be switched off (faster, less accurate)\n- both GUI mode and batch mode are available. Note that batch mode is the fastest mode (gBatchMode=true, gVerbose=false).\n- only one external dependencies: SDL library (multi-platform fast 2D library).\n- most parameters are to be found in the config subdirectory (e.g. default.properties)\n- full environment and robot specifications can set up directly with an image editor (check data directories). E.g. Robot proximity sensor positions are set up in the robot image. \n- the very first version of roborobo! can be found here: http://neuronik.free.fr/nemelith/?p=67 (it is quite different as it was first a game sort-of experience, eventhough i already had roborobo! in mind). An included html help file describes the overall idea behind parameterization through image files (some modifications may have occured since then).\n- you can specify a properties file as command line option (see \"./roborobo -h\" for help)\n- you can easily clone project with the clone_project.py script in the prj/ directory. \n- by defaut, two demos are available: random walker and environment-driven evolutionary robotics (mEDEA algorithm [Bredeche, Montanier, PPSN 2009]).\n\n==== HISTORY ====\n\n[Ver.1: 12/2008]\n[Ver.2: 09/2013]\n[Ver.3: 01/2016]\n\nThe current version is Roborobo.3 (since 2016).\nCompared to version 1, it requires Boost as dependencies.\nCompared to version 2, it uses SDL2 instead of SDL1.2\nOf course, every version changes also included heavy useful upgrades.\n\n==== CREDITS ====\n\nroborobo!: \n - main developper: nicolas.bredeche(at)upmc.fr\nincluded contributions:\n - the Properties class from Evert Haasdijk (VU Amsterdam)\n - box-muller algorithm from Everett F. Carter Jr. (1994) - ref: http://www.taygeta.com/random/gaussian.html\n - other contribs are mentionned in the code (check: core/Misc.h and contrib/*)\n - past contributor(s): Jean-Marc Montanier, Leo Cazenille, Pierre Delarboulas\n\n\n==== CITING ROBOROBO ====\n\nIf you use roborobo in your work, please cite the following paper:\n\nN. Bredeche, J.-M. Montanier, B. Weel, and E. Haasdijk. Roborobo! a fast robot simulator for swarm and collective robotics. CoRR, abs/1304.2888, 2013. \n\n@article{roborobo,\n  author    = {Nicolas Bredeche and Jean-Marc Montanier and Berend Weel and Evert Haasdijk},\n  title     = {Roborobo! a Fast Robot Simulator for Swarm and Collective Robotics},\n  journal   = {CoRR},\n  volume    = {abs/1304.2888},\n  year      = {2013},\n  ee        = {http://arxiv.org/abs/1304.2888},\n  bibsource = {DBLP, http://dblp.uni-trier.de}\n}\n\nThe paper is available on Arxiv: http://arxiv.org/abs/1304.2888 \n\n\n=================================\n==== DEVELOPER'S QUICK START ====\n=================================\n\n** VERY QUICK START **\n\nCheck the TemplateWander and TemplateRandomwalk projects. Everything you need is there.\nLaunch with:\n- for TemplateWander: ./roborobo -l config/template_wander_bigrobots.properties\n- for TemplateRandomwalk: ./roborobo -l config/template_randomwalk.properties\n\nTemplateRandomwalk contains a lot of comments and example of code.\n\nIf you want to start coding, I would suggest you do not modify existing code and keep it for reference. To create a new project, that is quite easy. Let's assume you want to clone the TemplateRandomwalk project:\nSTEP 1: cloning a project\n    <from roborobo root directory>\n    cd prj/\n    python clone_project.py TemplateRandomwalk MyOwnProject\nSTEP 2: creating a configuration file (\"properties\" file)\n    <from roborobo root directory>\n    cd config/\n    cp template_randomwalk.properties myownproject.properties\n    <then edit myownproject.properties to change ConfigurationLoaderObjectName parameter value to: \"MyOwnProjectConfigurationLoader\">\nSTEP 3: re-compile and run.\n    Linux:\n        ./makefile-manager -a MyOwnProject\n        make clean\n        make\n        ./roborobo -l config/myownproject.properties\n    Mac OS X with Xcode:\n        add missing files to the project:\n            - all files in prj/MyOwnProject\n            - src/ext/MyOwnProjectConfigurationLoader.cpp\n            - include/ext/config/MyOwnProjectConfigurationLoader.h\n        add new configuration file (edit scheme, add and select \"-l config/myownproject.properties\" as argument passed on launch -- remove other arguments).\n        clean and build\n        run\n\nThat's it.\n\n** QUICK OVERVIEW **\n\nThe philosophy is that in the standard case, the designer should be able to code the agent behavior (the ''Controller'') and to access both the world and agents states in a seperate fashion (''World'' and ''Agent'' observers). The world and agents observers are run before the actual agent behavioral update, meaning that the observers do observe a ''stable'' snapshot of the environment. Then, agent behavioral update are performed in turn-based fashion (ie. asynchroneous), to deal with possible collision. While roborobo is turn-based, the update order of robots is randomized between each updates of the world (to avoid deleterious effects due to ordering).\n\n- WorldObserver: object dealing with world level, used for accessing state of the world, including all agents (methods: reset and step).\n- AgentObserver: object dealing with agent level, used for accessing state of agent. All agent observers are called before behavior update (methods: reset and step)\n\t=> Observers are really useful for monitoring, logging, computing fitness updates, managing off-line evolutionary optimization, etc.\n- Controller: object dealing with behavior at the robot level (useful methods: init and reset)\n- *WorldModel: object where the (robot) world model is stored. May or may not be extended depending on your needs.\n\nFrom the Controllers, you can access the world and robot(s) world-models. All the rest is simulator-specific implementation.\n- of course, you may want to create a new properties file in the config sub-directory\n\nAbout the simulation update method scheme:\n\t- AgentObserver is called N times per iterations (N = nb of agents)\n\t- WorldObserver is called once per iterations\n\t- Update method: turn-based, synchroneous and shuffle-ordered update method.\n\t\t- update method call sequence: WorldObserver => N_a * agentObservers => (N_e * energyPoints update) => N_a * agent steps => N_a agent moves\n\t\t\t- worldObserver is called *before* agentObservers, agentObservers are all called *before* agent.stepBehavior\n\t\t\t- environment physics and actual moving of agents are performed in a row *after* all agent.stepBehavior has been called\n\t\t\t- Agent position movements is performed using synchroneous position updates. Hence, solving collisions is robust to agent index ordering\n\t\t- the update ordering is shuffled for each new world iterations, ie. agent indexes are shuffled (to avoid update ordering nasty effects accross time)\n\t\t\t- a typical problem if shuffling is not done is that agents with low indexes always act and move first, hence a big survival advantage.\n\t\t\t- however, agentObservers and agent.stepBehavior are called in the same order (ie. no re-shuffling)\n\t- WorldModel: contains all information on on agent, ie. its representation of the outside world, including its own status (e.g. energy level).\n\t\t- in practical, neither controlarchitecture or observers should contain general agent-related information. All should be stored in the worldmodel.\n\nThe best way to learn is to practice. Clone an existing project and toy with it. See next paragraph to start playing.\n\n\n** QUICK START : SETTING UP A NEW PROJECT **\n\n- clone an existing project with the ./prj/clone_project.py python script.\n- (Linux:) update your makefile with the ./makefile-manager script.\n- (MacOSX:) update XCode project to include the newly created files.\n- create a dedicated properties file in the ./config/ directory.\n- (Linux and MacOSX): build, then run roborobo with your newly created properties file as parameter (program parameter: \"-l config/<mypropertiesfile.properties>\").\n\n\n** METHODOLOGY GUIDELINES **\n\n- Any new project should start, *and be limited to*, a specific sub-directory in prj/, with both an include/ and src/ sub-directories. E.g. ./prj/MyProject/[include&src].\n- Observers should be understood as \"deals with everything that happens inbetween two lifetimes\" while Behavior should be understood as \"everything that happens during lifetime\".\n\nA last remark: roborobo! is not exactly the paragon of Clean Coding philosophy as it was originaly, and still is, a single-coder-in-a-very-big-hurry \"short\" term project. While I tried to keep the code clean, there are several do-as-i-say-not-as-i-do features (lack of accessing methods, etc.). Hence, roborobo! may not be the best starting point for developping your homebrew robot simulator. However, it can still be pretty useful if you just intend to extend it for a particular application (e.g. a specific swarm mobile robotics environment and simulation), and it has proven to be quite useful for several published works in the last few years, from several authors and places (Paris, Orsay, Nancy, Amsterdam, Trondheim, Barcelona, etc.).\n\n\n** DIRECTORY STRUCTURE **\n\n- prj    : project locations, each project is indenpendant, and may be seen as a special instance of roborobo - parameterized through ConfigurationLoader and .properties file.\n- core   : core roborobo! code. Contains the elementary elements for running roborobo.\n- ext    : derived class and extensions for roborobo! code, which may be of global interest. It contains addition to roborobo core, including all code that can be factorised from projects (ie. re-usable code, such as e.g. neural nets, logger), as well as project specific code.\n- contrib: imported code with useful features.\n- log    : log files.\n- data   : contains image files.\n- config : contains properties files.\n\n\n** CONTENT OF ./DATA/ : IMAGES OF ROBOTS AND ENVIRONMENT **\n\nEnvironments and robots are all described as images. \n\n>>>>IMPORTANT: USE ONLY 32-bits BMP IMAGES!<<<<\n\ngAgentMaskFilename\t\t\t\t: the agent as how it is displayed and used for collision.\ngAgentSpecsFilename\t\t\t\t: the agent specification regarding proximity sensor (location and orientation).\ngForegroundImageFilename \t\t: the environment decorative image, ie. only used for displaying -- should more or less match environment image.\ngEnvironmentImageFilename  \t\t: the environment description image. \n\t\t\t\t\t\t\t\t\tR component is unused\n\t\t\t\t\t\t\t\t\tG component is used to determine agent #G starting position (if more than one pixel with same G value, choose the most upper-left), \n\t\t\t\t\t\t\t\t\tB component is used to determine object type.\n\t\t\t\t\t\t\t\t\tobstacle (and agent) Id (\"type\") are returned by proximity sensors. 0..255: #obstacle, 1000..1256..+++: #agent\n\t\t\t\t\t\t\t\t\tR=255 means \"no obstacle\", G=255 means nothing, ie.: pure white means \"no obstacle\"\n\t\t\t\t\t\t\t\t\t(!) use png to avoid pixel exact color loss\n\t\t\t\t\t\t\t\t\tnote that the sensor beam lenght parameter is set in the config file.\ngBackgroundImageFilename  \t\t: this image is purely decorative. Change parralax factor for faster scrolling (if screen size is smaller that environment/foreground size).\ngGroundSensorImageFilename: this image specifies the footprint value that will be sensed by the ground sensor.\n\nSome image files are available by default in the data subdirectory. Here's a quick summary (but you may add anything you like):\n- agent*: a 32x32 robot image, with 8 sensors (khepera-like)\n- miniagent*: a 5x5 robot image, with 8 sensors (sensor belt)\n\n\n[-n].", 
  "read_at": 1462557639, 
  "description": "Copied project from nekonaute's https://github.com/nekonaute/roborobo3/", 
  "README.md": "roborobo3\n=========\n\nRoborobo! is a fast and simple 2D mobile robot simulator written in C++ loosely based on a khepera/epuck model. It is targeted for fast single and multi-robots simulation (primary motivation is evolutionary robotics et swarm/collective robotics).\n\nAs of October 2015, Roborobo3 is the only supported version. \n\nDepencies: SDL2, boost (headers)\nPlatforms: Linux-based, MacOSX (and possibly Windows)\nAuthor: nicolas.bredeche(at)upmc.fr\n\nInstallation\n============\n\nCheck _INSTALL.TXT for installation guide (incl. quick start).\nCheck _README.TXT for a quick introduction.\nCheck _FAQ.TXT for trouble shooting and random questions.\n\nCiting roborobo\n===============\n\nIf you use roborobo in your work, please cite the following paper:\n\nN. Bredeche, J.-M. Montanier, B. Weel, and E. Haasdijk. Roborobo! a fast robot simulator for swarm and collective robotics. CoRR, abs/1304.2888, 2013. \n\nThe paper is available on Arxiv: http://arxiv.org/abs/1304.2888 \n", 
  "id": 50850116
}