{
  "id": 51381377, 
  "read_at": 1462557963, 
  "README.rst": "About\n=====\n\nScript uses dictionary of phrase pairs to download plain text data from websites found with google and save them as a Quasi-Comparable Corpora. It is 100% unsupervised and language independent. To prepare a dictionary please use this script https://github.com/machinalis/yalign/blob/develop/scripts/yalign-phrasetable-csv\n\nIf you wish to mine such data for paralle data https://github.com/krzwolk/yalign is recommended because you may directly input downloaded data with corpora_to_mongo.py\n\nInstallation\n=====\n\n This packages should be installed in Ubuntu:\n        * python-virtualenv\n        * python-dev\n        * libxslt1-dev\n        * libxml2-dev\n        * build-essential\n        \n    Command for installation:\n        $ sudo apt-get install python-virtualenv python-dev libxslt1-dev libxml2-dev build-essential\n\n    Also script requires 3rd party libraries, install it with command:\n        $ bash init.sh\n\n    Now installation is complete, but before using script now need to run command:\n        $ source ve/bin/activate\n\nUsage\n=====\n\n webc.py - web crawler for downloading plain text from web\n\n    Using web crawler.\n    As a rule crawler started with command:\n\n        $ python webc.py --dict dict.txt --lang1 pl --lang2 en\n\n    This means webc.py takes phrases from dictionary, phrases in dictionary have\n    provided languages, text saved to Mongo DB to \"web\" collection of \"corpora\"\n    db.  Script remembers progress and after restart continues work from where\n    it was stopped. In order to force restart of processing use \"-r\" key.\n    Also some configuration parameters is saved in \"conf/webcorpora.yaml\":\n    \n        * min_phrase_probability - minimal probability value for phrases\n        * results_for_phrase - number of texts to retrieve from web per each phrase\n        * google_delay - delay in seconds for one google request\n        * google_big_delay - this parameter helps preventing being blocked by\n            google, script stops on this value in seconds if being blocked (eg.\n            if google_big_delay=3600, then script will stop on 1 hour if being\n            blocked, then resume work)\n\n\nFinal info\n====\n\nFeel free to use this tool if you cite:\n*\tWolk K., Marasek K., \"Unsupervised comparable corpora preparation and exploration for bi-lingual translation equivalents\", Proceedings of the 12th International Workshop on Spoken Language Translation, Da Nang, Vietnam, December 3-4, 2015, p.118-125\n\nFor more information, see: http://arxiv.org/pdf/1512.01641\n\nFor any questions:\n| Krzysztof Wolk\n| krzysztof@wolk.pl", 
  "description": "Script can build Quasi Comparable Corpora and mine for parallel data."
}