{
  "read_at": 1462557861, 
  "description": "", 
  "README.md": "#  README GED TOOLBOX #\n\n**authors**\n\t* Benoit Gauzere < benoit.gauzere at insa-rouen.fr >\n \t* Sebastien Bougleux\n\n\n## Contents ##\nThis library provides several C++ and octave/matlab tools for computing an approximation of the graph edit distance. These tools correspond to the ones described in these two papers :\n     - Benoit Gauzere and Sebastien Bougleux and Kaspar Riesen and Luc Brun. Approximate Graph Edit Distance Guided by Bipartite Matching of Bags of Walks. In Structural, Syntactic, and Statistical Pattern Recognition (S+SSPR), 2014. \n     - Sebastien Bougleux, Luc Brun, Vincenzo Carletti, Pasquale Foggia, Benoit Gauzere, and Mario Vento. A quadratic assignment formulation of the graph edit distance. arXiv preprint arXiv :1512.07494, 2015.\n\n------\n\n## Required ##\n* octave or matlab\n* make\n* g++\n\n------\n\n## Compilation ##\nBefore compiling, you have to specify the path to your mex compiler into the Makefile.\n```bash\ncd graph-lib\nmake optim\ncd ..\nmake octave OR make matlab (depending on your software)\n```\n------\n\n## Tests ##\nTo test our source code, you can reproduce some published experiments \non [chemoinformatics dataset](https://brunl01.users.greyc.fr/CHEMISTRY/) or a [synthetic one](http://pagesperso.litislab.fr/~bgauzere/SyntheticMAODataset.tgz). To run them, you have to update the location of your ged-toolbox and the path to your datasets specify the path to the dataset file in the source file.\n### Scripts to test QAP ###\nIn xp-script/qap folder:\n* lsap_rw.m : Method based on LSAP and random walks (SSPR paper)\n* lsap_paths.m : Method based on LSAP and paths (SSPR paper)\n* qap_random.m : Method based on QAP with random initialization (Technical Report)\n* qap_bunke.m : Method based on QAP with Bunke/Riesen's initialization (Technical Report)\n* qap_rw.m : Method based on QAP with SSPR'14 initialization (Technical Report)\n\n### Scripts to test LSAPE ###\nIn xp-script/lsape folder:\n* lsape_* scripts corresponds to the approximation of ged using lsape on 5 different datasets (acyclic,alkane,mao, pah and synthetic dataset).\n* lsap_* scripts corresponds to the approximation of ged using the original hungarian algorithm on 5 different datasets (acyclic,alkane,mao, pah and synthetic dataset).\n\n## Use of the library ##\n\nCheck test files for details. Graph files must be in .ct format. Dataset files consists of the list of graph files. Graph files are supposed to be in the same folder as the dataset.\n\t\n", 
  "id": 51453578
}