{
  "README": "################################################################\n##  PFS Exposure Time Calculator and Spectrum Simulator       ##\n##                                                            ##\n##  Developed by Christopher Hirata (Ohio State University),  ##\n##  Kiyoto Yabe, Yuki Moritani, Atsushi Shimono (Kavli IPMU), ##\n##  and Robert Lupton (Princeton University)                  ##\n##                                                            ##\n##  The ETC is based on the package originally developed      ##\n##  for WFIRST (C. Hirata; arXiv:1204.5151) and altered for   ##\n##  use in PFS project.                                       ##\n################################################################\n\n------------\nRelease Note\n------------\n Version 1.0  Feb. 26, 2016\n Version 1.1  Apr. 27, 2016\n\n------------\nRequirements\n------------\n* Standard C compiler (e.g., GCC)\n* Python2 (2.6 and higher; Python3 is NOT supported)\n* Sufficient computing power\n Note1: Standard unix system including Linux and Mac OSX is recommended. There has been reported that this code does not work properly on a Linux system mounted on a Windows drive. This codes are tested under Mac OSX 10.9.5 on 2.8GHz Quad-Core Intel Xeon machine and Fedora Core 20 on Intel Core i5-4690 3.50GHz machine. \n Note2: Depending on the machine power, it takes <<several minutes>> if you run all the standard process. We recommend sufficient computing power at least similar to that we have tested. With our testing machine above, it takes about ~450 sec. (~200 sec. for noise calculation, ~155 sec. for emission line S/N calculation, and ~95 sec. for continuum S/N calculation).\n\n<<Optional>>\n* numpy  (1.8 and higher)  see http://www.numpy.org\n* scipy (0.12 and higher)  see http://www.scipy.org\n* pyfits (3.3 and higher)  see http://www.stsci.edu/institute/software_hardware/pyfits\n* matplotlib (if you use the plotting options)\n Note: These three python modules are required for using gen_sim_spec.py and the PFS datamodel package. If you don't have these modules, please install them from the above website. The version of the module is the minimum one that we confirmed so far. If you have any updates, let me know please.\n\n------------\nInstallation\n------------\nTo install the package, get the git repository by typing the following command on the terminal (if you have git installed):\n  \n   git clone --recursive https://github.com/Subaru-PFS/spt_ExposureTimeCalculator.git\n   cd spt_ExposureTimeCalculator\n   make\n   \nOnce you clone the repository, you can pull updates from the next time on the directory like this:\n\n   git pull\n   git submodule update --init\n   make\n\nYou also can get the zip or tar ball from the following page:\n\n   http://sumire.pbworks.com/w/page/107534730/PFS%20ETC\n\n-----------\nDescription\n-----------\nThis package includes two parts: one is the exposure time calculator (run_etc.py) and the other one is the spectral simulator (gen_sim_spec.py). You can get S/N information of an object in a given exposure time and various conditions by using the ETC, which is based on the \"Chris Hirata's simulator\". By using the results from the ETC, you can get the simulated spectra in the format of the current PFS datamodel with the spectral simulator.\n\n------------------------\nExposure Time Calculator\n------------------------\nThe ETC can be run as follows:\n\n python run_etc.py <input parameter file> [--param1=value1] [--param2=value2] ...\n\nIn the default setting, the code can be run by typing the following command at your terminal (the @ means that this is an\ninput file):\n\n python run_etc.py @run_etc.defaults\n\nOr using some arguments as follows:\n\n python run_etc.py @run_etc.defaults --MAG_FILE=23.0 --LINE_FLUX=5.0e-17 --LINE_WIDTH=100\n\nAll parameters can be specified in a parameter file or passed as arguments. Here are a list and the description of parameters that users can manage.\n\n1. Setup of the observation condition \nIn this section, users can manage the observational conditions including seeing, zenith angle, galactic extinction, lunar condition, exposure time, and distance from FoV center.\n\nFor instance, if you want observational condition under 0.80 arcsec seeing, the target zenith angle of 45 deg., galactic extinction of 0.05 mag., new moon with a zenith angle of 30 deg. and target - moon separation of 60 deg., 8 exposures with a single exposure of 450 sec. (3600 sec in total), and observation at the edge of the FoV, the parameters in .param file should be as follows: \n\nSEEING           0.80               #  Seeing FWHM size             [arcsec]\nZENITH_ANG       45.00              #  Zenith angle                 [deg.]\nGALACTIC_EXT     0.00               #  Galactic extinction          [ABmag.]\nMOON_ZENITH_ANG  30.0               #  Moon zenith angle            [deg.]\nMOON_TARGET_ANG  60.0               #  Moon-target separation       [deg.]\nMOON_PHASE       0                  #  Moon phase                   [0=New,0.25=quarter,0.5=full]\nEXP_TIME         450                #  Single exposure time         [sec.]\nEXP_NUM          8                  #  The number of exposures\nFIELD_ANG        0.675              #  Field angle                  [deg.; center=0, edge=0.675]\n\n2. Setup of the target information\nIn this section, users can describe the target information including target magnitude, effective radius, emission line flux and width. If you want to calculate the S/N for a flat continuum with 22.5 ABmag and an emission line with line flux of 1.0x10^-17 erg/s/cm^2, line width of sigma=70 km/s, and effective radius of 0.3 arcsec, the parameters are as follows:\n\nMAG_FILE         22.5               #  Magnitude or input spectrum  [ABmag] or <filename>\nREFF             0.3                #  Effective radius             [arcsec]\nLINE_FLUX        1.0e-17            #  Emission line flux           [erg/s/cm^2]\nLINE_WIDTH       70                 #  Emission line width sigma    [km/s]\n\nNote: You can input your own target spectra into the ETC. Just specify the file name for the MAG_FILE parameter. The file should include wavelength [nm] and magnitude [ABmag] in the first and second column, respectively. Please note that the wavelength sampling should be larger than the pixel sampling of the PFS detector (~0.7A, ~0.8A, and ~0.8A for blue, red, and NIR arm, respectively).\n\n3. Setup of the name of the output file\nThe outputs of the results for noise calculation (OUTFILE_NOISE), S/N for continuum (OUTFILE_SNC), S/N for line flux (OUTFILE_SNL) are saved to the files defined by users. If you want to measure the S/N for [OII] doublet, kindly use OUTFILE_OII parameter for the output file. If you set NOISE_REUSED to Y, the ETC will skip the process of generating noise vector which is a time-consuming process. The process time of the ETC can be reduced to roughly half by this mode. This mode is useful if you want to calculate the S/N of objects with various magnitudes and line fluxes with the same noise assumption (zenith angle, field angle, lunar condition, and exposure time). If you use this mode, you need to specified the noise vector file that you want to use in OUTFILE_NOISE parameter. Also, You can skip outputting the results of continuum S/N and emission line S/N by replace the name to '-'. If you want to use medium resolution mode in the red arm, set MR_MODE to Y.\n\nNOISE_REUSED     N                  #  Noise Vector Reused?               [Y/N] (If Y, please specify file name used in OUTFILE_NOISE)\nOUTFILE_NOISE    out/ref.noise.dat  #  Output file for noise vector       <filename>\nOUTFILE_SNC      out/ref.snc.dat    #  Output file for continuum S/N      <filename>\nOUTFILE_SNL      out/ref.snl.dat    #  Output file for emission line S/N  <filename>\nOUTFILE_OII      -                  #  Output file for [OII] doublet S/N  <filename>\nMR_MODE          N                  #  Medium resolution mode switch      [Y/N]\nOVERWRITE        Y                  #  Overwrite switch                   [Y/N]\n\nEach output file contains the following information:\n\na. OUTFILE_NOISE: noise variance per pixel\n (1) the spectrograph arm number\n (2) the pixel number\n (3) the vacuum wavelength in [nm]\n (4) the noise variance in [e^2/pix] (per one exposure without contribution from object continuum)\n (5) the sky background in [e]\nNote: (4) the noise variance in this table does not include the contribution from the object continuum.\n\nb. OUTFILE_SNC: S/N of continuum per pixel\n (1)  the spectrograph arm number\n (2)  the pixel number\n (3)  the vacuum wavelength in [nm]\n (4)  the continuum S/N per pixel\n (5)  the signal in one exposure in [e]\n (6)  the noise variance in [e^2/pix] (per one exposure without contribution from object continuum)\n (7)  the noise variance in [e^2/pix] (per one exposure with contribution from object continuum)\n (8)  the input spectra in [ABmag]\n (9)  the conversion factor from flux density [erg/s/cm2/Hz] to [e]\n (10) the sampling factor\n (11) the sky background in [e]\nNote: (6) the noise variance in this table includes the contribution from the object continuum.\n\nc. OUTFILE_SNL: S/N of emission line\n (1) the vacuum wavelength in [nm]\n (2) the fiber aperture factor\n (3) the effective collecting area [m^2]\n (4) the emission line S/N in blue arm\n (5) the emission line S/N in  red arm\n (6) the emission line S/N in  NIR arm\n (7) the emission line S/N in total\n\nd. OUTFILE_OII: S/N of [OII] emission lines (here we assume line ratio is 1:1)\n (1) the redshift\n (2) the vacuum wavelength of [OII]3726 in [nm]\n (3) the vacuum wavelength of [OII]3729 in [nm]\n (4) the fiber aperture factor\n (5) the effective collecting area [m^2]\n (6) the emission line S/N in blue arm\n (7) the emission line S/N in  red arm\n (8) the emission line S/N in  NIR arm\n (9) the emission line S/N in total\n\nSome caution again:\n\n1. NOISE_REUSED option is only valid for the same condition (zenith angle, field angle, lunar condition, and exposure time). Please be careful when you use this option and DO NOT use the different values from those used when the noise file was created.\n2. You can input your own spectra by using MAG_FILE option, but please note that the wavelength sampling should be larger than the pixel sampling of the PFS detector (~0.7A, ~0.8A, and ~0.8A for blue, red, and NIR arm, respectively).\n\n------------------\nSimulated spectrum \n------------------\n(N.b. you will need the python module numpy/scipy to run the simulator.  To write FITS files you'll also need pyfits, and to use the plotting options you'll need matplotlib)\n\nWe can generate simulated outputs for use by the 1-D pipeline using a subset of the outputs from Chris Hirata's simulator and then running gen_sim_spec.py.  The only output that we use is \"OUTFILE_SNC\", and we only use a subset of the information in that file.  In particular, we the settings\n    --EXP_NUM  (the number of exposures)\n    --MAG_FILE (the input spectrum)\nhave *no* effect upon the simulator!\n\nOne parameters that does matter is\n    --MR_MODE  (use low/medium resolution grating in the R arm)\nand of course things to do with observing such as the exposure time, seeing, moon, ...\n    --EXP_TIME\n    --SEEING\n    --MOON_PHASE ...\nThe settings used when running run_etc.py are the ones that will be used to generate an output spectrum. \nThere is a default value (N, i.e. the low resolution grating), but we'll be explicit when preparing files for the simulator.\n\nSo, before running gen_sim_spec.py, you need to prepare input files with commands like:\n\n  python run_etc.py @run_etc.defaults --MR_MODE=no  --EXP_TIME=450 --OUTFILE_SNC=out/etc-t450-lr.dat --OUTFILE_SNL=-\n  python run_etc.py @run_etc.defaults --MR_MODE=yes --EXP_TIME=450 --OUTFILE_SNC=out/etc-t450-mr.dat --OUTFILE_SNL=-\n\nYou are now ready to generate simulated spectra.  The input spectrum is given by the MAG_FILE parameter and may be either a file (with columns of wavelength and AB magnitude) or a floating point number (the AB magnitude of a flat-spectrum source).  The simulator will add appropriate noise, taking into account the number of integrations requested.  Run the gen_sim_spec.py like this:\n\n  python gen_sim_spec.py --etcFile=out/etc-t450-lr.dat\n\nYou can either specify options on the command line (use --help to list them), or by providing a file of overrides by adding e.g. \"@gen_sim_spec.defaults\" to the command line (the @ means that this is an input file). If you want to plot the spectra, try --plotObject or --plotArm.\n\nSo a more complete example is:\n\n  python gen_sim_spec.py @gen_sim_spec.defaults --outDir=out --etcFile=out/etc-t450-lr.dat --ascii=test.sim.dat --writeFits=False --MAG_FILE=20.0\n\nto write the ascii file (out/test.sim.dat) instead of the fits files, simulating a 20th magnitude flat spectrum source.  The noise is taken from the output of run_etc.py, used without specifying --OUTFILE_SNC (which we do not recommend!). Note that, as usual, arguments such as --asciiTable may be abbreviated.\n\nIf you specify a value of --nrealize > 1 then multiple realizations of the noise are generated, each with its own objId, and the corresponding number of pfsObject files are written.\n\n1. The input file (e.g. gen_sim_spec.defaults) has the same format as the input to the ETC, e.g.\n\netcFile          out/ref.snc.dat    #  Input noise file for the simulator (from Chris Hirata's ETC)\nnrealize         1                  #  The number of realization\nasciiTable       None               #  Output ASCII table (\"None\" to omit writing table)\n\nHere are some descriptions:\n\na. etcFile: Information about the background+instrumental noise per pixel; the ETC's --OUTFILE_SNC file\n\nb. nrealize: The number of realizations of the noise, incrementing the objId for each\n\nc. asciiTable: The file name of the output ASCII table of the simulated spectrum\nThe table includes the following items:\n\n  (1)  WAVELENGTH  [nm]\n  (2)  FLUX        [10^-17 erg/s/cm^2/A]\n  (3)  ERROR       [10^-17 erg/s/cm^2/A]\n  (4)  MASK        [1=masked]\n  (5)  SKY         [10^-17 erg/s/cm^2/A]\n  (6)  ARM         [0=blue,1=red,2=NIR,3=redMR]\n\nThe FITS format output will be automatically generated unless you specify \"--writeFits False\". The filenames are defined by the datamodel, using values:\n\ntract   0     #  Tract\npatch   0,0   #  Patch\nvisit   1     #  Visit number\nobjId   1     #  Object ID\ncatId   0     #  Catalogue ID\n\nThe format is defined by the datamodel, which may be found at\n     https://github.com/Subaru-PFS/datamodel/blob/master/datamodel.txt\n\nNote 1: The wavelength information on HDU #1,3,5,6 is described in the header of #1 by using CRPIX1, CRVAL1, and CD1_1. The wavelength (lambda [nm]) corresponding to the pixel (X [pix]) is as follows:\n\n       lambda = CRVAL1 + CD1_1*(X - CRPIX1)\n\nNote that in these HDU are resampled from the original data so that the pixel scale is 1.0 A (TBD). The flux in the original sampling can be found in \"FLUXTBL\" HDU or the outputs in the asciiTable.\n\nNote 2: Currently, the format of data table described above is still discussed in the DRP team and may be changed in the future release.\n\nNote 3: PFS configuration information, including catalogue ID, object ID, coordinate (dummy value is used), fiber flux (flux density of the input magnitude), MPS centroid parameter (dummy value is used), will be saved in \"pfsConfig\" file (e.g., \"pfsConfig-0x00000001.fits\").\n\n---------------------------\nExample (under development)\n---------------------------\n/////////////////////\n/// Input spectra ///\n/////////////////////\n\nThere are some examples of input spectra for the ETC. If you make additional example in your own calculation, let the contact person described below know please.\n\n1. An observation of a star-forming galaxy with a continuum and emission lines:\n\nThis example is a SDSS galaxy classified as GALAXY, whose spectra is redshifted to z=0.8 and scaled to mag=21 ABmag at 1000 nm. For this object with 1 hour exposure time under the seeing of 0.7 arcsec and gray lunar-phase condition, assuming that the object in a fiber on the FoV center and the elevation angle is 60 deg., type the following command:\n\n   python run_etc.py @run_etc.defaults --MAG_FILE=./example/spec/ex_gal_sf.dat --EXP_TIME=900 --EXP_NUM=4 --REFF=0.30 --OUTFILE_NOISE=./out/ex_gal_sf.noise.dat --OUTFILE_SNC=./out/ex_gal_sf.snc.dat --OUTFILE_SNL=- --NOISE_REUSED=N --MR_MODE=N --OVERWRITE=Y --SEEING=0.70 --ZENITH_ANG=30.0 --FIELD_ANG=0.00 --MOON_PHASE=0.25 --MOON_ZENITH_ANG=30.0 --MOON_TARGET_ANG=60.0\n\n   python gen_sim_spec.py @gen_sim_spec.defaults --etcFile=./out/ex_gal_sf.snc.dat --asciiTable=sim.ex_gal_sf.dat --MAG_FILE=./example/spec/ex_gal_sf.dat --EXP_NUM=4 --outDir=out\n\n2. An observation of a star-burst galaxy with (mostly) only emission lines:\n\nThis example is a SDSS galaxy classified as GALAXY STARBUSRT, whose spectra is redshifted to z=0.8 and scaled to mag=26 ABmag at 1000 nm. For this object with 0.5 hour exposure time under the seeing of 0.5 arcsec and bright lunar-phase condition, assuming that the object in a fiber on the FoV center and the elevation angle is 50 deg., type the following command:\n\n   python run_etc.py @run_etc.defaults --MAG_FILE=./example/spec/ex_gal_sb.dat --EXP_TIME=900 --EXP_NUM=2 --REFF=0.30 --OUTFILE_NOISE=./out/ex_gal_sb.noise.dat --OUTFILE_SNC=./out/ex_gal_sb.snc.dat --OUTFILE_SNL=- --NOISE_REUSED=N --MR_MODE=N --OVERWRITE=Y --SEEING=0.50 --ZENITH_ANG=40.0 --FIELD_ANG=0.00 --MOON_PHASE=0.5 --MOON_ZENITH_ANG=30.0 --MOON_TARGET_ANG=60.0\n\n   python gen_sim_spec.py @gen_sim_spec.defaults --etcFile=./out/ex_gal_sb.snc.dat --asciiTable=sim.ex_gal_sb.dat --MAG_FILE=./example/spec/ex_gal_sb.dat --EXP_NUM=2 --outDir=out\n\n3. An observation of a passive galaxy with a continuum and absorption lines:\n\nThis example is generated by using a CB07 stellar population synthesis model with Chabrier IMF, solar abundance, and single burst. The stellar age of the the galaxy is ~5 Gyr and with no dust extinction. The intrinsic spectra is redshifted to z=1.2 and scaled to mag=21 ABmag at 1000 nm. For this object with 5 hour exposure time under the seeing of 0.5 arcsec and bright lunar-phase condition, assuming that the object in a fiber on the FoV center and the elevation angle is 60 deg., type the following command:\n\n   python run_etc.py @run_etc.defaults --MAG_FILE=./example/spec/ex_gal_pv.dat --EXP_TIME=900 --EXP_NUM=20 --REFF=0.30 --OUTFILE_NOISE=./out/ex_gal_pv.noise.dat --OUTFILE_SNC=./out/ex_gal_pv.snc.dat --OUTFILE_SNL=- --NOISE_REUSED=N --MR_MODE=N --OVERWRITE=Y --SEEING=0.50 --ZENITH_ANG=30.0 --FIELD_ANG=0.00 --MOON_PHASE=0.5 --MOON_ZENITH_ANG=30.0 --MOON_TARGET_ANG=60.0\n\n   python gen_sim_spec.py @gen_sim_spec.defaults --etcFile ./out/ex_gal_pv.snc.dat --asciiTable sim.ex_gal_pv.dat --MAG_FILE=./example/spec/ex_gal_pv.dat --EXP_NUM=20 --outDir=out\n\n\n///////////////////\n/// Noise model ///\n///////////////////\n\nBecause the calculation of noise models is somewhat time consuming, we prepared some examples of noise model for some cases. In ./example/noise/ directory, there are noise models varying zenith angle from 0 to 70 deg. and field angle from 0.0 to 0.7 deg. for the dark moon phase and 8 exposures of 450 sec.  (e.g.,ref.noise.drk.z30.f04.t450.dat).\n\n-----------\nOther notes\n-----------\n1. The other parameters that are implemented in the Chris Hirata's ETC are indicated in the run_etc.py\nincluding instrument setups and sky subtraction floor. Users can change these parameters on your own\nresponsibility.\n\n2. The fraction of light covered by fiber aperture may be overestimated by up to 10% depending on the field\nangle compared to the ray-tracing calculation by using the PFS optical model including the telescope and the\nwide-field corrector.\n\n3. We assumed no fiber central position offset, additional 1% systematic sky subtraction error (on each 1D\npixel), and additional 2% diffuse stray light (the entire 2D detector surface) for the noise model\ncalculation.\n\n4. As a fiducial sky continuum model, we use the recent sky model provided by Jim Gunn, which is basically in\nconsistent with the observations in the SDSS/BOSS in optical and the result obtained the MOSFIRE engineering\nruns. We use the sky emission line model taken from UVES visible line atlas and theoretical model (Rousselot\net al. 2000, A&A, 354, 1134) in NIR. As a fiducial atmospheric transmission model, we use Kitt Peak model for\n<900nm and a simulated ATRAN model with 3 mm PWV at longer wavelengths.\n\n5. The original code (gsetc.c) provided by Chris Hirata, which is partially modified by people in Kavli IPMU,\ncan be found in the src directory. The manual for the code (Manual_v5.pdf) may be useful for understanding\nsome assumptions in the noise calculation.\n\n--------------------------------------------------\nHave fun! and your feedback is highly appreciated!\n--------------------------------------------------\n\n-------\nContact\n-------\nKiyoto Yabe (Kavli IPMU)\ne-mail: kiyoto.yabe@ipmu.jp\n", 
  "read_at": 1462558049, 
  "description": "PFS Exposure Time Calculator", 
  "id": 51886260
}