{
  "read_at": 1462558026, 
  "description": "Lux is an integrative hierarchical Bayesian model for analyzing any combination of BS-seq/oxBS-seq/TAB-seq/fCAB-seq/CAB-seq/redBS-seq/MAB-seq/etc data enabling accurate and unbiased quantification of different cytosine modifications (C/5mC/5hmC/5fC/5cac) and differential methylation at individual cytosines or loci, with or without replicates, while taking imperfect experimental parameters into account.", 
  "README.md": "Lux\n===================\n\nOverview\n-------------\nLux is an integrative hierarchical Bayesian model for analyzing any combination of BS-seq/oxBS-seq/TAB-seq/fCAB-seq/CAB-seq/redBS-seq/MAB-seq/etc data enabling accurate and unbiased quantification of different cytosine modifications (C/5mC/5hmC/5fC/5cac) and differential methylation at individual cytosines or loci, with or without replicates, while taking imperfect experimental parameters into account.\n\nFeatures\n-------------\n- Model-based integration and analysis of BS-seq/oxBS-seq/TAB-seq/fCAB-seq/CAB-seq/redBS-seq/MAB-seq/etc. data from whole genome, reduced representation or targeted experiments\n- Consideration of nonideal experimental parameters through modeling, including e.g. bisulphite conversion and oxidation efficiencies, various chemical labeling and protection steps etc.\n- Model-based integration of biological replicates\n- Detection of differential methylation at individual cytosines or regions using Bayes factors (DMRs)\n- Full Bayesian inference with Hamiltonian Monte Carlo (HMC) using No-U-Turn sampler (NUTS) implemented in **Stan**\n\nDownloads\n-------------\n#### Example data\n\nHere we provide the input data sets and the obtained HMC chains used in the publication.\n\nInput data\n[v65_t2kd_data.tar.bz2](https://dl.dropboxusercontent.com/u/2392459/v65_t2kd_data.tar.bz2)\n\nOutput chains\n[v65_t2kd_chains.tar.bz2](https://dl.dropboxusercontent.com/u/2392459/v65_t2kd_chains.tar.bz2)\n\nQuick introduction\n-------------\nAn usual Lux pipeline has the following steps\n\n1. Alignment of BS-seq and oxBS-seq data (e.g., [Bismark](http://www.bioinformatics.babraham.ac.uk/projects/bismark/) or [BSmooth](http://rafalab.jhsph.edu/bsmooth/)\n\n2.  Extraction of converted and unconverted counts (e.g., [Bismark](http://www.bioinformatics.babraham.ac.uk/projects/bismark/) or [BSmooth](http://rafalab.jhsph.edu/bsmooth/))\n\n3. Generation of input files for **Lux** (**parse.py**)\n\n4. Integrative methylation analysis (**Lux**)\n\n5. Calculation of Bayes factors (**bf.py**)\n\nThis documentation focus on points three, four and five.\n\nInstallation\n-------------\nBelow the environmental parameters **$STAN_HOME** and **$LUX_HOME** refers to the source directories of **CmdStan** and **Lux**.\n\n- **Lux** requires **CmdStan** (tested on version 2.2.0)\n- **parse.py** and **bf.py** requires **Python** (tested on version 2.7.5), **NumPy** (tested on version 1.7.1) and **Scipy** (tested on version 0.13.0)\n\n#### Installing CmdStan\nTo install **CmdStan**, please first download the source code of **CmdStan** from http://mc-stan.org/interfaces/cmdstan.html and follow the included installation instructions.\n\nIn short, after extracting the source code, only the following commands are required\n\n    cd $STAN_HOME\n    make bin/print\n    make bin/stanc\n\nThe binaries stanc and print are used for translating **Stan** codes into executables and summarizing HMC chains, respectively.\n\nFor more details on installing **CmdStan**, please see **$STAN_HOME/README.txt** and the documentation of **CmdStan** available at [http://mc-stan.org/manual.html].\n\n#### Compiling Lux\nThe Lux source code is supplied in the file **$LUX_HOME/lux.stan**.\nThe use of Lux requires that it is first compiled for the platform in use, which can be done using the installed **CmdStan**\n\n    cd $STAN_HOME\n    make $LUX_HOME/lux\n\nAfter the compilation is done the directory **$LUX_HOME** should have a binary with the name lux.\n\nFor more details on the compilation, such as code optimization, please see the documentation of **CmdStan** available at http://mc-stan.org/documentation/.\n\nUsing Lux\n-------------\nAfter completing the previous steps **Lux** is ready to be used. As an example, one can run **Lux** with the supplied cytosine-level data sets used in the manuscript as follows\n\n    cd $LUX_HOME\n    ./lux method=sample algorithm=hmc engine=nuts max_depth=8 stepsize=0.02 data file=data/v65_data.R init=data/v65_init.R output file=v65_output.csv\n    ./lux method=sample algorithm=hmc engine=nuts max_depth=8 stepsize=0.02 data file=data/t2kd_data.R init=data/t2kd_init.R output file=t2kd_output.csv\n\n**Stan** uses the dump data format, and thus the data and init files have to be in that format. A procedure for generating these data files is described below.\n\nFor more details, please see the documentation of **CmdStan** available at http://mc-stan.org/documentation/.\n\n### Generating input files\nA python script **parse.py** is supplied for generating input files for the use with **Lux**. \nBasically, it transforms the user-supplied data files into the data format read by CmdStan. In addition, it initializes the model parameters with values sampled from the corresponding priors\n\n    usage: parse.py [-h] -d DATA -p PRIOR -cd CONTROL_DATA -cp CONTROL_PRIOR -pr PREFIX [-v]\n    \n    Generates data and init files in the dump format for Lux\n    \n     optional arguments:\n     -h, --help                                         show this help message and exit\n     -d DATA, --data DATA                               noncontrol cytosine data\n     -p PRIOR, --prior PRIOR                            prior of the noncontrol cytosines\n      -cd CONTROL_DATA, --control-data CONTROL_DATA     control cytosine data\n      -cp CONTROL_PRIOR, --control-prior CONTROL_PRIOR  priors of the control cytosines\n      -pr PREFIX, --prefix PREFIX                       prefix of the output files\n     -v, --version                                      show program's version number and exit\n\nFor instance, the script **parse.py** is called as\n\n    ./parse.py --data data.tsv --prior prior.tsv --control-data control_data.tsv --control-prior control_prior.tsv --prefix sample\n\nThis command will generate the two files, **sample_data.R** and **sample_init.R**, which are ready to be used in **Lux**.\n\nAs you notice **parse.py** takes four files as input, so next, we will go through their content and format in detail.\n\n#### Noncontrol cytosines\nThe files **data.tsv** and **prior.tsv** have the count data and prior information on the noncontrol cytosines of interest, respectively.\n\nEach of the cytosines has its own line in the files, and thus the files are required to have the same number of lines, moreover, the order of the cytosines is assumed to be the same in the files. \n\nEach line in the file **data.tsv** is composed of one or more replicate-specific tab-separated blocks of four tab-separated nonnegative integers\n>N<sub>BS</sub><sup>C</sup>\\tN<sub>BS</sub>\\tN<sub>oxBS</sub><sup>C</sup>\\tN<sub>oxBS</sub>\n\nThat is, the number of Cs and the total BS-seq read-outs are listed first, which are followed by the number of Cs and total oxBS-seq read-outs.\n\nMoreover, on each line there should be exactly 4xN<sub>replicates</sub> values separated with the tabs.\n\nThe replicate-level in the hierarchical model formulation explicitly assumes that the replicates share the same prior. Thus, the prior of m is defined by giving the parameter a for all the noncontrol cytosines in terms of three pseudo-counts a<sub>1</sub>, a<sub>2</sub> and a<sub>3</sub> corresponding to p(C), p(5mC) and p(5hmC), respectively.\n\nThat is, all the lines in the file **prior.tsv** are required to have the following format\n>a<sub>1</sub>\\ta<sub>2</sub>\\ta<sub>3</sub>\n\nIn the original publication these were a<sub>1</sub>=a<sub>2</sub>=a<sub>3</sub>=0.8 for all the noncontrol cytosines.\n\n#### Control cytosines\nThe files **control_data.tsv** and **control_prior.tsv** have the count data and prior information on the control cytosines of interest, respectively.\n\nLuckily, the data for the control cytosines is supplied in the same format as noncontrol data (see *above*). That is, each line in the file **control_data.tsv** is composed of one or more replicate-specific tab-separated blocks of four tab-separated nonnegative integers.\n\nAs in **data.tsv**, on each line there should be exactly 4xN<sub>replicates</sub> values separated with the tabs. Each of the replicate specified in **data.csv** should have its own control data. Moreover, the order of the replicate-specific blocks between the noncontrol and control data is assumed to be the same.\n\nThe prior knowledge on the control cytosines is supplied in the file **control_prior.tsv**. Although the hierarchical model allows that the control cytosines would have different priors between replicates, this is not implemented in the current version. Therefore, each line in **control_prior.tsv** should have exactly three tab-separated values and the order of the rows, i.e., control cytosines, should be the same in **control_data.tsv** and **control_prior.tsv**.\n\n### Summarizing HMC chains\nAfter the runs are completed their output can be summarized using **print** as follows\n\n    $STAN_HOME/bin/print v65_output.csv\n    $STAN_HOME/bin/print t2kd_output.csv\n\nFor instance, the summary includes posterior means, standard deviations, quantiles and convergence diagnostic statistics for each of the parameters.\n\nFor more details on the output of **print**, please see the documentation of **CmdStan** available at http://mc-stan.org/documentation/.\n\n#### Interpreting the parameters in the implementation\nThe replicate-specific experimental parameters BS<sub>eff</sub>, ox<sub>eff</sub>, BS<sup>\\*</sup><sub>eff</sub> and seq<sub>err</sub> are stored in the parameter vectors **bsEff**, **oxEff**, **bsBEff** and **seqErr**, respectively.\n\nThe methylation proportion parameters of noncontrol cytosines m and th have the following variable names in the implementation **mu** and **theta**, respectively.\nIn the implementation **mu** is a two-dimensional matrix (N<sub>cytosines</sub>xN<sub>replicates</sub>), where the elements are 3-simplices. Whereas, **mu** is a vector (N<sub>cytosines</sub>) in which the elements are 3-simplices.\n\nThe methylation proportion parameters of control cytosines th<sub>control</sub> has the following variable names in the implementation **theta_control**. The parameters **theta_control** is a vector (N<sub>control cytosines</sub>) in which the elements are 3-simplices.\n\nFor more details on this, please see the parameter declarations in the source code of **Lux** in the file **$LUX_HOME/lux.stan**.\n\n### Detecting differential methylation\nA python script **bf.py** is supplied for calculating Bayes factors\n\n    usage: bf.py [-h] -c1 CHAIN1 -c2 CHAIN2 [-v]\n    \n    Calculates Bayes factor between two conditions based on the Stan HMC output chains\n    \n    optional arguments:\n      -h, --help                      show this help message and exit\n      -c1 CHAIN1, --chain-1 CHAIN1    output chain of the first condition\n      -c2 CHAIN2, --chain-2 CHAIN2    output chain of the second condition\n      -v, --version                   show program's version number and exit\n\nFor instance, to calculate Bayes factor from the supplied HMC chains used in the publication, type\n\n    ./bf.py --chain-1 v65_output.csv --chain-2 t2kd_output.csv\n\nThen the first four output lines are\n> mu\\[1]\\t0.000087\n\n> mu\\[2]\\t0.000092\n\n> mu\\[3]\\t0.000876\n\n> mu\\[4]\\t0.000130\n\nThe script calculates Bayes factor for every **mu** variable.\n\nNotably, the chains are required to have the same number of **mu** variables, i.e., the same cytosines, and they should be supplied in the same order. However, calculation of Bayes factors between conditions with a different number of replicates is supported. Additionally, **bf.py** assumes that a<sub>1</sub>=a<sub>2</sub>=a<sub>3</sub>=0.8.\n\nFor more details on the the calculation of Bayes factor, please see the original publication in which the procedure is explained in detail.\n\n### Advanced uses\nSome users might want to consider using **Lux** through the **RStan** or **PyStan** interfaces (see http://mc-stan.org/interfaces/).\n\n### References\n[1] M. J. Betancourt, \"Generalizing the No-U-Turn Sampler to Riemannian Manifolds,\" arXiv, vol. 1304, no. 1920, 2013. \n\n[2] K. D. Hansen, B. Langmead and R. A. Irizarry, \"BSmooth: from whole genome bisulfite sequencing reads to differentially methylated regions.,\" Genome Biol, vol. 13, no. 10, pp. R83, Oct 2012. \n\n[3] M. D. Hoffman and A. Gelman, \"The No-U-Turn Sampler: Adaptively Setting Path Lengths in Hamiltonian Monte Carlo,\" Journal of Machine Learning Research, vol. in press, 2013. \n\n[4] F. Krueger and S. R. Andrews, \"Bismark: a flexible aligner and methylation caller for Bisulfite-Seq applications.,\" Bioinformatics, vol. 27, no. 11, pp. 1571-1572, Jun 2011. \n\n[5] Stan Development Team, \"Stan Modeling Language Users Guide and Reference Manual, Version 2.2,\" 2014. \n\n[6] Stan Development Team, \"Stan: A C++ Library for Probability and Sampling, Version 2.2,\" 2014. \n\n[7] D. Sun, Y. Xi, B. Rodriguez, H. J. Park, P. Tong, M. Meong, M. A. Goodell and W. Li, \"MOABS: model based analysis of bisulfite sequencing data.,\" Genome Biol, vol. 15, no. 2, pp. R38, Feb 2014. \n\n", 
  "id": 52161006
}