{
  "read_at": 1462557987, 
  "description": "Physical climate projection code for Houser et al., (2015) and Rasmussen et al. (2015)", 
  "README.md": "# acp_physical: Physical climate projection code for Houser et al., (2015) and Rasmussen et al. (2015)\n\nREADME file last updated by DJ Rasmussen, dmr2-at-princeton-dot-edu, Tue 29 Dec 2015 07:16:14 AM PST\n\n## Citation\n\nThis code is intended to accompany the results of\n\n    (1) T. Houser, R.E. Kopp, S.M. Hsiang, M. Delgado, A.S. Jina, K. Larsen,\n        M. Mastrandrea, S. Mohan, R. Muir-Wood, D.J. Rasmussen, J. Rising,\n        and P. Wilson. (2015). American Climate Prospectus: Economic Risks\n        in the United States. Columbia University Press. ISBN: 978-0231174565\n\n   \t(2) D. J. Rasmussen, M. Meinshausen, and R. E. Kopp. (2015). Probability-\n        weighted ensembles of U.S. county-level climate projections for climate\n        risk analysis. ArXiv e-prints. arXiv: 1510.00313\n\nPlease cite these works when using any results generated with this code.\n\n## Overview\n\nTo run all this code requires Python v2.6-7, MATLAB, NCAR Command Language v6.1 or greater, and a Fortran90 compiler such as gfortran.\n\nThis code is intended to help end-users who wish to work with, modify or reproduce the probabilistic physical climate projections of Houser et al. (2015) and Rasmussen et al. (2015) in greater a capacity other than the tables and figures provided therein. Key functionality these codes provide include:\n\n1. Generate county-level probabilistic projections of temperature and precipitation using the Surrogate/Model Mixed Ensemble method (SMME)\n2. Generate county-level probabilistic projections of temperature and precipitation using the Monte Carlo Pattern-Residual method (MCPR)\n3. Generate county-level probabilistic projections of daily maximum wet-bulb temperature using the SMME and MCPR methods\n4. Post-processing code to generate summary tables of all results at various geographic aggregations with multiple weighting schemes (e.g. population weighted and land area weighted)\n\nAdditional documentation is provided as comments in the scripts. Note that these routines generate data at the daily, monthly, and annual level. These codes exclude processing for Alaska and Hawaii, which require an additional downscaled projection data set with global coverage and a separate processing stream.\n\nThis repository includes necessary imput files such as temperature pathways from global CMIP5 models (preprocessed), SMME weights, and MAGICC6 probablistic global mean temperature pathways\n\nIn the included directories are:\n\n###download\n\n* **download** Codes to download the raw downscaled projections from the Bureau of Reclamation.\n\n###preproc\n* **concat**  Codes to suture each model's historical and future records\n* **magicc** Codes to generate SMME weights from MAGICC6 projections and also generate MCPR pattern and residual samplings\n* **patternscale** Codes to generate seasonal patterns and perform pattern scaling\n* **downscale** Codes to downscale monthly means to daily means using historical weather variability\n* **mcpr** Codes to generate monthly probabilistic projections using the MCPR method (random sampling of CMIP5 GCM patterns and residuals)\n\n\n###postproc\n* **tables** Codes to generate tables of regional, state, and county-level aggregate projections for multi-year averages\n* **exceedance** Codes to count the number of daily exceedances (arbitrarily set for temperature, wetbulb or precipitation) from netCDF files\n* **extract** Codes to extract monthly climate variables from netCDF files\n* **wetbulb** Codes to generate historical relationships between Tavg and wetbulb temperature for future projections (requires data from the North American Regional Reanalysis data) Also codes for generating future projections of wetbulb temperature based on projections of future temperature and historical dry-bulb and wet-bulb temperature relationships.\n* **stn2cnty** Codes to map U.S. counties to the nearest GHCN weather station. \n* **qc_daily_tas** Codes for assuring daily Tmin < Tavg < Tmax \n* **mcpr** Exceedance calculations and extraction codes for the MCPR method\n\n\n\n###Historical Observations\nThese routines require GHCN station level climate normals and are incluclude in the files. The temporal downscaling requires historical daily weather which is a large dataset. These data are a combined observation-reanalysis dataset that is available on the Rutgers' RU Core at: <https://rucore.libraries.rutgers.edu/>. The construction of this observation-reanalysis dataset is described in Appendix A of Rasmussen et al. (2015).\n\n\n----\n\n    Copyright (C) 2016 by RHODIUM GROUP LLC\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n", 
  "id": 52178489
}