{
  "read_at": 1462557540, 
  "description": "A general-purpose Java library for performing structured learning.", 
  "README.md": "Illinois Structured Learning Package v1.0.0\n===========================================\n\nIllinois Structured Learning Package (Illinois-SL) is a general\npurpose JAVA library for performing structured learning. It houses\nlearning algorithms like averaged Structured Perceptron and Structured\nSVM with L2-Loss, and provides a minimal interface for your structured\nlearning needs. The training algorithm employed for training SSVM is\ndual coordinate descent(DCD), which has been proven to have very good\nconvergence properties. Illinois-SL comes with an efficient\nimplementation of DCD with support for multi-threading. Illinois-SL\nprovides a simple and neat framework for developing applications using\nstructured prediction models.\n\nMaven Coordinates\n-----------------\nTo use Illinois-SL in your project add the following to your pom,\n\n```\n  <dependencies>\n  ...  \n    <dependency>\n      <groupId>edu.illinois.cs.cogcomp</groupId>\n      <artifactId>illinois-sl-core</artifactId>\n      <version>1.0.0</version>\n    </dependency>\n  ...\n  </dependencies>\n\n<repositories>\n  ...\n    <repository>\n      <id>CogcompSoftware</id>\n      <name>CogcompSoftware</name>\n      <url>http://cogcomp.cs.illinois.edu/m2repo/</url>\n    </repository>\n  ...  \n  </repositories>\n\n```\nExample Usage\n-------------\nWe provide detailed examples in an accompanying package at [illinois-sl-examples](https://github.com/IllinoisCogComp/illinois-sl-examples).\n\nLicense\n--------\nThe Illinois Structured Learning Package is available under a Research\nand Academic use license. For more details, view the license file `LICENSE`.\n\n\nSystem requirements\n----------------------------\n\nThe Illinois Structured Learning Package was developed on and for\nGNU/Linux, specifically CENTOS (2.6.18-238.12.1.el5) and Scientific\nLinux (2.6.32-279.5.2.el6.x86_64). There are no guarantees for running\nit under any other operating system, but we hope it should run on a\nLinux OS without any issues.\n\nWe assume that the package is installed on a machine with sufficient\nmemory. The actual requirement of the memory depends on the task and size of the learning problem.\n\nNOTE: When running your project, if working with a large dataset, you\nmay need to invoke your project using the -Xmx1G and\n-XX:MaxPermSize=1G JVM command line parameters.\n\n\nAdditional Documentation/Citation\n---------------------\n\nAdditional documentation is available in the JavaDoc located in doc/index.html\n\nCiting\n------\nPlease cite the following papers when using this library\n\nK.-W. Chang, S. Upadhyay, M.-W. Chang, V. Srikumar, D. Roth.\nIllinoisSL: A JAVA Library for Structured Prediction.\nArxiv, 2015.\n\nM.-W. Chang, V. Srikumar, D. Goldwasser and Dan Roth. \nStructured output learning with indirect supervision. \nICML, 2010.\n\nK.-W. Chang, V. Srikumar, D. Roth. \nMulti-core Structural SVM Training.\nECML, 2013.\n\nContribute to the package\n-------------------------\n\nIf you encounter any issue when using the package, please file a bug report as a [GitHub issue](https://github.com/IllinoisCogComp/illinois-sl/issues) and provide information about how to reproduce the error. \n\nYou are also welcomed to contribute to the package. To do so, please fork git repo https://github.com/IllinoisCogComp/illinois-sl/ and submit a pull request.\n\nPlease find the detailed instructions about how to contribute to a GitHub project at https://guides.github.com/activities/contributing-to-open-source/\n\n\n\nContact Information\n------------\n\nPlease open a new issue with a minimal working example, in case you\nrun into problems when using this package, and we will assist you. You\ncan also email your questions to illinois-ml-nlp-users@cs.uiuc.edu.\n\n(C) 2015 Kai-Wei Chang, Shyam Upadhyay, Ming-Wei Chang, Vivek Srikumar and Dan Roth, \nCognitive Computation Group, University of Illinois at Urbana-Champaign.\n\n", 
  "id": 52391139
}