{
  "read_at": 1462557966, 
  "description": "Codes for the paper \"When does inequality freezes an economy?\"", 
  "README.md": "__Original Git repository for this code [here](https://bitbucket.org/flandes/ineqfreezeseconomy_montecarlo_mastereq/src). This repository is just a GitHub mirror. Please go there for up-to-date code.__\n\nCodes for: When does inequality freeze an economy?\n=================================================\n\nThis repository contains code originally implemented for the paper\n*\"When does inequality freezes an economy?\"*,\nJoao Pedro Jerico, Francois P. Landes, Matteo Marsili, Isaac Perez Castillo and Valerio Volpati. http://arxiv.org/abs/1602.07300\n**Please cite when appropriate**.  \n\n*C program: gran_econ, a sequential Monte-Carlo simulation*  \n\ngran_econ.c is a Monte Carlo simulation of the trades of indivisible (granular) goods, between agents whom have a constant, Pareto-distriubted capital. Trading happens randomly (see paper) with the constraint that each agent's cash must be positive at all times.\nCopyright (C) 2015 Joao Pedro Jerico, Francois P. Landes, Valerio Volpati.\n\n\n*Mathematic script: iteSol_MM=2.nb, an iterative integration scheme*\n\niteSol_MM=2.nb is an iterative integration scheme that provides the self-consistent solution to Eqs. (11) and (4). See appendix A.3.2, \"Algorithm computing self-consistent solution ...\". It could be re-written in any formal mathematics program, including scilab, as it does not make use of any Mathematica-specific tools. \n\nThis program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.  \nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.  \nYou should have received a copy of the GNU General Public License along with this program. If not, see <http://www.gnu.org/licenses/>.\n\n\nDependencies\n------------\n\nThe simulation was written in C and requires the GSL library.\n\nThe plotting scripts were written in Python and require the Numpy, Matplotlib and Pandas libraries, but you may also make your own.\n\nThe Mathematica script requires Mathematica.\n\nHow to Use\n----------\n\nPlease see how_to_use.md for details.\n\n", 
  "id": 52563501
}