{
  "read_at": 1462555210, 
  "description": "Robotics and Math studies based on Hierarchical Temporal Memory (HTM).", 
  "README.md": "## htm-robotics-neuroscience-and-math-papers\n\nThis repository contains robotics and mathematics studies based on Hierarchical Temporal Memory ([HTM](https://en.wikipedia.org/wiki/Hierarchical_temporal_memory)). Note that, the blockquoted texts are personal comments and they should not be condisered as actual contribution of the study in the literature.  \n### Robotics \n1.  Mai, X.,  Zhang, X., Jin, Y., Yang Y., Zhang J.,: Simple perception-action strategy based on hierarchical temporal memory.In Robotics and Biomimetics (ROBIO), 2013 IEEE International Conference on , vol., no., pp.1759-1764, 12-14 (2013) doi: [10.1109/ROBIO.2013.6739722](http://10.1109/ROBIO.2013.6739722)  \n2.  Seok, K.H., Kim, Y. S.,: A new robot motion authoring method using HTM. In:  International Conference on  Control,  Automation   and  Systems, pp. 2058-2061 (2008).  \n\n### Neuroscience\n \n\n### Mathematics  \n1.  Mnatzaganian, j., Fokoue, E., Kudithipudi D.,; A Mathematical Formalization of Hierarchical Temporal Memory Cortical Learning Algorithm's Spatial Pooler, arXiv preprint arXiv:1601.06116, 2016.  \n> This paper provides mathematical framework for spatial pooling and probabilistic feature mapping to (re)construct inputs from Sparse Distributed Representation.  \n\n2. Hawkins, J.,  Ahmad, S.,: Why Neurons Have Thousands of Synapses, A Theory of Sequence Memory in Neocortex. Frontiers in Neural Circuits  (2015)\n> **Key concepts**: Temporal Memory phases, Mathematical formulation of Temporal Memory. \n\n3. Hawkins, J.,  Ahmad, S.,: Properties of Sparse Distributed Representations and their Application to Hierarchical Temporal Memory. arXiv preprint:1503.07469v1 (2015)  \n>  Introduction to Neocortex/HTM data structure, SDRs, and its mathematical properties. Moreover, Spatial Pooler and Temporal Memory briefly described. \n\n4. Pentti, K.,: [Sparse distributed memory.](https://mitpress.mit.edu/books/sparse-distributed-memory) MIT press, 1998", 
  "id": 52873770
}