{
  "read_at": 1462555941, 
  "description": "", 
  "README.md": "neural image analogies\n----------------------\n![Image of arch](https://raw.githubusercontent.com/awentzonline/image-analogies/master/images/image-analogy-explanation.jpg)\n![Image of Trump](https://raw.githubusercontent.com/awentzonline/image-analogies/master/images/trump-image-analogy.jpg)\n![Image of Sugar Steve](https://raw.githubusercontent.com/awentzonline/image-analogies/master/images/sugarskull-analogy.jpg)\n\nThis is basically an implementation of this \"Image Analogies\" paper http://www.mrl.nyu.edu/projects/image-analogies/index.html In our case, we use feature maps from VGG16. The patch matching and blending is done with a method described in \"Combining Markov Random Fields and Convolutional Neural Networks for Image Synthesis\" http://arxiv.org/abs/1601.04589  Effects similar to that paper can be achieved by\nturning off the analogy loss (or leave it on!) and turning on the B/B' content weighting\nvia the `--b-content-w` parameter.\n\nThe initial code was adapted from the Keras \"neural style transfer\" example.\n\nThe example arch images are from the \"Image Analogies\" website at http://www.mrl.nyu.edu/projects/image-analogies/tbn.html\nThey have some other good examples from their own implementation which\nare worth a look. Their paper discusses the various applications of image\nanalogies so you might want to take a look for inspiration.\n\nInstallation\n------------\nYou'll want to run this on a GPU. [Here are the docs](http://deeplearning.net/software/theano/tutorial/using_gpu.html) for getting\nup and running.\n\n[Install latest keras and theano](http://keras.io/#installation) (requires theano, no tensorflow atm).\n\nBefore running this script, download the weights for the VGG16 model at:\nhttps://drive.google.com/file/d/0Bz7KyqmuGsilT0J5dmRCM0ROVHc/view?usp=sharing\n(source: https://gist.github.com/baraldilorenzo/07d7802847aaad0a35d3)\nand make sure the variable `weights_path` in this script matches the location of the file or use the `--vgg-weights` parameter\n\nExample script usage:\n`python image_analogy.py path_to_A path_to_A_prime path_to_B prefix_for_B_prime`\n\ne.g.:\n\n`python image_analogy.py images/arch-mask.jpg images/arch.jpg images/arch-newmask.jpg out/arch`\n\nCurrently, the images are all assumed to be the same size. Output size is the same\nas the new mask image, unless specified otherwise.\n\nParameters\n----------\n\n * --width Sets image output max width\n * --height Sets image output max height\n * --scales Run at N different scales\n * --iters Number of iterations per scale\n * --min-scale Smallest scale to iterate\n * --mrf-w Weight for MRF loss between A' and B'\n * --analogy-w Weight for analogy loss\n * --b-content-w Weight for content loss between B and B'\n * --tv-w Weight for total variation loss\n * --vgg-weights Path to VGG16 weights\n * --a-scale-mode Method of scaling A and A' relative to B\n * * 'match': force A to be the same size as B regardless of aspect ratio (current default for backwards compatibility)\n * * 'ratio': apply scale imposed by width/height params on B to A\n * * 'none': leave A/A' alone\n * --a-scale Additional scale factor for A and A'\n * --pool-mode Pooling style used by VGG\n * * 'avg': average pooling - generally smoother results\n * * 'max': max pooling - more noisy but maybe that's what you want (original default)\n * --contrast adjust the contrast of the output by removing the bottom x percentile\n    and scaling by the (100 - x)th percentile. Defaults to 0.02\n * --output-full Output all intermediate images at full size regardless of actual scale\n * --analogy-layers Comma-separated list of layer names to be used for the analogy loss (default: \"conv3_1,conv_4_1\")\n * --mrf-layers Comma-separated list of layer names to be used for the MRF loss (default: \"conv3_1,conv_4_1\")\n * --content-layers Comma-separated list of layer names to be used for the content loss (default: \"conv3_1,conv_4_1\")\n * --patch-size Patch size used for matching (default: 3)\nThe analogy loss is the amount of influence of B -> A -> A' -> B'\nIt should be set a lot higher than the MRF loss (default is 9:1)\n\nThe MRF loss is the influence of B' -> A' -> B'\n\nThe B/B' content loss is set to 0.0 by default. You can get effects similar\nto CNNMRF by turning this up and setting analogy weight to zero. Or leave the\nanalogy loss on for some extra style guidance.\n\nIf you'd like to only visualize the analogy target to see what's happening,\nset the MRF and content loss to zero: `--mrf-w=0 --content-w=0`\n", 
  "id": 53400160
}