{
  "read_at": 1462554894, 
  "description": "Mathematical citations fetcher(arXiv, MathSciNet, zbMATH) and formatter (BibTeX or LaTeX output).", 
  "README.md": "# Citation fetcher with customizable LaTeX/BibTeX output\n\nPyQt GUI and a separate fetching engine for finding mathematics related citations on \n[arXiv](http://front.math.ucdavis.edu), [MathSciNet](http://www.ams.org/mathscinet/) and [zbMATH](https://zbmath.org).\n\n<img src=\"doc/cite.png\" width=\"480\">\n\nAssuming required packages are present, application can be started with `cite.py`.\n\n### OS X:\n* Use Cite.dmg from the [initial release](https://github.com/siudej/Cite/releases/tag/v0.1-alpha).\n   - Put Cite.app in `/Applications` folder\n   - Optional: Double click on workflows to install them\n   - Optional: Add TexShop macro\n* With Anaconda: Assuming all requrements are already installed, clone this repository, then run `installMac.sh` to install Services (user confirmation needed) and add `cite` to PATH.\nIn either case `cite` should work from terminal. \n\n##### TexShop macro\nThe supplied macro cuts the current line (or the selected lines) and runs it through the citation software.\n\nInstallation: \n   Go to `Macros->Open Macro Editor`. Click on `New Item` and paste the contents of the `TexShop.applescript` file into the content field. Add some name and a convenient keyboard shortcut. The main Application must be started at least once before running the macro.\n\n##### OS X Services\nThe supplied Automator scripts (workflows) allow filtering of any selected text in any application through the software.\nThe output can either replace the selection, or appear in a new TextEdit window. Then right click on a selected text and look for Cite in Services.\n\n### General requirements\n* LaTeX/BibTeX\n* `PyQt` (4 or 5)\n* `bibtexparser` Python package\n\n### Search format\nSearch supports many field specifiers (author, title, journal, year, ...) as well as logical connectors (and/or/not). The search format is uniform for all databases, with all differences handled behind the scene.\n\nExample search:\n```\nau:siudeja laugesen\n2011\n```\nwill find my papers written with my best collaborator, published in 2011.\n\nIt is also possible to feed a fully formatted bibitem or BibTeX entry as a search query, even including all the LaTeX formatting commands.\n\n### Output\nApplication supports raw BibTeX output, and custom LaTeX outputs: \n* font style can be chosen for authors, title, journal, ...\n* bibitem labels can be automatically generated, or preserved if given in the search query\n* links to databases can be automatically added\n\nBatch processing is also possible. A list of citations can be processed to find links to databases, create BibTeX file, or to reformat/uniformize the LaTeX output.\n\n### System integration\nThe main script `cite.py` also accepts querries as parameters, or through stdin. In this case no GUI is created (PyQt is not needed) and the output is sent to stdout. This allows integration with text editors. One could use the following in Vim:\n```\nnmap ,bb !!cite.py<CR>\nvmap ,bb !cite.py<CR>\nnmap ,ba !!cite.py -a<CR>\nvmap ,ba !cite.py -a<CR>\n```\nto feed a line, or a selection to the script.\n\nThe `,ba` command can be used to force arXiv search. Other options are also available.\n\n### Application settings \nSettings are saved in settings.xml file in the script's folder. This file is processed by both terminal and GUI versions. Hence it is convenient to set the settings in GUI, although the XML file can also be modified.\n\nIn PyQt, the settings are handled by a slightly modified [pyqtconfig](https://github.com/mfitzp/pyqtconfig) scipt (supplied).\n\n## Warning\nThis is an alpha version.\n\nSome features are not yet fully implemented, and the documentation is lacking.\n", 
  "id": 53620891
}