{
  "read_at": 1462555784, 
  "description": "Mirror of https://bitbucket.org/simula_cbc/cbcpdesys", 
  "README.md": "[![Build Status](https://travis-ci.org/mikaem/cbcpdesys.svg?branch=master)](https://travis-ci.org/mikaem/cbcpdesys)\n\nCBC.PDESys\n---------\n\nCBC.PDESys is a Python package, built on top of FEniCS, for specifying and\nsolving large systems of nonlinear Partial Differential Equations (PDEs) with\nvery compact, flexible and reusable code (see, e.g.,\nhttp://fenicsproject.org/featured/2011/pdesys.html). The package is completely\ngeneral and targets any system of PDEs. CBC.PDESys is primarily being developed \nat the Center for Biomedical Computing at Simula Research Laboratory in Oslo, \nNorway. CBC.PDESys is distributed freely in the hope that it will be useful, but \nwithout any warranty. \n\nMore information about the FEniCS Project can be found at the address\n\n  http://www.fenicsproject.org/\n\nBackground on the methodology used in this framework is presented in\n\n  http://arxiv.org/abs/1102.2933\n\nCopyright\n---------\n\nContributions to CBC.PDESys made by employees of Simula Research\nLaboratory are copyright Simula Research Laboratory and the\nrespective author(s).\n\nLicense\n-------\n\nCBC.PDESys is free software: you can redistribute it and/or modify\nit under the terms of the GNU Lesser General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\n\nCBC.PDESys is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the\nGNU Lesser General Public License for more details.\n\nYou should have received a copy of the GNU Lesser General Public License\nalong with CBC.PDESys. If not, see <http://www.gnu.org/licenses/>.\n\nFor details, refer to the file COPYING.LESSER.\n\nFeedback, questions\n-------------------\n\nFor questions, please contact\n\n  Mikael Mortensen <mikaem@math.uio.no>\n\nOslo, October 2012\n", 
  "id": 53658760
}