{
  "read_at": 1462555496, 
  "description": "The original Bayesian Nonparametric Covariance Regression Toolbox by Emily Fox and David Dunson", 
  "README.md": "# Matlab Software for Bayesian Nonparametric Covariance Regression\n\nCopyright (C) 2011, Emily B. Fox\n(fox[at]stat[dot]duke[dot]edu)\n\nThis software package includes Matlab scripts that implement the Gibbs sampling\nalgorithm for the model described in:\n  Bayesian Nonparametric Covariance Regression\n  E. B. Fox and D. B. Dunson\n  arXiv:1101.2017, January 2011 (revised February 2011).\n  http://arxiv.org/abs/1101.2017\nPlease cite this paper in any publications using the HDP-AR-HMM or HDP-SLDS package.\n\n## Package Organization and Documentation\n\nSummary of BNP Covariance Regression package contents:\n\n+ `BNP_covreg.m`: Main inference script for running the sampler without missing\ndata or imputing the missing values.\n+ `BNP_covreg_varinds.m`: Main inference script for running the sampler with\nanalytic marginalization of missing values.\n+ `runstuff_BNPcovreg.m` and `runstuff_var_inds_flu.m`: See below for explanation\n\n+ `/utilities`: Script `SIMplots.m` contains an example of how to process and\nvisualize the results from the stored samples.\n\n## Setup and Usage Examples\n\nFor an example of running the sampler without missing data or imputing\nthe missing values, see `runstuff_BNPcovreg.m`.  This script examines a\nsynthetic data example.\n\nFor an example of running the sampler with analytic marginalization of\nmissing values, see `runstuff_varinds_flu.m`.  This script examines the\nGoogle Flu Trends dataset.\n\n## Copyright & License\nCopyright (C) 2011, Emily B. Fox.\n\nhttp://web.mit.edu/ebfox/www/\n\nPermission is granted for anyone to copy, use, or modify these\nprograms and accompanying documents for purposes of research or\neducation, provided this copyright notice is retained, and note is\nmade of any changes that have been made.\n\nThese programs and documents are distributed without any warranty,\nexpress or implied.  As the programs were written for research\npurposes only, they have not been tested to the degree that would be\nadvisable in any important application.  All use of these programs is\nentirely at the user's own risk.\n", 
  "id": 53746797
}