{
  "read_at": 1462555771, 
  "description": "Tools for Riemannian shape analysis with second order Sobolev metrics.", 
  "README.md": "h2metrics\n=========\n\nWhat is it?\n-----------\n\nThis code provides tools for Riemannian shape analysis with second order Sobolev metrics on closed plane curves. It can be used to solve the initial and boundary value problems for geodesics and to compute Karcher means. It is able to factor out reparameterizations, translations, and rotations of the curves. \n\nFor details we refer to the paper \n\n    @misc{BBHM2016,\n      author  = {Martin Bauer, Martins Bruveris, Philipp Harms, Jakob M{\\o}ller-Andersen},\n      title   = {A Numerical Framework for {S}obolev Metrics on the Space of Curves},\n      year    = {2016},\n      note    = {Preprint available at arXiv:1603.03480.}\n    }\n\nPlease cite our paper in your work.\n\nDependencies\n------------\n\n* MATLAB Curve Fitting Toolbox\n* MATLAB Optimization Toolbox\n* Manopt library, available at http://www.manopt.org. (Only needed to compute Karcher means.)\n\nThe code was tested on MATLAB R2014b with Manopt 2.0. \n\nInstallation\n------------\n\nThe Manopt library must be on the Matlab search path. \n\nUsage\n-----\n\nSee the file \"example.m\" for an example of how to use the code.\n\nLicence\n-------\n\nThis program is free software: you can redistribute it and/or modify it under \nthe terms of the GNU General Public License as published by the Free Software \nFoundation, either version 3 of the License, or (at your option) any later \nversion.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT \nANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS \nFOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with \nthis program. If not, see http://www.gnu.org/licenses/.\n\nContacts\n--------\n\n* Martin Bauer (martin dot bauer at tuwien dot ac dot at)\n* Martins Bruveris (martins dot bruveris at brunel dot ac dot uk)\n* Philipp Harms (philipp dot harms at math dot ethz dot ch)\n* Jakob Moller-Andersen (jakmo at dtu dot dk)\n", 
  "id": 53871391
}