{
  "read_at": 1462555938, 
  "description": "Github mirror of MediaWiki extension Memento - our actual code is hosted with Gerrit (please see https://www.mediawiki.org/wiki/Developer_access for contributing)", 
  "README.md": "The idea of the Memento extension is it to make it as straightforward to access articles of the past as it is to access their current version.\n\nThe Memento framework allows you to see versions of articles as they existed at some date in the past. All you need to do is enter a URL of an article in your browser and specify the desired date in a browser plug-in. This way you can browse the Web of the past. What the Memento extension will present to you is a version of the article as it existed on or very close to the selected date. Obviously, this will only work if previous (archived) versions are available on the Web. Fortunately, MediaWiki is a Content Management System which implies that it maintains all revisions made to an article. This extension leverages this archiving functionality and provides native Memento support for MediaWiki.\n\nThis package contains the source code, build scripts, and tests for the Memento MediaWiki Extension.\n\nThis file also contains installation information, but more comprehensive information about the extension is at:  https://www.mediawiki.org/wiki/Extension:Memento\n\nNote: the released version of this extension does not contain this file, so the target audience for this file is those who wish to build/maintain the source code.\n\n# Directory Contents\n\n* Makefile - the build script that does all of the magic\n* README.md - this file\n* TODO - list of items to address in the codebase\n* Memento/ - the source code for this extension\n* externals/ - git submodule linking to the code verification rules at https://gerrit.wikimedia.org/r/p/mediawiki/tools/codesniffer.git\n* scripts/ - command line scripts used for testing the extension by hand\n* tests/integration/ - the integration tests\n* tests/lib/ - libraries needed by the tests\n* tests/data/ - data used by the tests\n\n\n# Installation\n\nTo install this package within MediaWiki perform the following:\n* copy the Memento directory into the extensions directory of your MediaWiki installation\n* add the following to the LocalSettings.php file in your MediaWiki installation:\n```\n    require_once \"$IP/extensions/Memento/Memento.php\";\n```\n\n# Configuration\n\nThis extension has sensible defaults, but also allows the following settings to be added to LocalSettings.php in order to alter its behavior:\n\n* `$wgMementoTimemapNumberOfMementos` - (default is 500) allows the user to alter the number of Mementos included in a TimeMap served up by this extension (default is 500)\n\n* `$wgMementoIncludeNamespaces` - is an array of MediaWiki Namespace IDs (e.g. the integer values for Talk, Template, etc.) to include for Mementofication, default is an array containing just 0 (Main); the list of MediaWiki Namespace IDs is at https://www.mediawiki.org/wiki/Manual:Namespace\n\n* `$wgMementoTimeNegotiationForThumbnails` - EXPERIMENTAL: MediaWiki, by default, does not preserve temporal coherence for its oldid pages.  In other words, and oldid (URI-M) page will not contain the version of the image that existed when that page was created.  See http://arxiv.org/pdf/1402.0928.pdf for more information on this problem in web archives.\n    * false - (default) do not attempt to match the old version of the image to the requested oldid page\n    * true - attempt to match the old version of the image to the requested oldid page\n\n# Packaging\n\nTo package the Memento MediaWiki Extension, type the following \nfrom this directory:\n\n    make package\n\nThis serves to run everything needed to verify the code and package the zip for release.\n\n# Automated Deployment for Testing\n\nTo deploy the Memento MediaWiki Extension locally for testing, one must first indicate to the shell where MediaWiki is installed, then run the appropriate make target.\n\n```\n    export MWDIR=<where your MediaWiki is installed>\n    make deploy\n```\n\nTo remove the software from a MediaWiki instance, type:\n\n```\n    make undeploy\n```\n\n# Integration Testing\n\nOnce the code is deployed, the integration tests can be run.\n\nRunning the integration tests requires phpunit and the curl command.\n\nYou will need to change the test data inside tests/integration/data to reflect your MediaWiki installation URIs and appropriate expected data.  Seeing as Mementos vary from site to site, it was decided not to come up with a \"one size fits all\" integration test set.  \n\nExample test data exists for our demo site in the 'demo-wiki' directory.  To use that test set, the XML dump within tests/data/demo-wiki-data can be imported into a test MediaWiki installation using mwdumper, as described at http://www.mediawiki.org/wiki/Manual:MWDumper.  DO NOT USE Special:Import or  if you are going to use this dataset as it is, because mwdumper preserves the oldid values, which are the bulk of the value found in this data set.\n\n**For more information on the integration tests and the test data format, consult the tests/integration/integration-test-description.html and tests/integration/how-to-read-output.txt files.  Detailed test output is generated in the build/test-output directory once the integration tests are run.**\n\nBefore running the tests you will need to set the following environment variables:\n* TESTDATADIR - the data directory containing the datasets for your test run\n* TESTUSERNAME - the username for logging into your MediaWiki instance, set to NOAUTH if no authentication needed\n* TESTPASSWORD - the password that goes with TESTUSERNAME, set to NOAUTH if no authentication needed\n\nTest output is saved to build/test-output.\n\nBecause of all of the possible combinations of configuration options, the following Make targets are intended to test the following capabilities:\n\n* defaults-integration-test - test an installation with the default settings\n\n* 302-style-time-negotiation-integration-test - test only the 302-style Time Negotiation capability of the install\n\n* friendly-error-with-302-style-integration-test - test the 302-style Time Negotiation error states with friendly output\n\nOf course, the fastest development process is:\n\n1. edit tests or change code, if necessary\n2. make undeploy && make clean package deploy\n3. run the integration test battery matching your deployment\n\n# Code compliance verification\n\nRunning the code compliance requires phpcs.\n\nThis git repository uses an external repository for coding convention rules, so we can update the coding convention rules at any time.  The git command for performing the initial import is:\n\n```\n    git submodule update --init\n```\n\nTo see if the code complies with MediaWiki's coding conventions, run:\n\n```\n    make verify\n```\n", 
  "id": 54161913
}