{
  "read_at": 1462555706, 
  "description": "Implementation of algorithms for source localization on graphs via l1 regularisation and spectral graph theory.", 
  "README.md": "# src-localization-graphs\nImplementation of algorithms for source localization on graphs via l1 regularization and spectral graph theory.\n\n## Installation\nFirst, make sure to download and install the [GSPBox](https://lts2.epfl.ch/gsp/), and [MatlabBGL](http://dgleich.github.io/matlab-bgl/). Then, in MATLAB, just change the current directory to the src-localization-graphs folder and run src\\_loc\\_start.m to add the needed dependencies to path.\n\nIf you want to work with John Snow's GIS data, and the ETEX data (see paper in the References section below), you will need to download and install the [load-data](https://github.com/rodrigo-pena/load-data) toolbox, and follow the instructions in the README file therein.\n\n##Folders\n###root\nContains the main functions of the toolbox. Use function **alt\\_opt.m** to simultaneously learn the source locations and the diffusion kernel. If the source locations are known, use **learn\\_param\\_kernel.m** to learn the diffusion kernel. If the diffusion kernel is known, use **learn\\_sparse\\_signal.m** to learn the source locations.\n\n###3rd_party/\nContains a third party function to plot error bars over a surface embedded in 3-dimensional space.\n\n###demos/\nContains demonstrations of what can be done with the toolbox. The names should be self explanatory.\n\n###experiments/\nContains the scripts for reproducing the experiments in [1].\n\n###solvers/\nContains the numerical solvers used in the alternate optimization problem: FISTA, and Newton's method.\n\n###utils/\nContains useful functions for the toolbox, such as error measures, parameter estimation and initialization strategies, etc.\n##References\n[1] R. Pena, X. Bresson, and P. Vandergheynst. \"Source Localization on Graphs via l1 Regularization and Spectral Graph Theory.\" On [arXiv](http://arxiv.org/abs/1603.07584).\n", 
  "id": 54215534
}