{
  "read_at": 1462554961, 
  "description": "", 
  "README.md": "# Conformal Project\n## Carnegie Mellon Conformal Inference Team: Max G'Sell, Jing Lei, Alessandro Rinaldo, Ryan Tibshirani, Larry Wasserman  \n**Maintained by Ryan Tibshirani**\n\nThis project contains software tools for conformal inference. The current \nemphasis is on conformal prediction in regression. Soon, we will add tools\nfor density estimation and classification.\n\nThe folder \"conformalInference\" can be installed as an R package, providing\naccess to the software tools, and the file \"conformalInference.pdf\" contains \ndocumentation. \n\nThe folder \"examples\" contains R code to reproduces all examples in the paper\n\"Distribution-Free Predictive Inference for Regression\" (see reference below).\nThis R code relies on the \"conformalInference\" R package.\n\nSome key references (in reverse chronological order):\n\n- \"Distribution-Free Predictive Inference for Regression\" by Jing Lei, \n  Max G'Sell, Alessandro Rinaldo, Ryan Tibshirani, and Larry Wasserman,\n  http://arxiv.org/pdf/xxxx.pdf, 2016.\n- \"Classification with Confidence\" by Jing Lei, Biometrika, 101(4), 755-769,\n  2014.\n- \"Distribution-Free Prediction Bands for Non-parametric Regression\" by\n  Jing Lei and Larry Wasserman, Journal of the Royal Statistical Society: \n  Series B, 76(1), 71-96, 2014.\n- \"A Conformal Prediction Approach to Explore Functional Data\" by Jing Lei,\n  Alessandro Rinaldo, and Larry Wasserman, Annals of Mathematics and Artificial\n  Intelligence, 74(4), 29-43, 2013.\n- \"Distribution Free Prediction Sets\" by Jing Lei, James Robins, and Larry \n  Wasserman, Journal of the American Statistical Association, 108(501), \n  278-287, 2013.\n- \"On-line Predictive Linear Regression\" by Vladimir Vovk, Ilia Nouretdinov,\n  and Alex Gammerman, Annals of Statistics, 37(3), 1566-1590, 2009.\n- \"Algorithmic Learning in a Random World\" by Vladimir Vovk, Alex Gammerman,\n  and Glenn Shafer, Springer, 2005.\n\n", 
  "id": 54260514
}