{
  "read_at": 1462555140, 
  "description": "A repository for drafting a report regarding \"Maximizing Science in the Era of LSST: A Community-based Study of Needed US OIR Capabilities\", with a particular focus on enabling LSST studies of dark energy.", 
  "README.md": "# Enabling LSST Dark Energy Science\n\nA repository for drafting a report regarding \"Maximizing Science in the Era of LSST: A Community-based Study of Needed US OIR Capabilities\", with a particular focus on enabling LSST studies of dark energy.\n\nTo compile the PDF:\n```\npdflatex maximizing_science_dark_energy.tex\n```\n\n## Current Goal, for March 28\n\nFor each science area, we should:\n\n1) Describe the science need in a few sentences at most\n\n2) Describe the needed capability (or capabilities) in enough detail\nthat someone could determine whether they overlap with other needs.\n(E.g.:  \"medium-resolution (R~4000-6000) spectroscopy covering the\nfull optical window for i<25.3 objects with multiplexing of ~1000 over\n~10 arcminute diameter fields\" could work, or for a differentcase\n\"optical medium-resolution spectroscopy with a highly-multiplexed\nspectrograph with a many-degree FoV on a 4m telescope\" would also give\nenough information to allow identification of common needs).\n\n----\n\n## TimeLine\n\n#### March 28\nStudy leads circulate a brief summary of what science motivates what capabilities.\nCapabilities described in enough detail for other groups to understand overlap.\n\n#### April 18\nStudy leads circulate brief \"whitepapers\" describing the science in greater detail and\nquantifying the capabilities. Similar to a rough draft of an NOAO observing proposal.\nIt has the same elements of compelling science, technical description and quantitative\nstatement of resource needs. But does not have to be very polished.\n\n#### May 2-4 Workshop\nFeedback from workshop used to refine white papers.\nSynthesis of needed capabilities, their prioritization, and roadmap of \"how to get there\"\ni.e., what exists and what investments needed.\n\n----\n\n## Resources\nMarch 28 is coming up quickly, but then again, this has been studied repeatedly for dark energy use cases.  Some resources we can use are:\n\n* The meeting report on \"Spectroscopy in the Era of LSST\" (http://arxiv.org/pdf/1311.2496.pdf)\nDescribes potential science and spectroscopy needs. See especially section  2.4 on Dark Energy & Cosmology (M. Wood-Vasey, facilitator);\nAppendix 1 is a summary of spectroscopic needs.  Note that for that report we were asked to provide estimates with no resource constraints; we need to be a little more realistic this go-round.\n\n* The Elmegreen report on \"Optimizing the U.S. Ground-Based Optical and Infrared Astronomy System in the Era of LSST\" (http://sites.nationalacademies.org/BPA/BPA_087934).\n\n* A Snowmass white paper on \"Spectroscopic Needs for Imaging Dark Energy Experiments\", http://arxiv.org/abs/1309.5384\n", 
  "id": 54422469
}