{
  "read_at": 1462555746, 
  "description": "Given piecewise patchy time series data, calculate the Kolmogorov structure functions at given order, and respective uncertainties.", 
  "README.md": "# patchSF\nGiven piecewise patchy time series data, calculate the Kolmogorov structure functions at given order, and respective uncertainties.  The code \"patchsf\" calculates the Kolmogorov structure function (at given order) from discrete time series data fron a 4-column input file.  Write a 4-column output file containing timescales, SF denominator, SF numerator, uncertainty.\n\nThe first command-line argument is the input data file.\n\nEXAMPLE:\n\n    ./patchSF signal.dat start=1. end=20. n=2 tmin=10. tmax=1.e3 ^results.dat\n \n COMMAND-LINE PARAMETERS & OPTIONS:\n \n    start   = use input data after this time\n    end     = use input data before this time\n    -logx   flag: take logarithm of independent variable (time)\n    -logy   flag: take logarithm of dependent variable (signal)\n    \n    n       = order of the structure function\n    try     = number of tau grid points -1\n    tmin    = shortest time-scale (tmin <= tau)\n    tmax    = longest time-scale (tau <= tmax)\n    \nAlternatively, calculate a Leahy normalised power spectrum.\n    -pds    flag: compute power density spectrum, not structure function\n \n Results are written into a file named after the host machine + \".dat\".\n An alternative output file can be named as:\n    ^blah.dat       send output to \"blah.dat\" \n \nCOMPILATION:\n\n    gcc -lm -lgsl -lgslcblas patchsf.c -o patchSF\n    \nHISTORY:\n\n    Written by Curtis J. Saxton (2011,2012).\n    Tidying by Curtis J. Saxton (20160306).\n\nIf you apply or adapt the structure function code in academic research, please cite the original method paper as a reference:\n\n    \"Long-term X-ray variability of Swift J1644+57\"\n     Curtis J. Saxton,  Roberto Soria,  Kinwah Wu,  N. Paul M. Kuin,\n     2012, Monthly Notices Royal Astronomical Society 422, 1625-1639.\n     http://dx.doi.org/10.1111/j.1365-2966.2012.20739.x\n     DOI: 10.1111/j.1365-2966.2012.20739.x\n     http://arxiv.org/abs/1201.5210\n     \n", 
  "id": 54430686
}