{
  "read_at": 1462555508, 
  "description": "use caffe for developing again ", 
  "README.md": "# Caffe\r\n\r\nThanks to the caffe contributors I have site the author of the origina version in the last. This is my version using and rechange on their basic version code for my reaearch.\r\n\r\n##Usage\r\n\r\nI use this the caffe for now is just useing the imagenet network. So my work is to using some auto complete scripts to produce my own module. There are total three directories which I am using:\r\n```\r\ndata/$MODULE\r\nexample/$MODULE\r\nmodule/$MODULE\r\npython/caffe/$MODULE\r\n```\r\nand its subfiles are all named with the $MODULE for different modules. Do like this can quickly deploy a module which is using the AlexNet network to train your module.\r\n\r\n##Still\r\nContributes to create our own network template and also use this quick deploy to produce our own different modules.\r\n\r\n\r\n##Project\r\n\r\n###FetchMe\r\n\r\nThe fethme project is my first project using CNN.\r\nThe aid of the project is to train a model to classify the cats and dogs. In order to compare with the paper CatsAndDogs I am using the same class number with the paper including 37 classes, especially *12 Cats* and *25 Dogs*. The main reason using caffe is for implementing the models which alreay trained in PC to simply upload the *Android*.\r\n\r\n\r\n\r\n## Contact\r\nWelcome to start playing CNN games with me.\r\nEmail: [chenguanfu511@gmail.com](chenguanfu511@gmail.com)\r\n\r\n## License and Citation\r\n\r\nCaffe is released under the [BSD 2-Clause license](https://github.com/BVLC/caffe/blob/master/LICENSE).\r\nThe BVLC reference models are released for unrestricted use.\r\n\r\nPlease cite Caffe in your publications if it helps your research:\r\n\r\n    @article{jia2014caffe,\r\n      Author = {Jia, Yangqing and Shelhamer, Evan and Donahue, Jeff and Karayev, Sergey and Long, Jonathan and Girshick, Ross and Guadarrama, Sergio and Darrell, Trevor},\r\n      Journal = {arXiv preprint arXiv:1408.5093},\r\n      Title = {Caffe: Convolutional Architecture for Fast Feature Embedding},\r\n      Year = {2014}\r\n    }", 
  "id": 54767076
}