{
  "read_at": 1462554945, 
  "description": "", 
  "README.md": "GPUGenie\n===\nGPUGenie is a Generic Inverted Index on the GPU. It builds the database from a csv file or a vector of instances. Then GPUGenie will consturct the inverted list table and transfer it to the device. GPUGenie provides a simple way to perform the similarity queries. User may define queries and their matching ranges, then directly call the matching funtion. The library will parallel process all queries and save the matching result into a device_vector. A top k search can also be simply perfromed. GPUGenie uses parallel searching to determine the top k values in a vector. It is much faster than the CPU searching algorithm. All device methods are wrapped in host methods. Developers are not required to configure the device function call. Please refer to the following document:\n\n```\nGeneric Inverted Index on the GPU, Technical Report (TR 11/15), School of Computing, NUS. \nGeneric Inverted Index on the GPU, CoRR arXiv:1603.08390 at www.comp.nus.edu.sg/~atung/publication/gpugenie.pdf\n```\n\n\n### Compiler and development\n\nYou are required to install gcc, g++, nvcc and cmake. Please make sure that the cmake version is greater tha nversion 2.8 and cuda 7.\n\nTo compile the program:\n\n```\ncmake .\nmake\n\n```\n\nYou can run 'make test' to check whether the library has been built.\nAfter compiling, you can go to folder \"example\", and type \"make\". Some running examples will be compiled fnd generated for testing.\n\nTo generate the documents of the project, just type\n\n\n```\nmake doc\n```\n\nThe documents (with html format and latex format) will be generated whinin the folder \"doc\"\n\n### Install\n\nYou are required to install gcc, g++, nvcc and cmake. Please make sure that the cmake version is greater than version 2.8 and cuda 7.\n\nTo install the libGPUGenie, directlly call the install script, `install.sh`.\n\n\n### Running example\nYou can see a running example in the folder \"example\".\nJust command:\n\n```cpp\ncd example\nmake\n```\n\nand then command\n\n```\n ./example_bin\n```\n\n\nYou can see the query results based on the data file \"sift_1k.csv\". \nThe exaple also gives an comprehensive description about the parameter. \n\nHow to use the library is also shown in the the file /example/makefile\n\n\n\n\n", 
  "id": 54948549
}