{
  "read_at": 1462555945, 
  "description": "", 
  "README.md": "# CortaSpoof\n\nCortaSpoof est un logiciel developpe dans le cadre d'un projet sur la confidentialite de Windows 10 dans le laboratoire CVO de l'ESIEA a Laval. Pour plus d'information sur le projet  (lien article arxiv)\n\n \n## 1. Introduction sur Cortana \n\nEn juillet 2015, Microsoft sort son nouvel OS Windows 10. Cet OS est plein de nouvelles fonctionnalites, celles-ci sont presentes pour faciliter l'utilisation de l'utilisateur. Parmi ces fonctionnalites ce trouve l'assistant de recherche vocal Cortana.\n\n\t \n### 1.1. Qu'est-ce que Cortana \n\nLe nom de Cortana provient du jeu video << Hallo >> developpe exclusivement sur Xbox la console de Microsoft. Cortana est le nom d'une intelligence virtuel assistant les soldats Spartan dans leurs missions. \nDans Windows 10, Cortana est une assistante vocale personnelle intelligente. Le service se presente dans une barre en bas a gauche de l'ecran. Dans cette barre l'utilisateur de Windows 10 peut effectuer une recherche sur internet ou encore rechercher un logiciel ou un fichier present sur son ordinateur. La recherche peut se faire en tapant le texte de la recherche dans la barre ou par la voix lorsque l'outil est totalement configure. \n\n \n### 1.2. Les dangers de son utilisation \n\nLorsque le logiciel est totalement configure, Cortana a acces a une grande partie des informations personnelles de l'utilisateur, cela afin d'en apprendre le plus possible sur ses habitudes, ses gouts ou sa facon de parler. Le profil ainsi fait peut etre tres proche de la realite. Microsoft se permet donc une grande intrusion dans notre vie privee avec ce service. Les donnees envoyees a Microsoft sont gigantesques et sont utilisation par Microsoft peut etre douteuse puisque dans ses mentions legales Microsoft peut acceder a ces donnees si de << bonne foi >> il en recent le besoin. \nLa recherche web peut etre desactivee sur Cortana, il suffit alors d'aller dans les parametres du service. \n\n\nSon utilisation reste tout de meme appreciee par beaucoup, plutot que de desactiver totalement le service pourquoi ne pas bruiter totalement le service. Le but de CortaSpoof est justement d'envoyer en continu de fausses requetes aux serveurs de Microsoft, ainsi les donnees reellement envoyees par l'utilisateur sont noyees dans la masse de fausses donnees envoyees. \n\n## 2. Demarrer avec CortaSpoof \n\n### 2.1. Choix des trames a bruiter \n\nAvant d'envoyer la requete de recherche, Cortana envoie de nombreuses requetes, le logiciel permet d'en reproduire certaines d'entre elles, dont l'initialisation ou encore d'autres, sur le diagnostic d'utilisation. La plus importante restant la requete de recherche. \nExemple requete de recherche.\n\n Liste des trames :  \n Cortana Init : initialisation du service.  \n Cortana manifest spoofing : enumere les ressources contenues et decrit le contenu du paquet  \n Cortana query spoofing : requete de recherche.  \n Cortana zinc :  \n\n \n### 2.2. Demarrer et arreter le bruitage de Cortana \n\nPour commencer le bruitage, il suffit de cliquer sur le bouton << love Microsoft >>. Il est possible d'ajuster la vitesse d'envoi des paquets avec le curseur juste au-dessus du bouton.\nPour l'arret, il suffit de cliquer sur le bouton, \"stop spoofing\". La fermeture du logiciel entraine aussi l'arret du bruitage. \n\n \n### 2.3 Donnees envoyees \n\nUne requete d'une recherche ressemble a :  \n GET /AS/API/WindowsCortanaPane/V2/Suggestions?qry=about&cp=5&cvid=ce8c2c3ad6704645bb207c0401d709aa&ig=7fdd08f6d6474ead86e3c71404e36dd6&cc=US&setlang=en-US HTTP/1.1  \n Accept:                        */*  \n X-BM-ClientFeatures:           FontV4, OemEnabled  \n X-Search-SafeSearch:           Moderate  \n X-Device-MachineId:            {73737373-9999-4444-9999-A8A8A8A8A8A8}  \n X-BM-Market:                   US  \n X-BM-DateFormat:               M/d/yyyy  \n X-Device-OSSKU:                48  \n X-Device-NetworkType:          ethernet  \n X-BM-DTZ:                      -420  \n X-BM-UserDisplayName:          Tester  \n X-DeviceID:                    0100D33317836214  \n X-BM-DeviceScale:              100  \n X-Device-Manufacturer:         innotek GmbH  \n X-BM-Theme:                    ffffff;005a9e  \n X-BM-DeviceDimensionsLogical:  320x622  \n X-BM-DeviceDimensions:         320x622  \n X-Device-Product:              VirtualBox  \n X-BM-CBT:                      1439740000  \n X-Device-isOptin:              false  \n X-Device-Touch:                false  \n X-AIS-AuthToken:               AISToken ApplicationId=25555555-ffff-4444-cccc-a7a7a7a7a7a7&ExpiresOn=1440301800&HMACSHA256=CS\n                                y7XaNyyCE8oAZPeN%2b6IJ4ZrpqDDRZUIJyKvrIKnTA%3d  \n X-Device-ClientSession:        95290000000000000000000000000000  \n X-Search-AppId:                Microsoft.Windows.Cortana_cw5n1h2txyewy!CortanaUI  \n X-MSEdge-ExternalExpType:      JointCoord  \n X-MSEdge-ExternalExp:          sup001,pleasenosrm40ct,d-thshld42,d-thshld77,d-thshld78  \n Referer:                       https://www.bing.com/  \n Accept-Language:               en-US  \n Accept-Encoding:               gzip, deflate  \n User-Agent:                    Mozilla/5.0 (Windows NT 10.0; Win64; x64; Trident/7.0; rv:11.0; Cortana 1.4.8.152;  \n                                10.0.0.0.10240.21) like Gecko  \n Host:                          www.bing.com  \n Connection:                    Keep-Alive  \n Cookie: SA_SUPERFRESH_SUPPRESS=SUPPRESS=0&LAST=1439745358300; SRCHD=AF=NOFORM; ...  \n\nCette requete HTTPS contient de nombreux headers. Ces headers contiennent principalement des informations sur la machine utilisee. \n\n X-Search-SafeSearch:\t\t  filtre plus ou moins les contenus pour adulte  \n X-Device-MachineId:            identifiant de la machine  \n X-BM-Market:                   nationalite du Windows store  \n X-BM-DateFormat:               format d'ecriture de la date  \n X-Device-OSSKU:                version de Windows  \n X-Device-NetworkType:          moyen de communication internet utilisee  \n X-BM-DTZ:                      usage inconnu  \n X-BM-UserDisplayName:          nom de l'utilisateur  \n X-DeviceID:                    identifiant Cortana (pas sure)  \n X-BM-DeviceScale:              pourcentage d'occupation de l'image a l'ecran  \n X-Device-Manufacturer:         constructeur de la machine  \n X-BM-Theme:                    couleur principale du theme Windows  \n X-BM-DeviceDimensionsLogical:  taille de la fenetre cortana  \n X-BM-DeviceDimensions:         taille de la fenetre cortana  \n X-Device-Product:              nom du produit  \n X-BM-CBT:                      identifiant de la recherche (pas sure)  \n X-Device-isOptin:              usage inconnu  \n X-Device-Touch:           la machine est tactile ou non  \n\n \n## 3. Utilisation de CortaSpoof \n\n### 3.1. Personnalisation du header \n\nIl est possible de personnaliser chacun des champs du header en cliquant sur le bouton << custom >>.\n\n\n\nChaque champ peut alors etre modifie. \nUn champ mal renseigne est colore en rouge.\nIl est possible de renseigner un champ par une valeur aleatoire en cliquant sur le point interrogation juste a cote de celui-ci.\nUn clique sur le bouton d'aide a cote de la croix de fermeture de la fenetre permet a l'utilisateur d'avoir plus d'information sur un champ souhaite.\n \n\n \n### 3.2. Ajouter des expressions \n\nPar defaut, les recherches envoyees sont choisies aleatoirement dans un dictionnaire de la langue de votre machine. Mais il est possible pour l'utilisateur d'envoye en mot unique en decochant la case << use dico >>. \nLes listes d'expressions sont disponibles dans le dossier \"dico\". Suivant la langue choisie, le fichier correspondant sera choisi pour l'envoi de recherche aleatoire. Il est possible a l'utilisateur de modifier cette liste en y ajoutant ses propres termes de recherche. \n\n \n### 3.3. Enregistrement des donnees personnalisees \n\nLorsque le programme est quitte, toutes les informations renseignees dans le logiciel sont enregistrees dans le fichier << backup >> dans le meme dossier que l'executable. Lors d'un prochain demarrage du logiciel, il est demande a l'utilisateur s'il veut oui ou non charger les donnees de cette sauvegarde.\n\n", 
  "id": 55045422
}