{
  "read_at": 1462826600, 
  "description": "Continuous and High-Throughput Allocation of Digital Object Identifiers for Materials Data in the Materials Project", 
  "README.md": "# MPCite\n\n```\nContinuous and High-Throughput Allocation of Digital Object Identifiers\nfor computed and contributed Materials Data in the Materials Project\n        - Submitted to \"Reproducibility\" mini-symposium of SciPy16 (http://scipy2016.scipy.org)\n```\n\n## Brief Description\n\n\"MPCite\" enables the continuous request, validation, and dissemination of\nDigital Object Identifiers (DOIs) for all inorganic materials currently\navailable in the Materials Project (MP, www.materialsproject.org). The library\nprovides MP's users with the necessary software infrastructure to achieve a new\nlevel of reproducibility in their research: (i) convenient and persistent\ncitation of MP's materials data in online and print publications, and (ii)\nfacilitated sharing amongst collaborators. \"MPCite\" can also be employed for\nthe assignment of DOIs to non-core database entries such as theoretical and\nexperimental data contributed through \"MPContribs\" or suggested by the user for\ncalculation via the \"MPComplete\" service. The fundamental principle underlying\nMPCite can easily be extended to other scientific domains where the number of\ndata records demands high-throughput and continuous allocation of DOIs.\n\n## Long Description\n\nThe new open-source software package, \"MPCite\" [1] enables the continuous\nrequest, validation, and dissemination of Digital Object Identifiers (DOIs) for\nall >70k inorganic materials currently available in the Materials Project (MP,\nwww.materialsproject.org) database. Materials defined by a set of similar\ninorganic crystal structures are a good match for DOIs because they have a\nunique and stable definition. The functionality provided by MPCite is\nincreasingly important in support of \"MPComplete\", a service where users\nsuggest new compounds for which MP will calculate detailed electronic structure\nproperties. MPComplete then automatically integrates the results of each\ncalculation with MP's core dataset. Users are increasingly willing to delegate\ncomputation to MP because they quickly get reproducible results from a trusted\nanalysis pipeline with DOIs they can cite in their follow-up analysis papers.\n\nThe DOE Office of Scientific and Technical Information (OSTI) [2] provides the\nE-Link service and programming interface free of charge to DOE-funded\nscientific projects. It allows researchers to submit information about OSTI\nproducts (in form of XML meta-data records) and retrieve a persistent DOI to\nidentify it on the world wide web. DOIs are most commonly used for referencing\nand locating journal papers because they provide a unique URL linking to the\njournal's online landing page with more information about the publication. The\nlanding page might change over time, but the DOI - once requested - is\nimmutable.\n\nWith MPCite, we are expanding and applying the use of DOIs from papers, reports\nand small singular/static datasets to the ever-growing set of materials data\navailable in MP. For OSTI, the tens of thousands of requests from a single\nclient constitutes an unprecedented scale. The resulting workload can only be\nmanaged with a continuously running task manager which sends requests to OSTI\nin chunks to initially achieve full DOI coverage within a few months. Not only\ndoes the manager subsequently keep requesting DOIs as new materials become\navailable, it also assures the propagation of updates in materials data to OSTI\nwithout duplicating DOIs. To support such a \"high-throughput\" mode, MPCite\nincludes self-healing error handlers and monitoring capabilities that are\nusually not required when dealing with up to a few dozen DOI requests and one\nentry at a time. Another integral task of the DOI manager is the automated\ngeneration of BibTeX strings for each material, which are also used to validate\nthat the DOIs successfully resolve to the appropriate landing page. This\nfunctionality is exposed to the user on the materials details page in our\nportal [3]. MPCite interactively live-monitors the overall status of requested\nversus validated DOIs in comparison to the total number of materials through\nPlotly's Streaming API [4]. In recognition that user analyses will often use\nmany related materials, the user can also manually request a representative DOI\nthrough our portal to reference a collection of materials used in his analysis,\nor to share it with collaborators.\n\nIn summary, our efforts to assign DOIs to all materials available in MP\nprovides our users with the necessary software infrastructure to achieve a new\nlevel of reproducibility in their research. This is not only evident in the\nconvenient and persistent citation of our materials data in online and print\npublications, but also in the facilitated sharing amongst collaborators. In the\nfuture, we plan to extend the use of DOIs to non-core database entries such as\ntheoretical and experimental data contributed by our users through \"MPContribs\"\n[5]. Once established in MP, MPCite can also be easily extended to other\nscientific domains where the number of data records demands the high-throughput\nand continuous allocation of DOIs.\n\n[1] MPCite, https://github.com/materialsproject/MPCite  \n[2] OSTI, https://www.osti.gov  \n[3] Example Materials Detail Page for As (mp-10), http://dx.doi.org/10.17188/1184812  \n[4] Plotly, https://plot.ly  \n[5] MPContribs, arXiv:1510.05024, arXiv:1510.05727, MRS Spring 2016\n", 
  "id": 55206793
}