{
  "read_at": 1462548434, 
  "description": "A Python implementation of the spherical EMC algorithm -- An algorithm for intensity reconstruction in single-particle imaging experiments", 
  "README.md": "# spherical EMC\n\nA Python implementation of the spherical Expansion-Maximization-Compression algorithm -- An algorithm for intensity reconstruction in single-particle imaging experiments\n\nThe code comes in addition of the paper \n> Flamant, J., Bihan, N.L., Martin, A.V. and Manton, J.H., 2016. A spherical harmonic approach to single particle imaging with X-ray lasers.\n\navailable at http://arxiv.org/abs/1602.01301\n\n## Requirements\n\nCode has been tested for Python 3.5, but it should work for any Python 3.x version. Several packages are required:\n\n- [NumPy](http://www.numpy.org)\n- [SciPy](https://www.scipy.org)\n- [Matplotlib](http://matplotlib.org)\n- [Healpy](https://github.com/healpy/healpy)\n- [periodictable 1.4.1](https://pypi.python.org/pypi/periodictable): X-ray scattering factors database\n- [BioPython](http://biopython.org/wiki/Main_Page): Especially the module bio.pdb, to parse PDB files\n\n\n## Overview\n\nThis repository contains several Python codes to simulate diffraction patterns, and reconstruct the 3D intensity function using the shell-by-shell approach developed in the paper. \n\n- **dataGeneration/** contains routines to generate *diffraction patterns* on a specified spherical shell. \n- **requiredPatterns/** contains a script to estimate the required number of diffraction patterns to reconstruct the intensity.\n- **sphericalEMC/** contains the spherical EMC code, as well as the shell realignment procedures. \n\n## Usage example\n1. Select one shell index, and compute the theoretical shell intensity using *compute3DIntensityShell.py*\n2. Use *generateSamplesShell.py* to generate nbSamples on this shell, that is nbSamples 'diffraction patterns' on this shell. (These are Poisson realization of the intensity at randomly rotated versions of the detector reference sampling points)\n3. Use *sphericalEMC.py* to reconstruct the shell intensity, up to some specified bandlimit $L$.\n4. Iterate this procedure (which can be parallelized) for successive shells, and realign the shells using *shellAlignment.py*.\n\n", 
  "id": 55353398
}