{
  "read_at": 1462547912, 
  "description": "", 
  "README.md": "# Caffe SegNet\n**This is a modified version of [Caffe](https://github.com/BVLC/caffe) which supports the [SegNet architecture](http://mi.eng.cam.ac.uk/projects/segnet/)**\n\nAs described in **SegNet: A Deep Convolutional Encoder-Decoder Architecture for Image Segmentation** Vijay Badrinarayanan, Alex Kendall and Roberto Cipolla [http://arxiv.org/abs/1511.00561]\n\n## Getting Started with Example Model and Webcam Demo\n\nIf you would just like to try out a pretrained example model, then you can find the model used in the [SegNet webdemo](http://mi.eng.cam.ac.uk/projects/segnet/) and a script to run a live webcam demo here:\nhttps://github.com/alexgkendall/SegNet-Tutorial\n\nFor a more detailed introduction to this software please see the tutorial here:\nhttp://mi.eng.cam.ac.uk/projects/segnet/tutorial.html\n\n### Dataset\n\nPrepare a text file of space-separated paths to images (jpegs or pngs) and corresponding label images alternatively e.g. ```/path/to/im1.png /another/path/to/lab1.png /path/to/im2.png /path/lab2.png ...```\n\nLabel images must be single channel, with each value from 0 being a separate class. The example net uses an image size of 360 by 480.\n\n### Net specification\n\nExample net specification and solver prototext files are given in examples/segnet.\nTo train a model, alter the data path in the ```data``` layers in ```net.prototxt``` to be your dataset.txt file (as described above).\n\nIn the last convolution layer, change ```num_output``` to be the number of classes in your dataset.\n\n### Training\n\nIn solver.prototxt set a path for ```snapshot_prefix```. Then in a terminal run\n```./build/tools/caffe train -solver ./examples/segnet/solver.prototxt```\n\n## Publications\n\nIf you use this software in your research, please cite our publications:\n\nhttp://arxiv.org/abs/1511.02680\nAlex Kendall, Vijay Badrinarayanan and Roberto Cipolla \"Bayesian SegNet: Model Uncertainty in Deep Convolutional Encoder-Decoder Architectures for Scene Understanding.\" arXiv preprint arXiv:1511.02680, 2015.\n\nhttp://arxiv.org/abs/1511.00561\nVijay Badrinarayanan, Alex Kendall and Roberto Cipolla \"SegNet: A Deep Convolutional Encoder-Decoder Architecture for Image Segmentation.\" arXiv preprint arXiv:1511.00561, 2015. \n\n\n## License\n\nThis extension to the Caffe library is released under a creative commons license which allows for personal and research use only. For a commercial license please contact the authors. You can view a license summary here:\nhttp://creativecommons.org/licenses/by-nc/4.0/\n", 
  "id": 55514000
}