{
  "read_at": 1462548305, 
  "description": "GPU implementation of LATCH descriptor & matcher. ", 
  "README.md": "# CUDA implementation of the LATCH descriptor & brute-force matcher\n\nThis is a high performance GPU implementation of the [LATCH descriptor](http://www.openu.ac.il/home/hassner/projects/LATCH/) invented by [Gil Levi](https://gilscvblog.com/2015/11/07/performance-evaluation-of-binary-descriptor-introducing-the-latch-descriptor/) and [Tal Hassner](http://www.openu.ac.il/home/hassner/). Please reference: \"LATCH: Learned Arrangements of Three Patch Codes\", IEEE Winter Conference on Applications of Computer Vision (WACV), Lake Placid, NY, USA, March, 2016.\n\nPull requests (and feature requests!) are encouraged. This repository is under active development.\n\n[![IMAGE ALT TEXT](http://img.youtube.com/vi/zmfLZY7T6Qg/0.jpg)](http://www.youtube.com/watch?v=zmfLZY7T6Qg \"Video Title\")\n\nOn a GTX 970M I see 10^6 descriptor extractions per second, and 3*10^9 comparisons per second. A GTX 760 sees 70% of this speed. NVidia graphics card with CUDA compute capability >=3.0 required.\n\nLook at min.cpp for a minimal introduction. Compile it with \"make min -j7\". Run it as \"./min 1.png 2.png\"\n\nvo.cpp has a better example of how you can hide 100% of the processing time of the GPU. The quickest way to see it in action is to install \"youtube-dl\" and then run \"make demo -j7\". Or you could just watch this video: https://www.youtube.com/watch?v=zmfLZY7T6Qg I see cumulative 43ms of CPU overhead for GPU processing of 4250 frames of 1080p video.\n\nNote that currently each descriptor is 2048 bits but the last 1536 bits are 0. I was originally planning on building larger variants: true 1024 bit and 2048 bit LATCH descriptors.\n\nCurrent features:\n- hardware interpolation for oriented descriptors at no performance overhead\n- arbitrary scaling of region of interest at no performance overhead\n- customizable importance masking for patch triplet comparisons at no performance overhead\n- asynchronous GPU operation\n- fast cross-checking (symmetry test) with event-driven multi-stream matching kernel\n\nApproximate order of upcoming features:\n- multichannel support ( http://arxiv.org/abs/1603.04408 )\n- extractor kernel granularity optimization (possibly increased extractor speed)\n- documentation\n- 512 bit matcher (increased matcher speed)\n- API improvements (currently a mess)\n- CUDA implementation of adaptive grid FAST detector\n- offline parameter optimization with PyGMO\n- integration into OpenCV\n\nMulti-GPU support is not currently planned. Please contact me if you have a use case that requires it.\n\nThis work is released under a Creative Commons Attribution-ShareAlike license. If you use this code in an academic work, please cite me by name (Christopher Parker) and link to this repository.\n\nPlease email me if you have any questions: csparker.work@gmail.com\n", 
  "id": 55573160
}