{
  "read_at": 1462548518, 
  "description": "Website for UCLA’s Astro Coffee", 
  "README.md": "# Astro Coffee 2\n\nTools for generating and running a website for paper discussions.\n\nAstro Coffee 2 is written by Abhimat Gautam (UCLA). It is based on the original version by Ian J. Crossfield and Nathaniel Ross, and subsequent updates by Ryan T. Hamilton and Fred Davies.\n\nCurrent To-Dos:\n* Caching information pulled in for papers, so don't have to re-parse every paper every time page is updated.\n* Allowing PDF links for sites that offer easy to deal with links (e.g. arXiv, MNRAS).\n* Documentation and tools to allow setting up on independent servers.\n\nDocumentation from previous versions below:\n\n---\n\n=============\nIntroduction:\n=============\n\nThis distribution are designed to generate a freestanding, maintenance-free web\nsite for listing arXiv.org files (or other URLs), as seen at\nhttp://astronomy.nmsu.edu/agso/coffee. \n\nA PHP-enabled web site lists submitted articles, has an input form for\nsubmitting additional articles of interest, and upon submission the site\nautomatically updates the PHP code. Items can be subsequently deleted from the\nlist using a password-protected PHP text editor. \n\nAstroph.py was created at UC Los Angeles by Ian J. Crossfield and Nathaniel\nRoss. \n\nIt was then heavily edited by Ryan T. Hamilton at New Mexico State University,\nand became this distributed version, available at\nhttps://bitbucket.org/astrobokonon/astrocoffee/ \n\nRe-use or modification is allowed and encouraged, so long as proper\nacknowledgement is made to the original authors and institutions.\n\nBug reports, suggestions, or just emailing to say that the code has been useful\nare all greatly encouraged!\n\nRyan Hamilton\nAstronomy Graduate Student\nNew Mexico State University\nrthamilt@nmsu.edu\nhttps://bitbucket.org/astrobokonon/astrocoffee/overview\n\n=====================================\nInstallation of the astroph.py Suite:\n=====================================\n\nThis will hopefully get you up and running with the code.  The instructions are\nlong.  Sorry.  Please follow along and you should be fine.  If all else fails,\nyou can email me!  It's likely that there are bugs, and I'll be happy to take a\nlook and see if the problem is on your end or in the code somewhere that needs\nto be fixed.  \n\nThis will follow N steps; general requirements, changes to the .py files,\nchanges to the .php files, additional comments, and debugging hints.\n \n=====================\nGeneral Requirements:\n=====================\n\n1) You need a web server with PHP and Python scripting enabled.  Plenty of web\nresources exist to guide you through configuration of your particular web\nserver.  In addition, you need to have the 'dateutil' module available through\nPython.  To check, start Python and type \n\nimport datetime\nfrom dateutil.relativedelta import relativedelta, MO, TU, WE, TH, FR, SA, SU\n\nIf either of these give an import error, contact your local system\nadministrator or check for a different version of Python to run.  It is not\nuncommon to have many versions of Python living together on the same server for\ncompatibility with pyraf and the STSCI Python packages.  \n\nThis was built and tested using Python v2.5, v2.6, and v2.7.x; haven't tested\nagainst Python 3.x at all.\n\n2) Contrary to previous versions, BeautifulSoup 4.3.2 is now included.  It's\ngreat.\n\n=========================\nChanges to the .py Files:\n=========================\n\nThe following files should be edited by the user:\n\n./Private/passwords.py\nruncoffee.py\n\nruncoffee.py\n------------\n\nYou should first edit the runcoffee.py file to change the date and time of the\nmeeting, as well as who gets the error email when something goes wrong.  See\nthe 'day', 'hour', 'min', and 'responsibles' variables at the top of this file.\n\n'day' is a two letter abbreviation of a weekday, where the abbreviations\n(starting with Monday) are MO, TU, WE, TH, FR, SA, SU.  'hour' should be input\nin 24h ('military time'), but are converted to the normal US format for display\npurposes.\n\nWhen errors are found, it will send an automated message to those listed in the\n'responsibles' variable.  The contents of that message can be found in the file\nerror.mail.  If you'd like to change who the email appears to be coming from,\nthen change the 'whosend' variable to what you'd like.  This is the newest\nsection of the code and could need some adjustments, so bugs are likely.  It\nmight be necessary to change the 'server' variable to be whatever your mail\n(SMTP) server should be.  See the send_error_mail.py file and the python smtp\ndocumentation for more details/help.\n\nIf you'd like the ability to comment on each posting, then it is possible using\nIntenseDebate.  Please follow these directions, which admitedly may have\nchanged since I first wrote this section of the code.\n\n   --- Sign up at IntenseDebate.com\n   --- Be sure to click the box to use IntenseDebate on my website/blog.  \n   --- After verifying your email address, add your website address   \n   --- Click on 'Generic Install'  \n         All we need from the code is the value of 'var idcomments_acct=', \n   --- In runcoffee.py, change 'idcomments = False' to '= True'\n   --- In runcoffee.py replace YOURHASHGOESHERE with that value and comment \n         out the line 'idcomments=False' line.  \n         *** Be sure you have the single quote ticks (\\') properly escaped ***\n   --- At the top of the IntenseDebate page goto 'Sites', clicking on your \n         newly setup website, and then in the 'Settings->Misc' section \n   --- Set your comment location to 'Frontpage'.  \n\nThen you can customize to your heart's content, including adding Facebook\nConnect and logging in via OpenID and Twitter as well.\n\npasswords.py\n------------\n\nOne should change the username, password, and salt variables in the\npasswords.py file in the ./Private directory, run it, and then copy and paste\nthe output into the listmanager.php file.  This insures a bit more security\nthan having the username and password in plaintext in the listmanager.php file,\nthough the salt is there for any enterprising young hacker.  \n\n==========================\nChanges to the .php Files:\n==========================\n\nThe following files should be edited by the user:\n\nindex.php\nlistmanager.php\n\n1) See the passwords.py section above and make the necessary changes in\nlistmanager.php\n\n2) Determine the path to your python executable and set the $python variable in\nboth index.php and listmanager.php to point towards it.  This also allows you\nto specify a particular version if multiple exist.  Typically the full path is\nrequired, though not always.  If in doubt, ask your sysadmin.  Incorrect or\nnon-functional versions of this will cause the code to fail, silently.\n\n3) Change your timezone in the index.php and listmanager.php files to match\nyour own.  The format for the timezone string can be found at the link in the\nphp file or be found via the googles.\n\n4) You'll need to change the affiliation to your own institution/group in the\nfollowing files:\n\n./index.php\n./archive_top.php\n./archive_bottom.php\n./useful.links\n./general.links\n\nYou can change the CSS to your own needs on your own time, if you're setting\nthis up you probably know more than enough to change the weather links and\ninsert a calendar or whatever else you need to do.  You can add in your own\ncustomizations by changing the contents of the sidebars in the index.php file.\nSee <h2>Weather Checks</h2>, <h2>Useful Links</h2>, <h2>General Links</h2>, and\n<h2>Calendar</h2> sections.  \n\nBe careful to mind the <div> tags when adding/changing things since and\nextra/missing ones will cause the page to look like crap and the CSS to go\nnuts.\n\nYou probably can use a different CSS sheet, though I don't guarantee that it\nwill work very well without editing astroph.py to close the correct <div>'s.\nYour Milage May Vary.\n\n============\nFinal Steps:\n============\n\n1) Once you have everything the way you'd like it to be, execute the Perms.sh\nfile to make sure the permissions are set as they should.  It will attempt to\nset the permissions necessary for you, but you should double check to see if\nthe choices make sense.  \n\nThe *.php files, papers, and dregs.log will all be continually updated, and so\nneed to have at least write access enabled.  You will want to update the *.txt\nfiles to customize your page, but after that they only need read access\nenabled, as do the *.py files.  ./Archive needs full read/write access as well.\n\nPermission errors will cause the scripts to fail silently and not update\nanything.\n\n2) To control access and try to prevent spam, determine your CIDR address range\nand change the htaccess file to match.  This will give a 403 Forbidden error to\nany address not in the CIDR range, and is a quick and easy way to prevent spam\nbots from polluting the page.  You can also add specific IPs to allow, though\nthis is a bit difficult unless you have known/static IP addresses.  \n\nThe htaccess file included in the tarball is an example of what I use.  IF YOU\nCHOOSE TO USE THIS FEATURE, rename 'htaccess' to '.htaccess' after you\ndetermine your CIDR range.\n\n================\nDebugging Hints:\n================\n\nAt this point, everything should be set up.  Point your webbrowser towards\nwhere you set things up, and try a valid submission.  Wait a (few) minutes and\nrefresh the page, and it all is well then you should be good to go!\n\nIf things have not updated, there are a few things to try:\n\n   --- Check the directions again, making sure you have not missed any steps :)\n   --- Check the file permissions.  Incorrect file permissions will cause the \n         code to fail silently.\n   --- Check your python path/executable.  Incorrect values/versions will cause \n         the code to fail silently.\n   --- Attempt to run the code as a (normal non-root) user.  In the directory, \n         'touch papers; python runcoffee.py' \n         and check for any exceptions/errors.\n   --- Email me or ask your local computer or *nix guru for help\n\nstatus.log and dregs.log can be very useful to see what's going on with the\ncode and should (hopefully) let you see how far things have progressed before\ndying on you.\n\nIf all else fails, you can email me!  It's likely that there are bugs, and I'll\nbe happy to take a look and see if the problem is on your end or in the code\nsomewhere that needs to be fixed.  Bug reports, suggestions, or just emailing\nto say that the code has been useful are all greatly encouraged!\n\nRyan Hamilton\nVisiting PostDoctoral Scientist\nSOFIA-USRA\nastrobokonon@gmail.com\nhttps://bitbucket.org/astrobokonon/astrocoffee/overview\n", 
  "id": 55673148
}