{
  "read_at": 1462548374, 
  "description": "Make identitifiers in lots of Ways", 
  "README.md": "# Identitas\n\nA set of libraries for coining, manipulating and checking identifiers.\n\nAn identifier is short string or integer which is used to represent other\nthings, called here the *identifed*, such as database records, terms in an\nontology or physical entities such as a people or proteins. Identifiers are\n*semantics-free* -- that is they do not depend on the characteristics of the\nthing that they represent; therefore, they can remain constant, even while the\nidentified changes.\n\nIdentifier schemes can have many different characteristics, many of which\nconflict. A good identifier scheme, therefore, is one that makes the correct\ncompromises for the requirements.\n\nIdentitas provides the following functionality:\n\n - proquint: functions to convert between numbers and an equivalent\n   \"pronouceable\" version, following the\n   [http://arxiv.org/html/0901.4016](proquint) scheme.\n - damm: check-digits using the [http://arxiv.org/html/0901.4016](Damm) algorithm.\n - core: combining all of these!\n\n## Usage\n\n### Proquint\n\nProquint are a transformation from numbers to a more pronounceable form.\n\n    (identitas.proquint/int-to-proint 0)\n    ;; => \"babab-babab\"\n\n    (identitas.proquint/int-to-proint Integer/MAX_INTEGER)\n    ;; => \"luzuz-zuzuz\"\n\n\nAs an extension to original algorithm, we also provide support short and long\ntransformations, useful depending on the size of identifier space required.\n\n    (identitas.proquint/short-to-proshort 0)\n    ;; => \"babab\"\n\n    (identitas.proquint/long-to-prolong 0)\n    ;; => \"babab-babab-babab-babab\"\n\n\n\n\n## License\n\nThe contents of this file are subject to the LGPL License, Version 3.0.\n\nCopyright (C) 2016, Phillip Lord, Newcastle University\n\nThis program is free software: you can redistribute it and/or modify it\nunder the terms of the GNU Lesser General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or (at your\noption) any later version.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT\nANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\nFITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License\nfor more details.\n\nYou should have received a copy of the GNU Lesser General Public License\nalong with this program. If not, see http://www.gnu.org/licenses/.\n", 
  "id": 55980186
}