{
  "read_at": 1462548126, 
  "description": "Analytic and compact perturbative expressions for neutrino oscillations in matter", 
  "README.md": "Nu-Pert\n=\n\n| master | version | coverage |\n|:------:|:-------:|:--------:|\n|[![Build Status](https://travis-ci.org/PeterDenton/Nu-Pert.svg?branch=master)](https://travis-ci.org/PeterDenton/Nu-Pert)|[![GitHub Version](https://badge.fury.io/gh/PeterDenton%2FNu-Pert.svg)](http://badge.fury.io/gh/PeterDenton%2FNu-Pert)|[![Coverage Status](https://coveralls.io/repos/github/PeterDenton/Nu-Pert/badge.svg?branch=master)](https://coveralls.io/github/PeterDenton/Nu-Pert?branch=master)|\n\n## Overview\nThis code provides a very precise, yet still useful analytically, means of calculating the neurtino transition probabilities in uniform matter densities.\nWe have included our results to various orders in a perturbative expansion.\nOur perturbative expansion is proprotional to the ratio of the two measured <nobr>Delta m<sup>2</sup>'s</nobr>.\nIt is smaller than 1.5% and is exactly zero in vacuum.\n\nZeroth order is more than sufficient for any modern neutrino experiment with precision on the order of 10<sup>-4</sup>.\nFirst order improves this by about three more orders of magnitude.\nSecond order is also included through a different code that provides about three more orders of magnitude in precision, and, in some cases, hits the limit of double precision.\nThese results contain all orders in the matter potential and in s<sub>13</sub>.\n\n## About the code\nEquation numbers are provided where possible which reference [arXiv:1604.08167](https://arxiv.org/abs/1604.08167) unless otherwise stated.\nThe various namespaces throughout the code refer to the various steps and means of calculating the transition probabilities.\n\nFirst, the `Hat` namespace is in reference to the intermediate basis after the 23 and 13 rotations.\nThe `Hat` namespace refers to the results from the [arXiv:1505.01826](https://arxiv.org/abs/1505.01826) paper by S. Parke and H. Minakata and is described in this paper in subsection 2.3 of [arXiv:1604.08167](https://arxiv.org/abs/1604.08167).\nThis namespace contains the eigenvalues and the angle phi (see eqs. 2.3.3, 2.3.4, and 2.3.5).\nThis namespace also includes the explicit formulas for P(nu<sub>e</sub> -&gt; nu<sub>e</sub>) and P(nu<sub>e</sub> -&gt; nu<sub>mu</sub>) in this basis (see eqs. (2.11) and (2.14) from [arXiv:1505.01826](https://arxiv.org/abs/1505.01826)).\n\nNext is the `Check` namespace which is in reference to the final basis after an additional 12 rotation described in subsection 2.4 of [arXiv:1604.08167](https://arxiv.org/abs/1604.08167).\nThis namespace contains the final eigenvalues at zeroth and second order (zeroth order also contains all first order corrections), and the angle psi (see eqs. 2.4.5, 3.1.3, 2.4.7, and 2.4.9).\nIt also contains the W and V matrices as well as a transition probability calculation (see subsection 3.2 and eq. 4.0.1).\nThe probability calculated in this namespace is based on multiplying out the V matrix.\nThis is identical to the `GF` namespace method at zeroth order, but at first order it contains some higher order terms.\nThis method is coded through second order, but could be expanded to higher orders.\n\nThe `GF` namespace refers to the general form of the first order transition probabilities presented in eqs. 4.2.1 and 4.2.2, and explicitly shown in table 1.\nThis namespace provides an order-by-order calculation for zeroth or first order in that the first order calculation provides no manifestly higher order terms.\n\nThe vacuum values of the oscillation parameters are described in Constant.cpp.\nSince there is no consistent way for all channels to switch the mass ordering, we take the simple choice of changing the sign on Delta m<sup>2</sup><sub>31</sub>.\n\nSee Examples.cpp for several examples.\n\n## Some further notes\nThe antineutrino transition probabilities are the same as the neutrino transition probabilities except with E -&gt; -E.\nThat is, <nobr>L/E -&gt; -L/E</nobr> and a -&gt; -a.\n\nP(nu<sub>a</sub> -&gt; nu<sub>b</sub>) is related to P(nu<sub>b</sub> -&gt; nu<sub>a</sub>) by sending L -&gt; -L.\n\n## Support\nIf you have questions or encounter any problems when running *Nu-Pert*, please use github's [issue tracker](https://github.com/PeterDenton/Nu-Pert/issues).\n\nThis code is free to use, copy, distribute, and modify.\nIf you use this code or any modification of this code, we request that you reference the relevant publication, [arXiv:1604.08167](https://arxiv.org/abs/1604.08167).\n", 
  "id": 56010693
}