{
  "read_at": 1462548359, 
  "description": "Convolutional Channel Features cloned from https://bitbucket.org/binyangderek/ccf.git", 
  "README.md": "# README #\n\nThe codes are for the paper \"Convolutional Channel Features: Tailoring CNN to Diverse Tasks\", arXiv:1504.07339.\n\nCurrently the codes include training and testing part for Caltech pedestrian detection. Models to produce curves in the paper are also provided.\n\nThe codes are written in Matlab codes, dependent on Caffe toolkit and Piotr's Computer Vision Matlab Toolbox. Codes are tested on Linux 12.04.3 LTS with 128GB memory.\n\n### Preparation ###\n\n* Install Caffe with matCaffe (http://caffe.berkeleyvision.org)\n* Download VGG-16 CaffeModel to './data/CaffeNets/' (https://gist.github.com/ksimonyan/211839e770f7b538e2d8#file-readme-md)\n* Download Caltech Pedestrian Dataset (http://www.vision.caltech.edu/Image_Datasets/CaltechPedestrians/) and set it up properly with codes in './data/code3.2.1'\n\n### Use trained CCF model for pedestrian detection ###\n\n* simply run './runDetect.m' and follow instructions in the codes, detection results will be saved as 'allBBs.mat'\n* If you want to run multiple tasks in parallel on multiple GPUs, use 'CUDA_VISIBLE_DEVCIES' environment variable to let matCaffe run on multiple GPU devices (which is a simple patch for an existing Caffe bug)\n\n### Train a CCF pedestrian detector ###\n\n* Run modified './toolbox-master/detector/acfDemoCal.m' to train an ACF detector and save the collected bbs for training\n* Run './getFeat_train.m' to extract features of training data\n* Run './trainModel.m' to train the boosting decision tree model\n* Run './runDetect.m' using your model\n* (Evaluation) With detection results available, modify './toolbox-master/detector/acfTest.m' yourself a little to evaluate the results, and './data/code3.2.1/dbEval.m' to plot curves in comparison with state-of-the-arts\n\n### Power law ###\n\n* Power law can accelerate the detection time by a large margin with unnoticeable performance decrease (see paper for more details). Unfortunately, it doesn't hold for CCF on Caltech Pedestrian Dataset.\n* You can check whether the power law holds for specific feature types on specific datasets using codes in './power_law'. Simply run 'getMean.m' and 'getLambda.m' in turn.\n\n### Bug report ###\n\n* If you find any bug or have any problems in running the codes, post it in Issues or send email to yb[dot]derek[at]gmail[dot]com.\n\n### Reference ###\n\n* If you use our codes or models in your research, we are grateful if you cite the paper \"Convolutional Channel Features: Tailoring CNN to Diverse Tasks\", arXiv:1504.07339. \n\n### Acknowledgement ###\n\nMuch gratitude is presented to\n\n* Piotr Dollar's toolbox\n* Caffe team\n* VGG team\n* NVIDIA Corporation", 
  "id": 56138779
}