{
  "read_at": 1462552226, 
  "description": "", 
  "README.md": "###############################################################################\nCopyright (C) 2012 A. Delmotte, M. Schaub, S. Yaliraki, M. Barahona\n\nThis program is free software: you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program. If not, see <http://www.gnu.org/licenses/>.\n\n###############################################################################\n\n-----------------------------------------------------------------------------\nCommunity Detection using the stability of a graph partition.\n-----------------------------------------------------------------------------\n\nThe code implements the stability method as introduced in the article\n\n(1) \"Stability of graph communities across time scales\" \nDelvenne, J.-C.; Yaliraki, S. N. & Barahona, M. \narXiv:0812.1811 (2009)\nand then published in \nProceedings of the National Academy of Sciences, 2010, 107, 12755-12760;\n\nand further expanded in:\n\n(2) \"Laplacian Dynamics and Multiscale Modular Structure in Networks\"\nLambiotte, R.; Delvenne, J.-C. & Barahona, M.\narxiv:0812.1770 (2009)\n\nand\n\n(3) J.-C. Delvenne, M. T. Schaub, S. N. Yaliraki, and M. Barahona, \n\"The stability of a graph partition: A dynamics-based framework for community \ndetection\" in Time Varying Dynamical Networks (N. Ganguly, A. Mukherjee, \nM. Choudhury, F. Peruani, and B. Mitra, eds.), Birkhauser, Springer,\n2012. to be published.\n\n\nTo optimize the stability quality function, we use the Louvain algorithm as \ndescribed in the publication:\n\n(4) \"Fast unfolding of communities in large networks\",\nVincent D Blondel, Jean-Loup Guillaume, Renaud Lambiotte, Etienne Lefebvre,\nJournal of Statistical Mechanics: Theory and Experiment 2008 (10), P10008\n\nThe folder  /demo/ contains three examples to demonstrate the main functionality \nof the program:\n\n(i) demo.mat : A simple network with a multiscale community structure.  \n(ii) Protein_Adk.mat : A graph representation of the protein Adenylate Kinase \n  (AdK) as described in\n\n(5) \"Protein multi-scale organization through graph partitioning and robustness \nanalysis: application to the myosin-myosin light chain interaction\"\nDelmotte, A.; Tate, E. W.; Yaliraki, S. N. & Barahona, M. \nPhysical Biology, 2011, 8, 055010\n\n(ii) ring_of-rings.mat  : The \"ring-of-rings\" graph introduced in:\n\n(6) \"Markov dynamics as a zooming lens for multiscale community detection: \nnon clique-like communities and the field-of-view limit\"\nSchaub, M. T.; Delvenne, J.-C.; Yaliraki, S. N. & Barahona, M. \nPLoS ONE, Public Library of Science, 2012, 7, e32210\n\nFurther example graphs are available on request. \n\n***If you make use of any part of this toolbox, please cite the \nrespective articles.***\n\nFor detailed instructions on how to compile the code in MATLAB see below.\nIf you find a bug or have further comments, please send an email and if \nnecessary the input file and the parameters that caused the error.\n\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nAuthors   : A. Delmotte and M. Schaub  \nEmail     : antoine.delmotte09@imperial.ac.uk, michael.schaub09@imperial.ac.uk  \n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\n###############################################################################\n\n-----------------------------------------------------------------------------\nContributions to the code\n-----------------------------------------------------------------------------\n\nThe C++ code performing the stability optimization is based on the \nimplementation of the Louvain method as available from \nhttp://sites.google.com/site/findcommunities/ \n(Authors: Jean-Loup Guillaume / Etienne Lefebvre)\n\nThe Louvain code was adapted and extended by R. Lambiotte \n(http://www.lambiotte.be) to allow for the optimization of the stability quality \nfunction and was subsequently refined further by Antoine Delmotte. \n\nThe MATLAB frontend was initally added by Antoine Delmotte. \nFinal adjustments and additions, testing, and maintenance are due to \nAntoine Delmotte and Michael Schaub.\nVersion 2.0 which updates the first release and includes the addition of \ndirected stability was created by Michael Schaub (see code history for further\ndetails). \n\n###############################################################################\n\n-----------------------------------------------------------------------------\nHow to install the stability package\n-----------------------------------------------------------------------------\n\n1. Open Matlab\n\n2. Make sure you have a C++ compiler installed\n  * For Linux, you can find one here: \n    http://www.gnu.org/software/gcc/\n  * For Windows, you can use Visual C++ express: \n    http://www.microsoft.com/express/Windows/\n\n3. Make sure mex is properly configured in Matlab:\n  * Type \"mex -setup\" in Matlab, and choose your compiler.\n\n4. In Matlab, go into the directory of the Stability toolbox.\n\n5. Type \"Install_Stability\" in the Matlab command window.\n  * If you get an error message concerning the libstdc++.so file, \n    you may want to try the following manipulation:\n\n        cd \"Matlab_root_directory\"/sys/os/glnx86/\n        sudo mv libgcc_s.so.1 libgcc_s.so.1.back\n        sudo mv libstdc++.so.6 libstdc++.so.6.back\n\n6. You will get a messge asking whether the stability toolbox should \n   be added to your Matlab path. Answering yes will allow you to use \n   the stability toolbox functions as standard Matlab functions.\n            \n7. Type \"help stability\" in Matlab to discover how to use the code.\n\n8. Try this example to check that everything is working:\n    \n        cd('demo');   % go into the demo directory (in the stability folder)\n        load demo;    % load data and then run stability\n        [S, N, VI, C] = stability(Graph,Time,'plot','v');\n\nNOTES:\n\n* The install script provides the option to add the bin folder to your \nMatlab path. This will enable you to use stability as a standard Matlab \nfunction from any directory. If you don't want this option any more,\njust remove it from the path by going in File/Set Path.\n\n* If you get a warning message concerning savepath, and you want the \nstability code to be in your path, go, after the installation, in \nFile/Set Path, and choose \"save\". Then choose where you want pathdef.m\nto be saved. If at the next matlab startup, you notice that stability is\nnot in your matlab path anymore, try editing/creating the \"startup.m\" file\nfrom your matlab user folder (type userpath to know where it is located)\nand add the following line: addpath(' path to bin folder of stability \npackage '). Alternatively, if you are the only user on your machine, you\ncan start matlab as a superuser (\"sudo matlab\" in linux) and rerun the\n\"Install_Stability\" script. This will permanently add the stability folder \nin the path for all users.\n\n* To speed up the calculations, you might consider adding the\noption 'noVI'. This disables the calculation of the variation of information, \nwhich is usually slow at small Markov times, when the number of \ncommunities found is big. \nAnother option is to decrease the number of optimisations on which the variation \nof information is calculated. To do so, add the option 'M' and put a value\nsuch that M < L (L is the number of louvain optimisations).  \nExample:\n \n    [S, N, VI, C] = stability(Graph,time,'plot','v', 'L', 100, 'M', 10);\n\n", 
  "id": 5628731
}