{
  "read_at": 1462548104, 
  "description": "Tool for calculating the low energy couplings of Dark Matter (DM) to light quarks in Simplified Models with vector mediators.", 
  "README.md": "# runDM\n\n*With runDMC, it's Tricky. With runDM, it's not.*\n\n`runDM` is a tool for calculating the low energy couplings of Dark Matter (DM) to light quarks in Simplified Models with vector mediators. By specifying the mass of the mediator and the couplings of the mediator to SM fields at high energy, the code outputs the low energy couplings to up, down and strange quarks, taking into account the mixing of all dimension-6 operators. Further details about the physics behind the code can be found in Appendix B of [arXiv:1605.XXXXX](http://arxiv.org/abs/1605.XXXXX).\n\nAt present, the code is written in two languages: *Mathematica* and *Python*. If you are interested in an implementation in another language, please get in touch and we'll do what we can to add it. Documentation for the code can be found in `doc/manual.pdf`. We also provide a number of example files. \n\n- For the Python code, we provide an example script as well as Jupyter Notebook. A static version of the notebook can be viewed [here](http://nbviewer.jupyter.org/github/bradkav/runDM/blob/master/python/runDM-examples.ipynb).\n\n- For the Mathematica code, we provide an example notebook.\n\nIf you make use of `runDM` in your own work, please cite it as:\n\n>F. D'Eramo, B. J. Kavanagh & P. Panci (2016). runDM (Version X.X) [Computer software]. Available at https://github.com/bradkav/runDM/\n\nmaking sure to include the correct version number. Please also cite the associated papers:\n\n>A. Crivellin, F. D'Eramo & M. Procura, New Constraints on Dark Matter Effective Theories from Standard Model Loops, Phys. Rev. Lett. 112 (2014) 191304 [arXiv:1402.1173 [hep-ph]],\n\n>F. D'Eramo & M. Procura, Connecting Dark Matter UV Complete Models to Direct Detection Rates via Effective Field Theory, JHEP 1504 (2015) 054 [arXiv:1411.3342 [hep-ph]],\n\n>F. D'Eramo, B. J. Kavanagh & P. Panci, You can hide but you have to run: direct detection with vector mediators, (2016) [arXiv:1605.XXXXX].\n\nPlease contact Bradley Kavanagh (bradkav@gmail.com) for any questions, problems, bugs and suggestions.\n", 
  "id": 56312629
}