{
  "read_at": 1462548531, 
  "description": "Numerical Floquet scattering calculation of electronic waiting time distributions (WTDs)", 
  "README.md": "# Numerical Floquet scattering calculation of electronic waiting time distributions (WTDs)\n\n## Description\nThis is some code written in C++ to numerically calculate electronic waiting\ntime distribution (WTD) for periodically driven phase-coherent conductors. The\nWTD W(t) is the probability distribution for a time t to pass between two\nsuccessive electron transfers in a mesoscopic electronic conductor.\n\nThe method to calculate WTDs from the Floquet scattering matrix is described in:\nD. Dasenbrook, C. Flindt and M. Buttiker, [Floquet Theory of Electron Waiting Times in Quantum-Coherent Conductors](http://dx.doi.org/10.1103/PhysRevLett.112.146801), Physical Review Letters 112, 146801 (2014)\n\nThis code was, among other applications, used to calculate the WTDs in:\nP. P. Hofer, D. Dasenbrook and C. Flindt, [Electron waiting times for the mesoscopic capacitor](http://dx.doi.org/10.1016/j.physe.2015.08.034), Physica E (2015), doi:10.1016/j.physe.2015.08.034\n\nA different variant of this code was also used to calculate the WTDs in:\nD. Dasenbrook and C. Flindt, \"Quantum theory of an electron waiting time clock\", [arXiv:1602.07917](arxiv.org/abs/1602.07917) (2016).\n\nThe Floquet scattering matrix formalism used by this method is valid for quantum mechanical many-electron systems, as long as interactions between the electrons can be neglected.\n\nTo calculate the idle time probability (ITP) from which the WTD can be derived by taking the second time derivative, a Fredholm determinant needs to be evaluated. The method that is used in this code for this purpose is described in:\nF. Bornemann, [On the numerical evaluation of Fredholm determinants](http://dx.doi.org/10.1090/S0025-5718-09-02280-7), Mathematics of Computation 79, 871 (2010).\n\n## Compilation\nThis software makes use of the [GNU Scientific Library](www.gnu.org/software/gsl) (GSL). To compile it, you need to have this library installed on your system, as well as [cmake](cmake.org). Then, compile by typing\n```\ncmake\n```\nfollowed by\n```\nmake\n```\n\nIt is assumed that you are on a Linux or Unix-like system, and that you have\nbasic build tools such as the GNU compiler collection installed. Windows/Cygwin\nmight work as well.\n\nI have copied over the files \"glfixed.c\" and \"glfixed.h\" from the current\nversion of the GNU Scientific library into this project, since they are not\npresent in some earlier versions of the library (for example, the one on the\ncompute cluster I used). I do not claim authership of the code contained in\nthese files. They are needed to compute Gaussian quadrature points and weights\nfor the numerical evaluation of the Fredholm determinants.\n\n## Usage\nCurrently, you have to implement the scattering matrix by editing the source\ncode. To implement a particular Floquet scattering matrix, create a class\nderived from the WTD class in the wtd.cxx and wtd.h files. As an example, have a\nlook at ses.cxx and ses.h, which implement the Floquet scattering matrix of the\nsingle electron source used in the experiment by Gwendal Feve et al. in Paris.\nRead the above paper in Physica E to find out more about this scattering matrix.\nThen, change the main programme in main.cxx to create an instance of your new\nclass instead of SES. The main programme, if called with no parameters,\ncalculates idle time probabilities for N different time steps between 0 and Tmax\n(currently hard-coded) and outputs them to stdout. If called with one parameter\nn, it will just calculate the n'th time step and output it. This is useful for\nlaunching many instances of the programme in parallel for different data points,\ne.g. on a cluster.\n\nFuture versions of this software might provide a more convenient user interface.\n\n## LICENSE\nThis program is free software: you can redistribute it and/or modify it under\nthe terms of the GNU General Public License as published by the Free Software\nFoundation, either version 3 of the License, or (at your option) any later\nversion.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY\nWARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A\nPARTICULAR PURPOSE.  See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with\nthis program.  If not, see [http://www.gnu.org/licenses/](http://www.gnu.org/licenses/).\n", 
  "id": 56683184
}