{
  "README": "Toolkit for High Energy Physics Event Generation - ThePEG\n\nTo compile and install ThePEG follow these steps:\n\n1: run the configure script. To override the defaults: set eg. the\n   following environment variables\n\n\tCXX: (default g++) your favorite C++ compiler. Must be\n\t     standard compliant. g++ version 4.0 or later will do\n\t     nicely.\n\n   To overwrite the default install prefix (/usr/local) use the\n   --prefix=/custom/install/path argument to configure.\n\n   If the LHAPDF library is installed under /usr/local/lib it will be\n   used. If it is installed elsewhere, use\n   --with-LHAPDF=/Path/to/library to specify where.\n\n   If a standard Sun java compiler is available a java GUI called 'thepeg'\n   will be installed. To avoid this use --without-javagui.\n\n   'configure --help' will list other environment variables and options which\n   will influence the installation.\n\n2: Do 'make check'.\n   this will compile the main ThePEG library and two programs in\n   the src directory. These will then be run as follows\n                ./setupThePEG SimpleLEP.in\n   to setup an event generator which is dumped in SimpleLEP.run\n\t        ./runThePEG SimpleLEP.run\n   to run the event generator. Some output will be written in\n\tSimpleLEP.out, SimpleLEP.log and SimpleLEP.tex.\n\n3: Install ThePEG with 'make install'. This will put all the shared\n   libraries in the lib/ThePEG directory under the install path. The\n   default repository file 'ThePEGDefaults.rpo' will also be placed\n   there. The executables 'setupThePEG' and 'runThePEG' are installed\n   in the bin directory under the install path. In the bin directory\n   is also installed a java-based setup program called 'thepeg' which\n   enables you to setup and run event generators using a GUI. All\n   header files will be installed in the 'include/ThePEG' directory\n   under the install path, and some sample setup files and a sample\n   makefile is installed in the 'share/ThePEG' directory together with\n   an emacs lisp file 'ThePEG.el' with some functions for creating\n   skeletons of new ThePEG classes.\n\nNote that ThePEG is a framework for implementing event generator\nmodels, and by itself it does not contain enough physics models to\ngenerate realistic events for any collider. Instead programs such as\nPythia7 or Herwig++ should be installed to allow for proper event\ngeneration. \n\nThere is currently no up-to-date manual avaliable. However, the\ngeneral structure is described in \"PYTHIA version 7-0.0 - a\nproof-of-concept version\" Comput. Phys. Commun. 134 (2001) 365. (see\nalso http://www.thep.lu.se/Pythia7/Doc/Proof/). This describes the\nPythia7 program before it was broken up into the basic event generator\nplatform - ThePEG - and the Pythia-specific parts in Pythia7. \n\nA brief description of ThePEG is also included in \"Herwig++ Physics and Manual\"\n[arXiv:0803.0883]. In addition, there is Doxygen-generated documentation of the\nclasses in http://projects.hepforge.org/thepeg/doxygen\nThe doxygen documentation can also be generated locally by 'make html', in\nwhich it will end up in the Doc/refman-html directory. A subsequent\n'make install' will place the documentation in\nshare/ThePEG/Doc/refman-html.\n\nBriefly, the running of ThePEG is divided into two steps:\n\n1: The program 'setupThePEG' is used to set up an event generator and\n   saving it to a file. Here you collect together the components\n   needed for a specific event generation run, and parameters and\n   switches of the components can be set to preferred values. See the\n   file SimpleLEP.in in the src subdirectory for an example.\n\n2: The program 'runThePEG' is used to run the generator saved to a\n   file. \n\n===========================================================================\n\n    Toolkit for High Energy Physics Event Generation - ThePEG\n    Copyright (C) 1999-2011 Leif Lonnblad\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License version 2 as \n    published by the Free Software Foundation.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n", 
  "read_at": 1462548522, 
  "description": "", 
  "id": 56834862
}