{
  "read_at": 1462548460, 
  "description": "Wrappers and implementations of several domain adaptation / transfer learning / semi-supervised learning algorithms", 
  "README.md": "# domain-adaptation-toolbox\n\nWrappers and implementions of several domain adaptation / transfer learning / semi-supervised learning algorithms, in matlab.\n\nPlease find sample usages in showSimExp.m.\n\n![discrete domains](synthetic dataset discrete.jpg)\n\n![continuous distribution change](synthetic dataset continuous.jpg)\n\nThe domain adaptation algorithms include:\n\n* Transfer Component Analysis (TCA)\n* Maximum Independence Domain Adaptation (MIDA)\n* Subspace Alignment (SA)\n* Information-Theoretical Learning (ITL)\n* Geodesic flow kernel (GFK)\n* Stationary Subspace Analysis (SSA)\n\nFor comparison, we also included three semi-supervised (transductive) learning algorithms, which can be used as baselines to other domain adaptation methods:\n\n* Laplacian SVM (LapSVM)\n* Laplacian ridge regression (LapRR)\n* Transducive SVM (TSVM)\n\nThe PCA and kernel PCA algorithm can also be a baseline method. So, there are 10 algorithms in this toolbox. Among them, TCA, MIDA, SA, (kernel) PCA, and LapRR are self-implemented. ITL, GFK, SSA, LapSVM, and TSVM are wrappers of existing toolboxes. These toolboxes are included in the project, except SSA, which is too big and can be downloaded from the link provided below. The interfaces of the functions have been unified for convenience. We hope the work can be helpful for domain adaptation / transfer learning researchers.\n\nDependencies:\n\n1. ITL: I downloaded it from somewhere I can't find it now.\n1. GFK: [http://www-scf.usc.edu/~boqinggo/]()\n1. GFK: plslda, [http://www.mathworks.com/matlabcentral/fileexchange/47767-libpls-1-95-zip/]()\n1. SSA: [http://mloss.org/revision/download/851/]()\n1. LapSVM: [https://github.com/tknandu/LapTwinSVM/tree/master/Primal_LapSVM/lapsvmp_v02]()\n1. TSVM: [http://svmlight.joachims.org/]() and [https://github.com/sods/svml]()\n\nReferences:\n\n1. TCA: S. J. Pan, I. W. Tsang, J. T. Kwok, and Q. Yang, \"Domain adaptation\tvia transfer component analysis,\" Neural Networks, IEEE Trans, 2011\n1. MIDA:  Ke Yan, Lu Kou, and David Zhang, \"Domain Adaptation via Maximum Independence of Domain Features,\" [http://arxiv.org/abs/1603.04535]()\n1. SA: B. Fernando, A. Habrard, M. Sebban, and T. Tuytelaars, \"Unsupervised visual domain adaptation using subspace alignment,\" in ICCV, 2013\n1. ITL: Y. Shi and F. Sha, \"Information-theoretical learning of discriminative clusters for unsupervised domain adaptation,\" in ICML, 2012\n1. GFK: B. Gong, Y. Shi, F. Sha, and K. Grauman, \"Geodesic flow kernel for unsupervised domain adaptation,\" in CVPR, 2012\n1. SSA: P. Von Bunau, et al, \"Finding stationary subspaces in multivariate time series,\" Physical review letters, 2009\n1. LapSVM and LapRR: M. Belkin, P. Niyogi, and V. Sindhwani, \"Manifold regularization: A geometric framework for learning from labeled and unlabeled examples,\" J. Mach. Learn. Res., 2006.\n1. TSVM: T. Joachims, \"Transductive inference for text classification using support vector machines,\" 1999", 
  "id": 56957013
}