{
  "read_at": 1462557329, 
  "description": "Knot Theory library focusing on k-tangles", 
  "README.md": "# Tangles\n\n[![Build Status](https://travis-ci.org/mishun/tangles.svg?branch=master)](https://travis-ci.org/mishun/tangles)\n\n---\n\n![First Khovanov homology collision](https://mishun.github.io/img/kh-collision-9.png)\n\n---\n\nTangles is a Haskell library implementing some enumeration algorithms for knot theory objects,\nsuch as k-tangle projections, alternating k-tangles, non-alternating k-tangles, alternating\nvirtual links. Also it can compute Jones and Kauffman F polynomial invariants of links and\ntangles and create nice drawings of tangles automatically.\n\nSee following papers for further details:\n  - http://arxiv.org/abs/0712.3859\n  - http://www.worldscientific.com/doi/abs/10.1142/S0218216512500691?journalCode=jktr\n  - a few in tangles-tex repository (unfortunatelly most are in russian yet)\n\n\n## Building\n\nTo build Tangles you will need:\n\n  - GCC with g++ at least 4.7\n  - GHC at least 7.6\n  - Cabal at least 1.18\n  - a few packages from http://hackage.haskell.org/\n\nBuilding steps:\n```sh\n$ cabal configure\n$ cabal build\n```\nCabal will notify you what packages are requires and they can be installed with \"cabal install\" or\n(preferred way if possible) with package manager of your Linux distribution. Under Windows you can\nfor example build GSL by youself with MinGW and integrate its binaries into the copy of MinGW inside\nHaskell Platform.\n\n\n## Building tests\n\nPackage contains a few test modules that can be enabled by switching enable-test-modules flag. After\nthat standard cabal testing support can be used.\n```sh\n$ cabal configure --enable-tests -fenable-test-modules\n```\nIt is rather ugly ad hoc solution, but it is neccessary due to test modules using some internal modules\nthat are not exported from package. And I have not found better way yet.\n\nAlso there are a few benckmarks there that can be enabled by separate flags. For details see\ntangles.cabal file.\n", 
  "id": 5730446
}