{
  "read_at": 1462557341, 
  "description": "Code from my master's thesis. ", 
  "README.md": "### Emotion Editor\n\n_Mika Turkia: On defining affects computationally. \nMaster's thesis, University of Helsinki, Department of Computer Science, C-2007-017. Date: 12.2.2007._\n\n![Classification of Emotions](https://www.cs.helsinki.fi/u/turkia/emotion/classification/classification_of_emotions.png)\n\n#### Abstract\n\nOne of the most tangled fields of research is the field of defining and modeling affective concepts, \ni. e. concepts regarding emotions and feelings. The subject can be approached from many disciplines. \nThe main problem is lack of generally approved definitions. However, e.g. linguists have recently \nstarted to check the consistency of their theories with the help of computer simulations. \nDefinitions of affective concepts are needed for performing similar simulations in behavioral sciences.\n\nIn this thesis, preliminary computational definitions of affects for a simple utility-maximizing agent are given. \nThe definitions have been produced by synthetizing ideas from theories from several fields of research. \nThe class of affects is defined as a superclass of emotions and feelings. Affect is defined as a process, \nin which a change in an agent's expected utility causes a bodily change. \nIf the process is currently under the attention of the agent (i.e. the agent is conscious of it), \nthe process is a feeling. If it is not, but can in principle be taken into attention (i.e. it is preconscious), \nthe process is an emotion. Thus, affects do not presuppose consciousness, but emotions and affects do.\n\nAffects directed at unexpected materialized (i.e. past) events are delight and fright. \nDelight is the consequence of an unexpected positive event and fright is the consequence of an unexpected \nnegative event. Affects directed at expected materialized (i.e. past) events are happiness (expected positive \nevent materialized), disappointment (expected positive event did not materialize), sadness (expected negative \nevent materialized) and relief (expected negative event did not materialize). Affects directed at expected \nunrealized (i.e. future) events are fear and hope. Some other affects can be defined as directed towards \noriginators of the events. The affect classification has also been implemented as a computer program, \nthe purpose of which is to ensure the coherence of the definitions and also to illustrate the capabilities \nof the model.\n\nThe exact content of bodily changes associated with specific affects is not considered relevant from the \npoint of view of the logical structure of affective phenomena. The utility function need also not be defined, \nsince the target of examination is only its dynamics.\n\nACM Computing Classification System (CCS): \nI.2.11 [Distributed Artificial Intelligence], \nJ.4 [Social and Behavioral Sciences]\n\nFinnish version is available [on my homepage](https://www.cs.helsinki.fi/u/turkia/emotion/) \nor in [E-thesis](http://urn.fi/URN:NBN:fi-fe20071088). \n\n#### Demo\n\nA [demonstration](https://www.cs.helsinki.fi/u/turkia/emotion/emotioneditor/) is available. \n\n#### Publications\n\nThe model has also been described in the following article: \n\n_Turkia Mika: A Computational Model of Affects. In Dietrich, D.; Fodor, G.; Zucker, G.; Bruckner, D. (Eds.): \nSimulating the Mind. A Technical Neuropsychoanalytical Approach. Springer 2009, pp. 277-289._\n\nA preprint version of the article is available at [arXiv.org](http://arxiv.org/abs/0811.0123).\n\n#### Copyright\n\nCopyright Mika Turkia 2006-2013\n\nLicense: GNU Affero General Public License, Version 3\n", 
  "id": 5736937
}