{
  "id": 5984107, 
  "read_at": 1462557339, 
  "README.rst": "This repository contains much of the data and code that was used for\nthe paper by Crighton et al., \"A high molecular fraction in a\nsub-damped absorber at z=0.56\". There's no need to have git installed\nto download the repository, click on 'Downloads' at the top right of\nthis page and you can download the whole repository as a .zip or\n.tar.gz file.\n\nBelow is a short explanation of the files included.\n\nIf you need any help understanding what was done for the paper, or\ngetting the code to run, please contact me (neilcrighton .at. gmail\n.dot. com). If you find any of the data or code in the repository\nuseful, please let me know by email. Finally, if you use any of the\ncode or data for a publication, please cite the paper\n(http://arxiv.org/abs/1210.0905).\n\n\n**data/**\n\nThis directory contains data and catalogues used in the paper.\n\n- C.txt\n \n  Combined COS spectrum, with columns wavelength (Angstroms), flux,\n  error (1 sigma), continuum. The raw exposures and calibration\n  files are available from the HST archive.\n \n- q0107c_HIRES.txt\n \n  Combined HIRES spectrum, with columns wavelength (Angstroms), flux,\n  error (1 sigma), continuum. The raw exposures are available in the\n  Keck archive (http://www2.keck.hawaii.edu/koa/public/koa.php).\n \n- qsoc_G190H.txt\n \n  Combined FOS spectrum, with columns wavelength (Angstroms), Flux,\n  error (1 sigma), continuum. The raw exposures and calibration\n  files are available from the HST archive.\n\n- K.fits.fz\n\n  K-band image of Q 0107-0232 compressed with fpack\n  (http://heasarc.nasa.gov/fitsio/fpack/). The individual raw\n  exposures are available in the ESO archive.\n\n- f_H2_DLA.tbl\n \n  Table in the excellent IPAC format\n  (http://irsa.ipac.caltech.edu/applications/DDGEN/Doc/ipac_tbl.html)\n  of molecular fraction measurements in high redshift DLAs. The\n  references from which these are taken are given in the table header.\n\n- Richter03_t2.tbl\n\n  Table 2 from Richter et al. 2003, ApJ, 586, 230.\n\n- Savage77_tab1.tbl\n\n  Table 1 from Savage et al. 1977, ApJ, 216, 291.\n\n- Welty12_LMC.tbl and Welty12_SMC.tbl\n\n  The LMC and SMC measurements from Tables 1 and 2 in Welty et\n  al. 2012, ApJ, 745, 173\n\n- observed_logN/\n  \n  Text files with the column densities of all the transitions\n  measured for the sub-DLA, for all components summed and for each\n  component individually. See the README in this directory.\n\n**cloudy/**\n\nExample cloudy input files for each of the scenarios described in\nSection 4.5 of the paper.\n\n**scripts/**\n\nPython scripts used to perform many of the calculations in the\npaper.\n\n**modules/**\n\nThis contains most of the modules needed by the various python\nscripts. You will also need the following packages installed:\n\n- Numpy and Scipy,    http://numpy.scipy.org/\n- Matplotlib,         http://matplotlib.org/\n- Pyfits,             http://www.stsci.edu/institute/software_hardware/pyfits\n- Atpy,               http://atpy.github.com/\n\nThe Enthought Python distribution\n(http://www.enthought.com/products/epd_free.php) is a quick way to\ninstall most of these.\n\n\n**mcmc/**\n\nThe samples from the monte carlo markov chains generated with Emcee,\nand the python module used to define the likelihood.\n", 
  "description": "Data and code for the submitted paper \"A high molecular fraction in a sub-damped absorber at z=0.56\""
}