{
  "id": 6079797, 
  "read_at": 1462558199, 
  "README.rst": "=======\nPaperboy\n=======\n\n:Info: See `github <http://github.com/andycasey/paperboy>`_ for the latest source\n:Author: Andy Casey, acasey@mso.anu.edu.au\n\nPaperboy is a script that will find peer-reviewed papers published by\nauthors at a given institute in a given timeframe. A summary report\nincluding the first page of each article is produced, which can be emailed\nto someone on the first month so that new papers can be published on an\ninstitute noticeboard.\n\nRequirements\n------------\n\n- Python \n\n- `PyPdf <http://pybrary.net/pyPdf/>`_\n\nInstallation\n------------\nNo installation required, but you may want to edit the file so that you're\nfinding papers for your own institute. Right now it's set to find papers\npublished by anyone from ``*Mount Stromlo Observatory*`` or ``*Research\nSchool of Astronomy and Astrophysics*``, at the `Australian National\nUniversity <http://rsaa.anu.edu.au/>`_\n\nFeel free to change the following lines in paperboy.py:\n::\n    HOST = \"mso.anu.edu.au\"\n    FROM_ADDRESS = \"Paperboy\"\n    ADMIN_ADDRESS = \"acasey@mso.anu.edu.au\"\n    INSTITUTE_QUERY = [\n      \"*mount stromlo observatory*\", # or\n      \"*research school of astronomy and astrophysics*\"\n    ]\n::\n\nNote: Each time you run Paperboy the ``ADMIN_ADDRESS`` will get an email too.\n\nUsage Examples\n--------------\n\n- Create a summary report for all the papers that were published last month.\n\n  ``python paperboy.py --to my@email.com --month last``\n\n- Email a summary report for all the papers that have been published this\n  month:\n\n  ``python paperboy.py --to my@email.com --month this``\n\n- Email a summary report for all the papers published between 8/2011 and\n  4/2012\n\n  ``python paperboy.py --to my@email.com --month 8 --year 2011 --end_month\n  4 --end_year 2012``\n\n- More options are available, and help is found by using:\n\n  ``python paperboy.py --help``\n\nSet up a Cron job\n-----------------\nAt the `Research School of Astronomy and Astrophysics, ANU\n<http://rsaa.anu.edu.au/>`_ we have an automatic cron job on the system\nwhich finds new peer-reviewed papers for the previous month on the first\nof each month. You just need someone to volunteer to print out the summary\npages and pin them up on some common noticeboard. In this case let's call\nthat person 'Louise'. First, follow `these instructions\n<http://www.cyberciti.biz/faq/how-do-i-add-jobs-to-cron-under-linux-or-unix-oses/>`_\nand when I do ``crontab -l`` in a terminal I get the following output:\n::\n    acasey@magnificent:/home/acasey>crontab -l\n    # m h  dom mon dow   command\n    0 7 1 * * python /home/acasey/paperboy/paperboy.py --month last --to the_louise@mso.anu.edu.au --interval 10 --repeat 10\n::\n\nSo you can see at 7 am on the first of every month, Louise will get\na summary email for all the papers published in the last month.\n\nNote: Louise does this at ANU, and we're thankful. To limit spam, that's not her real email address :-)\n\nImportant Notes\n---------------\nAlthough NASA ADS is free to search, this script will go and retrieve\narticles wherever it can. If a published version of the paper is\nunavailable it will use arXiv pre-prints instead if available. However, it\ndoes assume that you are using this code from an institutional site and\nthat you have access to all of the online astronomy journals.\n", 
  "description": "Find refereed articles authored by members at a given institution in some time frame, and email a summary report of those papers."
}