{
  "read_at": 1462547446, 
  "description": "Transportation solver implementation to obtain a primal solution of the LP relaxation of the MRF MAP-inference problem", 
  "README.md": "transportationSolver\n====================\n\nTransportation solver implementation to obtain a primal solution of the LP relaxation of the MRF MAP-inference problem\n-----------------------------------------------------------------------------------\nThe software implements a simplex solver for transportation problems: http://en.wikibooks.org/wiki/Operations_Research/Transportation_and_Assignment_Problem\nused to compute a primal solution of the LP-relaxed MAP-inference problem for graphical models. Versions of this code were used to produce resuls for papers\n\n[1] B. Savchynskyy, J. H. Kappes, S. Schmidt, C. Schnorr\nA Study of Nesterov's Scheme for Lagrangian Decomposition and MAP Labeling\nCVPR 2011 \n\n[2] S. Schmidt, B. Savchynskyy, J. H. Kappes, C. Schnorr\nEvaluation of a First-Order Primal-Dual Algorithm for MRF Energy Minimization\nIn EMMCVPR, 2011. Springer, pp.89-103. \n\n[3] B. Savchynskyy, S. Schmidt, J. H. Kappes, C. Schnorr\nEfficient MRF Energy Minimization via Adaptive Diminishing Smoothing\nIn UAI, 2012. Note: In press. \n\n[4] B. Savchynskyy, S. Schmidt\nGetting Feasible Variable Estimates From Infeasible Ones: MRF Local Polytope Study\narXiv:1210.4081 Submitted Oct. 2012 [Bib] [PDF]\n\navailable at http://hci.iwr.uni-heidelberg.de/Staff/bsavchyn/\n\nPlease site [4] or [1] if you use it. The code was tested under Ubuntu 11 operating system with gcc v.4.4 compiler.\n\nThe solver itself is in the /src folder. It contains only headers and hence does not require any precompilation and is dependent on the standard library only. Look into /example/example.cpp to see how it can be used. To compile /example.cpp BOOST::UBLAS library is required. Further details - in src/primalSolver.h .\n\nThe folder /tests contains unit and regression tests. Use ccmake and make commants from the package root to build them. You will need a CPPUNIT and BOOST::UBLAS libraries (both are included into Ubuntu 10-12 distributions) to do build the tests. Run ./tests from /tests directory if you want to check tests. You should have right permissions for /tests to do this, since tests will create .tst files, which content will be compared to the content of existing .chk files.\n---------------------------------------------------\nVersions history:\n1.0 - initial version\n1.1 - FIXED: Numerical bug when dealing with degenerate problems \n1.2 - FIXED: Maximum number of iterations is now dependent on the problem size and can be additionally corrected in the PrimalSolver object constructor\n", 
  "id": 6560519
}