{
  "id": 6797333, 
  "read_at": 1462547450, 
  "README.rst": "cfbrank -- A college football ranking algorithm\n\nOverview\n========\n\nWith a rather small slate of games each year, ranking college football\nteams is a rather puzzling challenge. Lots of different metrics can be\nused, all with their own advantages and disadvantages. I've set out to\nmake a simple set of criteria with as few parameters as possible to\n(hopefully!) come up with a sensible ranking of all Division I FBS\nteams.\n\nMy general thoughts on how to determine the ranking of teams are as\nfollows. First and foremost, overall record matters. With far more\nteams than there are slots in any one team's schedule, this is the\nbest first order metric to use. However, not all schedules are created\nequal, and so the overall quality of resume must be considered, as\nwell.\n\nRanking schemes\n===============\n\nThere are a few different ranking schemes that can be utilized, and\nthey are described individually below. \n\nOriginal method\n---------------\n\nThe following method was the first implemented, and thus carries the\ncompletely non-descriptive name of the \"original\" method. The general\nranking scheme is as follows. For a given team, :math:`T`, we consider\n:math:`T`\\'s winning percentage :math:`w_0` (with FCS penalties) and\n:math:`T`\\'s opponents' winning percentage, :math:`w_1` (with FCS\npenalties). Then :math:`T`\\'s point total is given by\n\n.. math:: P = A_0 w_0 + A_1 w_1,\n\nwhere A_i are constants to weight the importance of each\nparameter. There is one caveat. Scheduling FCS teams shouldn't be\nrewarded [#]_, and therefore a FCS win counts as a fraction of a whole\nwin, where that fraction is another tunable parameter, B. A loss to an\nFCS team counts the same as a loss to an FBS team.\n\nAWPMOV Method\n-------------\n\nThe AWPMOV method considers a team's wins, opponents' winning\npercentage, and margin of victory (actually point differential as\ncurrently implemented). The score is calculated by\n\n.. math:: P = A_0 w_0 + A_1 w_1 + A_2 w_2,\n\nwhere :math:`w_0` is the winning percentage, :math:`w_1` is the\naggregate winning percentage of opponents that the team has beaten,\nand :math:`w_2` is the normalized point differential.\n\nPark-Newman method\n------------------\n\nSee `J. Park and M.E.J. Newman, J. Stat. Mech. 2005, 10014 (2005)`__\nor `arXiv:physics/0505169`__. This method is not yet implemented.\n\n__ http://iopscience.iop.org/1742-5468/2005/10/P10014\n__ http://arxiv.org/abs/physics/0505169\n\nData entry\n==========\n\nPerhaps the most daunting thing about developing a CFB ranking\nalgorithm is entering a season's worth of data (even if only one week\nat a time!). Luckily, there are a number of places on the web where\nbasic data can be downloaded in simple CSV format. Right now, cfbrank\nhas functionality provided by the dataparse module to parse CSV files\nfrom `Sunshine Forecast`_, the NCAA_ [#]_, and `cfbstats.com`_ (soon).\n\n.. _Sunshine Forecast: http://www.repole.com/sun4cast/data.html\n.. _NCAA: http://www.ncaa.org/wps/wcm/connect/public/NCAA/Resources/Stats/Football/index.html\n.. _cfbstats.com: http://www.cfbstats.com/blog/college-football-data/\n\n.. [#] One complication is that not all teams play the same number of\n       games. The base 12 game schedule is standard, but the \"Hawaii\n       Rule\" allows teams playing at Hawaii to schedule a 13th regular\n       season game to help recoup costs associated with travel. Then\n       there are conference championship games (CCGs). I am not a big\n       fan of the divisional format of deciding who plays in these, as\n       it often happens that one division in any given year is much\n       stronger than the other. Furthermore, as not all conferences\n       are large enough to qualify for a CCG, it seems somewhat unfair\n       to provide an extra rankings boost to a team that participates\n       in a CCG in a conference where their opponent is of much lower\n       quality.\n\n.. [#] As of September 2013, the downloadable NCAA schedules no longer\n       include scores, making this data source deprecated.\n", 
  "description": "A college football ranking system"
}