{
  "read_at": 1462547435, 
  "description": "", 
  "README.md": "Open Citations Corpus Datastore\n===============================\n\nThis repository contains code for the Open Citations Corpus Datastore (OCCD). \n\nIt consists of several parts:\n* PMC import scripts\n* Arxiv import scripts\n* OCCD server (tbd)\n  \n\nInstalling\n----------\n\nYou will need python, and git to clone this repo (or just download it).\nThis code depends on lxml so you will need that installed.\nYou will also need a running instance of elasticsearch to load into. \nIt is easy to install. See the elasticsearch website.\nCreating a virtualenv is a good idea too.\n\nHere is an example install: \n\n    apt-get install libxslt2-dev libxml\n    virtualenv -p python2.7 occ --no-site-packages\n    cd occ\n    mkdir src\n    cd src\n    git clone git://github.com/opencitations/OpenCitationsCorpus.git\n\nTo then go on and create an index, make sure your elasticsearch index is running then \nedit the Importer/Config.py file to point at the relevant index address. Check out the \nother settings whilst there too. It will all work by default as long as you have your \nindex running on the usual port, and also if you grab the bulk files available from PMC OA\nftp site and put them in a directory called pmcoa inside Importer. Then create a directory \ncalled workdir in Importer too, which will be used for unpacking and processing files. The \ndefault also wipes any index already existing at the usual address named \"occ\", so change \nthat in the config if you don't want to call it that, or set \"prep_index\" to false if you \ndon't want it wiped.\n\nThen do this to build a new index from scratch out of PMC OA bulk ftp files:\n\n    cd OpenCitationsCorpus\n    source ../../bin/activate\n    pip install -e .\n    cd Importer\n    python OpenCitationsImportLibrary.py\n    \n    \nA complete rebuild will take a few hours to run.\n\n\nStatus\n------\n\nDavid is working on the datastructures for the CCD server, and the\nmappings from the existing PMC/Arxiv data fields. As soon as this in\ndone we can\n\n* adapt the import scripts to the new format\n* work with relyable data in the front end\n* strat implementing the CCD.\n\n\nPipeline\n--------\n\nMark has added a pipeline folder with a first python file\n\n\nBibServer\n---------\n\nMark has added bibserver as a submodule. After cloning this repo, do \ngit submodule update --init --recursive\nto have a working repo.\n", 
  "id": 6830894
}