{
  "read_at": 1462547442, 
  "description": "An Open Source library for the analysis and visualization of dynamic network structures, so-called temporal or time-varying networks.", 
  "README.md": "TemporalNetworks\n===\n\nThis project implements an Open Source C# library as well as a set of command line tools for the analysis of dynamic network structures, so-called temporal networks. The code particularly focuses on the computation of so-called betweenness preference, which has been introduced in [1].  \n\n![Screenshot of command line tools](https://dl.dropbox.com/u/10482894/Screenshot_TempNet.png)\n\nThe command line tools and the library can be used to compare weighted aggregate networks from temporal sequences of edges, create tikz and png figures of temporal unfoldings of dynamic networks, compute betweenness preference distributions of empirical networks, generate null model realizations based on empirical data and create second-order aggregate networks as introduced in [2]. An example for a time-unfolded network with 6 nodes and 10 time steps is shown in the following figure.\n\n![Example output of time-unfolded representation of temporal network with 6 nodes and 10 time steps](https://dl.dropbox.com/u/10482894/TikzOutput_TempNet.png)\n\nThe next figure shows an example of a png visualization of interaction patterns of an actual dynamic social network: \n\n![Example output of interaction pattern visualization of dynamic social network](https://dl.dropboxusercontent.com/u/10482894/png_example.png)\n\nMain features\n---\n\nThe emphasis of the framework is on ... \n\n- ease-of-use\n- efficiency and multi-core awareness with automatic parallelization\n- clean, fully documented and easily understandable code\n- easy integrateability in own projects\n- inclusion of unit tests\n- scriptability on the command line\n\nThe project consists of the following components (which you will find as separate class libraries and projects in the code).\n\nTempNet\n---\n\nA set of command line tools that can be used to analyze, visualize and process temporal networks\n\nTemporalNetworks\n---\n\nThe basis framework for the storage, analysis and visualization of temporal networks. This is the core code of the project, to which the TempNet command line tool provides an interface\n\nTemporalNetworksDemo\n---\n\nA simple example application that shows how to use the framework in your own code.\n\nTemporalNetworksTest\n---\n\nA set of example data and unit tests to make sure that future updates do not break the correctness of the computations as defined in: \n\n\n[1] *R. Pfitzner, I. Scholtes, A. Garas, C. J. Tessone, F. Schweitzer:* **\"Betweenness Preference: Quantifying Correlations in The Topological Dynamics of Temporal Networks\"**, Physical Review Letters, Vol. 110, May 10 2013, http://prl.aps.org/abstract/PRL/v110/i19/e198701\n\n[2] *I. Scholtes, N. Wider, R. Pfitzner, A. Garas, C. J. Tessone, F. Schweitzer:* **\"Slow-Down vs. Speed-Up of Information Diffusion in Non-Markovian Temporal Networks\"**, http://arxiv.org/abs/1307.4030", 
  "id": 6919646
}