{
  "read_at": 1462551311, 
  "description": "Massively parallel self-organizing maps: accelerate training on multicore CPUs, GPUs, and clusters", 
  "README.md": "Somoclu\n=======\nSomoclu is a massively parallel implementation of self-organizing maps. It exploits multicore CPUs, it is able to rely on MPI for distributing the workload in a cluster, and it can be accelerated by CUDA. A sparse kernel is also included, which is useful for training maps on vector spaces generated in text mining processes.\n\nKey features:\n\n* Fast execution by parallelization: OpenMP, MPI, and CUDA are supported.\n* Multi-platform: Linux, OS X, and Windows are supported.\n* Planar and toroid maps.\n* Rectangular and hexagonal grids.\n* Gaussian and bubble neighborhood functions.\n* Both dense and sparse input data are supported.\n* Large maps of several hundred thousand neurons are feasible.\n* Integration with [Databionic ESOM Tools](http://databionic-esom.sourceforge.net/).\n* [Python](https://somoclu.readthedocs.io/), [R](https://cran.r-project.org/web/packages/Rsomoclu/), and [MATLAB](https://github.com/peterwittek/somoclu/tree/master/src/MATLAB) interfaces for the dense CPU and GPU kernels.\n\nFor more information, refer to the manuscript about the library [1].\n\nUsage\n===\nBasic Command Line Use\n----------------------\nSomoclu takes a plain text input file -- either dense or sparse data. Example files are included.\n\n    $ [mpirun -np NPROC] somoclu [OPTIONs] INPUT_FILE OUTPUT_PREFIX\n\nArguments:\n\n    -c FILENAME              Specify an initial codebook for the map.\n    -e NUMBER                Maximum number of epochs\n    -g TYPE                  Grid type: square or hexagonal (default: square)\n    -h, --help               This help text\n    -k NUMBER                Kernel type\n                                0: Dense CPU\n                                1: Dense GPU\n                                2: Sparse CPU\n    -m TYPE                  Map type: planar or toroid (default: planar)\n    -n FUNCTION              Neighborhood function (bubble or gaussian, default: gaussian)\n    -p NUMBER                Compact support for Gaussian neighborhood\n                             (0: false, 1: true, default: 0)\n    -t STRATEGY              Radius cooling strategy: linear or exponential (default: linear)\n    -r NUMBER                Start radius (default: half of the map in direction min(x,y))\n    -R NUMBER                End radius (default: 1)\n    -T STRATEGY              Learning rate cooling strategy: linear or exponential (default: linear)\n    -l NUMBER                Starting learning rate (default: 0.1)\n    -L NUMBER                Finishing learning rate (default: 0.01)\n    -s NUMBER                Save interim files (default: 0):\n                                0: Do not save interim files\n                                1: Save U-matrix only\n                                2: Also save codebook and best matching\n    -x, --columns NUMBER     Number of columns in map (size of SOM in direction x)\n    -y, --rows    NUMBER     Number of rows in map (size of SOM in direction y)\n\nExamples:\n\n    $ somoclu data/rgbs.txt data/rgbs\n    $ mpirun -np 4 somoclu -k 0 --rows 20 --columns 20 data/rgbs.txt data/rgbs\n\nWith random initialization, the initial codebook will be filled with random numbers ranging from 0 to 1. Either supply your own initial codebook or normalize your data to fall in this range.\n\nIf the range of the values of the features includes negative numbers, the codebook will eventually adjust. It is, however, not advised to have negative values, especially if the codebook is initialized from 0 to 1. This comes from the batch training nature of the parallel implementation. The batch update rule will change the codebook values with weighted averages of the data points, and with negative values, the updates can cancel out.\n\nThe maps generated by the GPU and the CPU kernels are likely to be different. For computational efficiency, Somoclu uses single-precision floats. This occasionally results in identical distances between a data instance and the neurons. The CPU version will pick the best matching unit with the lowest coordinate values. Such sequentiality cannot be guaranteed in the reduction kernel of the GPU variant. This is not a bug, but it is better to be aware of it.\n\nEfficient Parallel and Distributed Execution\n--------------------------------------------\nThe CPU kernels use OpenMP to load multicore processors. On a single node, this is more efficient than launching tasks with MPI to match the number of cores. The MPI tasks replicated the codebook, which is especially inefficient for large maps.\n\nFor instance, given a single node with eight cores, the following execution will use 1/8th of the memory, and will run 10-20% faster:\n\n    $ somoclu -x 200 -y 200 data/rgbs.txt data/rgbs\n\nOr, equivalently:\n\n    $ OMP_NUM_THREADS=8 somoclu -x 200 -y 200 data/rgbs.txt data/rgbs\n\nAvoid the following on a single node:\n\n    $ OMP_NUM_THREADS=1 mpirun -np 8 somoclu -x 200 -y 200 data/rgbs.txt data/rgbs\n\nThe same caveats apply for the sparse CPU kernel.\n\nVisualisation\n-------------\nThe primary purpose of generating a map is visualisation. Apart from the Python interface, Somoclu does not come with its own functions for visualisation, since there are numerous generic tools that are capable of plotting high-quality figures. The R version integrates with [kohonen](https://cran.r-project.org/package=kohonen) and the MATLAB version with [somtoolbox](www.cis.hut.fi/somtoolbox/).\n\nThe output formats U-matrix and the codebook of the command-line version are compatible with [Databionic ESOM Tools](http://databionic-esom.sourceforge.net/) for more advanced visualisation.\n\n\nInput File Formats\n==================\nOne sparse and two dense data formats are supported. All of them are plain text files. The entries can be separated by any white-space character. One row represents one data instance across all formats. Comment lines starting with a hash mark are ignored.\n\nThe sparse format follows the [libsvm](http://www.csie.ntu.edu.tw/~cjlin/libsvm/) guidelines. The first feature is zero-indexed. For instance, the vector [ 1.2 0 0 3.4] is represented as the following line in the file:\n0:1.2 3:3.4. The file is parsed twice: once to get the number of instances and features, and the second time to read the data in the individual threads.\n\nThe basic dense format includes the coordinates of the data vectors, separated by a white-space. Just like the sparse format, this file is parsed twice to get the basic dimensions right.\n\nThe .lrn file of [Databionic ESOM Tools](http://databionic-esom.sourceforge.net/) is also accepted and it is parsed only once. The format is described as follows:\n\n% n\n\n% m\n\n% s1\t\ts2\t\t\t..\t\tsm\n\n% var_name1\tvar_name2\t\t..\t\tvar_namem\n\nx11\t\tx12\t\t\t..\t\tx1m\n\nx21\t\tx22\t\t\t..\t\tx2m\n\n.\t\t.\t\t\t.\t\t.\n\n.\t\t.\t\t\t.\t\t.\n\nxn1\t\txn2\t\t\t..\t\txnm\n\nHere n is the number of rows in the file, that is, the number of data instances. Parameter m defines the number of columns in the file. The next row defines the column mask: the value 1 for a column means the column should be used in the training. Note that the first column in this format is always a unique key, so this should have the value 9 in the column mask. The row with the variable names is ignore by Somoclu. The elements of the matrix follow -- from here, the file is identical to the basic dense format, with the addition of the first column as the unique key.\n\nIf the input file is sparse, but a dense kernel is invoked, Somoclu will execute and results will be incorrect. Invoking a sparse kernel on a dense input file is likely to lead to a segmentation fault.\n\nInterfaces\n==========\n[Python](https://somoclu.readthedocs.io/), [R](https://cran.r-project.org/web/packages/Rsomoclu/), and [MATLAB](https://github.com/peterwittek/somoclu/tree/master/src/MATLAB) interfaces are available for the dense CPU  and GPU kernels. MPI and the sparse kernel are not support through the interfaces. For respective examples, see the folders in src.\n\nThe Python version is also available in [PyPI](https://pypi.python.org/pypi/somoclu). You can install it with\n\n    $ sudo pip install somoclu\n\nSome pre-built binaries in the wheel format or Windows installer are provided at [PyPI Dowloads](https://pypi.python.org/pypi/somoclu#downloads), they are tested with [Anaconda](https://www.continuum.io/downloads) distributions. If you encounter errors like `ImportError: DLL load failed: The specified module could not be found` when `import somoclu`, you may need to use [Dependency Walker](http://www.dependencywalker.com/) as shown [here](http://stackoverflow.com/a/24704384/1136027) on `_somoclu_wrap.pyd` to find out missing DLLs and place them at the write place. Usually right version (32/64bit) of `vcomp90.dll, msvcp90.dll, msvcr90.dll` should be put to `C:\\Windows\\System32` or `C:\\Windows\\SysWOW64`.\n\nThe wheel binaries for OSX are compiled with [clang-omp](http://clang-omp.github.io/), and depend on libiomp5, which you can install by:\n\n    $ brew install libiomp\n\nTo get it working with the GPU kernel, you might have to follow the instructions at [Somoclu - Python Interface](https://github.com/peterwittek/somoclu/tree/master/src/Python).\n\nThe R version is available on CRAN. You can install it with\n\n    install.packages(\"Rsomoclu\")\n\nTo get it working with the GPU kernel, download the source zip file and specify your CUDA directory the following way:\n\n    R CMD INSTALL src/Rsomoclu_version.tar.gz --configure-args=/path/to/cuda\n\nFor using the MATLAB toolbox, define the location of your MATLAB install to the configure script:\n\n    ./configure --without-mpi --with-matlab=/usr/local/MATLAB/R2014a\n\nFor the GPU kernel, specify the location of your CUDA library for the configure script. More detailed instructions are in the [MATLAB source folder](https://github.com/peterwittek/somoclu/tree/master/src/MATLAB).\n\nCompilation & Installation\n==========================\nThese are the instructions for compiling the core library and the command line interface. The only dependency is a C++ compiler chain -- GCC, ICC, and VC were tested.\n\nMulticore execution is supported through OpenMP -- the compiler must support this. Distributed systems are supported through MPI. The package was tested with OpenMPI. It should also work with other MPI flavours. CUDA support is optional.\n\nLinux or Mac OS X\n-----------------\nFrom GIT repository first run\n\n    $ ./autogen.sh\n\nThen follow the standard POSIX procedure:\n\n    $ ./configure [options]\n    $ make\n    $ make install\n\nUsing Intel compilers\n\n    export CC=/path/of/intel/compiler/icc\n    export CXX=/path/of/intel/compiler/icpc\n    export OMPI_CC=/path/of/intel/compiler/icc\n    export OMPI_CXX=/path/of/intel/compiler/icpc\n\nIn order to use icc and icpc compilers, you have to set these variables\nso the mpic++ will invoke icpc instead of the default compiler.\n\nOptions for configure\n\n    --prefix=PATH           Set directory prefix for installation\n\n\nBy default Somoclu is installed into /usr/local. If you prefer a\ndifferent location, use this option to select an installation\ndirectory.\n\n    --without-mpi           Disregard any MPI installation found.\n    --with-mpi=MPIROOT      Use MPI root directory.\n    --with-mpi-compilers=DIR or --with-mpi-compilers=yes\n                              use MPI compiler (mpicxx) found in directory DIR, or\n                              in your PATH if =yes\n    --with-mpi-libs=\"LIBS\"  MPI libraries [default \"-lmpi\"]\n    --with-mpi-incdir=DIR   MPI include directory [default MPIROOT/include]\n    --with-mpi-libdir=DIR   MPI library directory [default MPIROOT/lib]\n\nThe above flags allow the identification of the correct MPI library the user wishes to use. The flags are especially useful if MPI is installed in a non-standard location, or when multiple MPI libraries are available.\n\n    --with-cuda=/path/to/cuda           Set path for CUDA\n\nSomoclu looks for CUDA in /usr/local/cuda. If your installation is not there, then specify the path with this parameter. If you do not want CUDA enabled, set the parameter to ```--without-cuda```.\n\nWindows\n-------\nUse the `somoclu.sln` under `src/Windows/somoclu` as an example Visual Studio 2013 solution. Modify the CUDA version or VC compiler version according to your needs.\n\nThe default solution enables all of OpenMP, MPI, and CUDA. The default MPI installation path is `C:\\Program Files\\Microsoft MPI`, modify the settings if yours is in a different path. The configuration default CUDA version is 6.5.  Disable MPI by removing `HAVE_MPI` macro in the project properties (`Properties -> Configuration Properties -> C/C++ -> Preprocessor`). Disable CUDA by removing `CUDA` macro in the solution properties.\n\nThe usage is identical to the Linux version through command line (see the relevant section).\n\nAcknowledgment\n==============\nThis work was supported by the European Commission Seventh Framework Programme under Grant Agreement Number FP7-601138 PERICLES and by the AWS in Education Machine Learning Grant award.\n\nCitation\n========\n\n1. Peter Wittek, Shi Chao Gao, Ik Soo Lim, Li Zhao (2015). Somoclu: An Efficient Parallel Library for Self-Organizing Maps. [arXiv:1305.1422](http://arxiv.org/abs/1305.1422).\n", 
  "id": 7640569
}