{
  "read_at": 1462551295, 
  "description": "Research on the energetic predictions of METE", 
  "README.md": "mete-energy\n===========\n\nResearch project that evaluates the performance of the Maximum Entropy Theory of Ecology (METE) on its four major non-spatial predictions.\nThe project has been developed by Xiao Xiao, Daniel J. McGlinn, and Ethan P. White.\nOur manuscript is available on arXiv (http://arxiv.org/abs/1308.0731). \n\nCode in this repository replicates all analyses in the manuscript using a subset of datasets. \n\nData included in the repository (under folder ./data/) are redistributed with courtesy of original data owners. \nThey are a processed subset of the original datasets specifically designed for the replication of our analyses. \nThey do not have spatial/temporal components or other useful information that may be available in the original data, and will not be updated to reflect additional data collection or corrections to the data made after archiving.\nReaders interested in using the data for purposes other than replicating our analyses are advised to obtain the raw data from the original source.\n\nSetup\n------------\nRequirements: R 2.x or higher, Python 2.x, and the following Python modules: `numpy`, `scipy`, `matplotlib`, `mpl_tookits`, `mpmath`, `multiprocessing`, `pyper`, and `Cython`. \nIn addition, the following custom Python modules are also required: `METE` (https://github.com/weecology/METE), `macroecotools` (https://github.com/weecology/macroecotools), and `mete_sads` (https://github.com/weecology/white-etal-2012-ecology).\nNote that you will have to navigate to /mete_distributions under module `METE` and run `setup.py` (from the command line: `python setup.py`) for Cython to properly compile.\n\nReplicate analyses\n------------------\nAll analyses (except Monte Carlo and bootstrap) can be replicated by running the following command from the command line: \n\n`python run_analyses.py`\n\nThe Monte Carlo analysis (Appendix D) and the bootstrap (Appendix E), both of which are time-consuming, can be replicated by running the following command from the command line:\n\n`python run_analyses_bootstrap.py`\n\nBy default, figures will be saved to the home directory. \nIntermediate output files will be saved to the subdirectory /out_files/. \n", 
  "id": 7712369
}