{
  "read_at": 1462551318, 
  "description": "This is a python code that reconstructs mass map from weak and strong lensing data.", 
  "README.md": "MassMap\n=======\nThis is a python code that uses numpy,scipy and pylab. The main aim is to fit data to two-dimensional map. There is a 2D field say P (the potential) that relates the output map with the data. The output map say K, is the sum of the second derivatives of P with respect to x and y direction. The data (located at (x,y) where observations are made) is spatial in 2-dimensions.\nThere are two types of data. (i) The first type of data (weak lensing ellipticity of galaxy images) is proportional to the difference between the second derivative of P with respect to x and P with respect to y. This is a very noisy data, the signal is of the order of a few percent but the noise follows a gaussian of width 0.3 whereas the signal is ~0.1. Since the noise is random it is possible to spatially filter the data on large scales where the signal dominates. This filtering is done by smoothing this with a gaussian filter. It is important to bear in mind this filtering process makes the data spatially correlated. (ii) The second type of data is proportional to the first derivative of P. This data has very low noise. I use chi^2 minimization and combine Data (i) and data (ii) to map out K. Since Data (i) is correlated I need inverse of the covariance in the chi^2 term. This covariance matrix is singular, in order to invert it I have used ridge regression technique. Fina lly the output at K at the points (x,y) is obtained by inverting the set of linear equations that result from chi^2 minimization. Our output is a set of numbers at positions (x,y). In order to convert this to maps I bin the data using smooth_pbl.grid_field_gaussian(x,y,K,nx,ny) and plot it using pylab.matshow with appropriate units. I also save this data as a fits file and use DS9(astronomical software) to overlay it with other images. This project is best described in http://www.hep.anl.gov/sdeb/Talks/insightPBL.pdf and led to these papers arXiv:1201.3636, arXiv:0912.4260 , arXiv:0802.0004\n", 
  "id": 7826111
}