{
  "read_at": 1462547533, 
  "description": "HTML5 interface to the Open Exoplanet Catalogue", 
  "README.md": "Open Exoplanet Catalogue - Web Front End\n========================================\n\nThis repository contains a web front end for the [Open Exoplanet Catalogue](https://github.com/hannorein/open_exoplanet_catalogue). It uses python, [flask](http://flask.pocoo.org) and [jinja2](http://jinja2.readthedocs.org/en/latest/) to format the contents of the Open Exoplanet Catalogue.\n\nThe Open Exoplanet Catalogue is a database of all discovered extra-solar planets. New planets are usually added within 24 hours of their announcement. The Open Exoplanet Catalogue and this front end are licensed under an MIT license (see below), which basically says you can do everything with it. If you use either of them for a scientific publication, please include a reference to the Open Exoplanet Catalogue on [github](https://github.com/hannorein/open_exoplanet_catalogue) or to [this arXiv paper](http://arxiv.org/abs/1211.7121).  \n\n\nLicense\n-------\nCopyright (C) 2013-2015 Hanno Rein\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this database and associated scripts (the \"Database\"), to deal in the Database without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Database, and to permit persons to whom the Database is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Database.\nA reference to the Database shall be included in all scientific publications that make use of the Database.\n\nTHE DATABASE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE DATABASE OR THE USE OR OTHER DEALINGS IN THE DATABASE.\n", 
  "id": 8044557
}