{
  "read_at": 1462547572, 
  "description": "Calibration procedures for accurate ABC", 
  "README.md": "# Calibration procedures for accurate ABC\n\nApproximate Bayesian Computations (ABC) are a Monte Carlo technique to perform approximate parameter inference when the likelihood term cannot be easily evaluated. \nABC proceeds by summarising the data, simulating from the model, comparing simulated summaries to observed summaries with a distance function, and accepting the simulated summaries if they do not differ from the observed summaries by more than a user-defined tolerance parameter. These steps are repeated through many Monte Carlo iterations to obtain an approximation to the true posterior density of the model parameters. The process by which precise ABC tolerances and ABC distance functions can be obtained is often referred to as ABC calibrations. These calibrations make use of decision theoretic arguments to construct the ABC accept/reject step, so that the ABC accept/reject step enjoys certain desirable properties. \n\nThe `abc.star` R package implements ABC calibration routines for the most commonly occurring scenarios.\n\nThe corresponding paper is now on arxiv http://arxiv.org/abs/1305.4283\t\n\n## Authors:\n\n* Oliver Ratmann <oliver.ratmann@imperial.ac.uk>\n* Anton Camacho <ntncmch@gmail.com>\t\n* Caroline Colijn <c.colijn@imperial.ac.uk>\n* Sen Hu <ethansen.hu@gmail.com>\n* Trevelyan J McKinley <T.McKinley@exeter.ac.uk>\n\n## Contributors:\n\nIf you'd like to add calibration routines for different equivalence tests to this library,\nplease let us know and we are happy to give you write access to the github repository\n\n# Installation\n\nThe easiest way to install `abc.star` is to use the `devtools` package:\n\n```r\n# install.packages(\"devtools\")\nlibrary(devtools)\ninstall_github(\"olli0601/abc.star\")\n```\n\nTo work with this `R` package:\nfire up `R`, and type \n\n```r\nlibrary(help=abc.star)\n```\n\n\n# Content:\n\nABC calibration routines for particular testing scenarios. These can be combined like lego blocks to build your calibrated ABC algorithm.\n\n* Calibration routines to test if the location parameter of simulated and observed summaries is similar. These start with `mutost.*`\n* Calibration routines to test if the variance parameter of simulated and observed summaries is similar. These start with `vartest.*`\n* Calibration routines to test if the rate parameter of simulated and observed summaries is similar. These start with `ratetest.*`\n* Calibration routines for the Z-test. This is an asymptotic test that can be used for several testing problems, for example testing if autocorrelations are similar. This test starts with `ztest.*`\n\n", 
  "id": 8214145
}