{
  "read_at": 1462547583, 
  "description": "A matlab package for the estimation of the critical moment order for log-exponential-power laws", 
  "Readme.md": "# Presentation\nThis matlab package bundles a set of estimator for the critical order for moment estimation\nfor lognormal and other log-exponential power laws. These laws can be written as \nX= exp(Y), where Y follows a distribution p_Y such that\ny p_Y'(y) / p_Y(y) converges towards a finite constant rho.\nIn this situation, for rho>1, it can be shown (cf http://dx.doi.org/10.1088/1751-8113/45/11/115004 or http://arxiv.org/abs/1103.5033) that with a finite number of samples,\nthe empirical moment estimator can only estimates the theoretical moment up to critical order of moment\nq_c. This critical order of moment growths extremely slowly in function of n:\nq_c(n) = L(ln n) (ln n)^{1-1/rho}.\n\nIt can be therefore quite useful to be able to estimate rho and q_c. Such is the aim of this\nmatlab package.\n\n# Estimators\nAll the available estimators are located within the Estimators sub-directory.\nA standard use of these estimators would be:\n\n```matlab\nn=1000;\ngaussData = normrnd(0,1,n,1);\ndata= arrayfun(@exp, gaussData )\nestimator = qcEstimator(10,50);\nq_c = estimator(data) \n```\n\nThe more efficient estimators have been gathered at the top of the 'Estimators' sub-directory.\nAt the lower levels, the endAnalyzers and preAnalyzers sub-directories contain the functions used \nto construct these estimators. The proposed estimators are constructed by gluing \na 'preAnalyzers' function with one or more 'endAnalyzers' functions. Most of the endAnalysers\nfunctions are currently unused but are still available for curiosity's sake. \n\n# Tests \nThe sub-directory Tests contains the scripts and tests used to generates the data and figures of\nthe article http://dx.doi.org/10.1088/1751-8113/45/11/115004. This sub-directory implements\nan adhoc test framework which has not stood the test of time. However, the scripts are still available\nfor the sake of scientific reproducibility. The more interesting scripts are probably the diverse\nvariants of test*.m which lay in the Demos sub-directory. \n\nOne should note that the generation of correlated random variable are\nassured by an external matlab package available at http://www.hermir.org. \n\n", 
  "id": 8340137
}