{
  "read_at": 1462549140, 
  "description": "Parallel Maximum Clique Library", 
  "README.md": "Parallel Maximum Clique (PMC) Library\n=====================================\n\nIn short, a parameterized high performance library for computing maximum cliques in large sparse graphs.\n\nFinding maximum cliques, k-cliques, and temporal strong components are in general NP-hard.\nYet, these can be computed fast in most social and information networks.\nThe PMC library is designed to be fast for solving these problems.\nAlgorithms in the PMC library are easily adaptable for use with a variety of orderings, heuristic strategies, and bounds.\n\n* **Maximum clique:** \t\t Given a simple undirected graph G and a number k, output the clique of largest size.\n* **K-clique:** \t   \t\t In k-clique, the problem is to find a clique of size k if one exists.\n* **Largest temporal-scc:** Given a temporal graph G, a temporal strong component is a set of vertices where all temporal paths exist between the vertices in that set. The Largest TSCC problem is to find the largest among all the temporal strong components.\n\n\n\nFeatures\n--------\n0.  General framework for parallel maximum clique algorithms\n1.\tOptimized to be fast for large sparse graphs \n\t+ \tAlgorithms tested on networks of 1.8 billion edges\n2.\tSet of fast heuristics shown to give accurate approximations\n3.\tAlgorithms for computing Temporal Strongly Connected Components (TSCC) of large dynamic networks\n4.\tParameterized for computing k-cliques as fast as possible\n5.  Includes a variety of tight linear time bounds for the maximum clique problem\n6.  Ordering of vertices for each algorithm can be selected at runtime \n7.  Dynamically reduces the graph representation periodically as vertices are pruned or searched\n\t+   Lowers memory-requirements for massive graphs, increases speed, and has caching benefits\n\n\nSynopsis\n---------\n\n### Setup\nFirst, you'll need to compile the parallel maximum clique library.  \n\n\t\t$ cd path/to/pmc/\n\t\t$ make\n\nAfterwards, the following should work:  \n\n\t\t# compute maximum clique using the full algorithm `-a 0`\n\t\t./pmc -f data/socfb-Texas84.mtx -a 0\n\n\n*PMC* has been tested on Ubuntu linux (10.10 tested) and Mac OSX (Lion tested) with gcc-mp-4.7 and gcc-mp-4.5.4\n\nPlease let me know if you run into any issues.  \n\n  \n   \n### Input file format\n+ Matrix Market Coordinate Format (symmetric)  \nFor details see: <http://math.nist.gov/MatrixMarket/formats.html#MMformat>  \n\n\t\t%%MatrixMarket matrix coordinate pattern symmetric  \n\t\t4 4 6  \n\t\t2 1  \n\t\t3 1  \n\t\t3 2  \n\t\t4 1  \n\t\t4 2  \n\t\t4 3 \n\n\n+ Edge list (symmetric and unweighted):\n\t\tCodes for transforming the graph into the correct format are provided in the experiments directory.\n\n\nOverview\n---------\n\nThe parallel maximum clique algorithms use tight bounds that are fast to compute.\nA few of those are listed below.\n\n* K-cores\n* Degree\n* Neighborhood cores\n* Greedy coloring\n\nAll bounds are dynamically updated.  \n\nExamples of the three main maximum clique algorithms are given below.\nEach essentially builds on the other.\n\n\t# uses the four basic k-core pruning steps\n\t./pmc -f ../pmc/data/output/socfb-Stanford3.mtx -a 2\n\n\t# k-core pruning and greedy coloring\n\t./pmc -f ../pmc/data/output/socfb-Stanford3.mtx -a 1\n\t\n\t# neighborhood core pruning (and ordering for greedy coloring)\n\t./pmc -f ../pmc/data/output/socfb-Stanford3.mtx -a 0\n\n\n\n\n\n### Dynamic graph reduction\n\t\nThe reduction wait parameter `-r` below is set to be 1 second (default = 4 seconds).\n \n\t./pmc -f data/sanr200-0-9.mtx -a 0 -t 2 -r 1\n\nIn some cases, it may make sense to turn off the explicit graph reduction. \nThis is done by setting the reduction wait time '-r' to be very large.\n\n\t# Set the reduction wait parameter\n\t./pmc -f data/socfb-Stanford3.mtx -a 0 -t 2 -r 999\n\n\n\n\n\n\n### Orderings\n\nThe PMC algorithms are easily adapted to use various ordering strategies. \nTo prescribe a vertex ordering, use the -o option with one of the following:\n+ `deg`\n+ `kcore`\n+ `dual_deg`&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;orders vertices by the sum of degrees from neighbors\n+ `dual_kcore`&nbsp;&nbsp;orders vertices by the sum of core numbers from neighbors\n+ `kcore_deg`&nbsp;&nbsp;&nbsp; vertices are ordered by the weight k(v)d(v)\n+ `rand`&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; randomized ordering of vertices\n\n\n\n##### Direction of ordering\n\nVertices are searched by default in increasing order, to search vertices in decreasing order, use the `d` option:\n\n\t./pmc -f data/p-hat700-2.mtx -a 0 -d\n\n\n\n\n### Heuristic\nThe fast heuristic may also be customized to use various greedy selection strategies.\nThis is done by using `-h` with one of the following: \n\n+ `deg`\n+ `kcore`\n+ `kcore_deg`&nbsp;&nbsp;&nbsp; select vertex that maximizes k(v)d(v)\n+ `rand`&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; randomly select vertices\n\n\n#### Terminate after applying the heuristic\nApproximate the maximum clique using _ONLY_ the heuristic by not setting the exact algorithm via the `-a [num]` option.\nFor example:  \n\n\t./pmc -f data/sanr200-0-9.mtx -h deg\n\t\n#### Turning the heuristic off\n\n\t# heuristic is turned off by setting `-h 0`.\n\t./pmc -f data/tscc_enron-only.mtx -h 0 -a 0\n\n\n\n### K-clique\n\nThe parallel maximum clique algorithms have also been parameterized to find cliques of size k.\nThis routine is useful for many tasks in network analysis such as mining graphs and community detection.\n\n\t# Computes a clique of size 50 from the Stanford facebook network\n\t./pmc -f data/socfb-Stanford3.mtx -a 0 -k 50\n\n\nusing `-o rand` to find potentially different cliques of a certain size\n\n\t# Computes a clique of size 36 from sanr200-0-9\n\t./pmc -f data/sanr200-0-9.mtx -a 0 -k 36 -o rand\n\n\n\nTerms and conditions\n--------------------\nPlease feel free to use these codes. We only ask that you cite:  \n\n\tRyan A. Rossi, David F. Gleich, Assefaw H. Gebremedhin, Md. Mostofa Patwary,  \n\tA Fast Parallel Maximum Clique Algorithm for Large Sparse Graphs and Temporal  \n\tStrong Components, arXiv preprint 1302.6256, 2013.  \n\n_These codes are research prototypes and may not work for you. No promises. But do email if you run into problems._\n\n\nCopyright 2011-2013, Ryan A. Rossi. All rights reserved.\n\t\t", 
  "id": 8493131
}