{
  "README": "Grid counter g_ri3Dc and analysis tools\nCopyright (C) 2003-2011 Oliver Beckstein <orbeckst@gmail.com>\nPublished under the GNU General Public License version 2 (or higher)\n(see the file LICENCE)\n\n\n\nShort introduction\n==================\n\ng_ri3Dc counts occurrences of molecules on a 3D grid over a MD\ntrajectory. A typical application is to choose the water index group\nas the molecules to be counted. This creates (after proper\nnormalisation) a 3D density map. The map is written in a\nsystem-independent (xdr) grid file (format defined in grid3D.h) for\nonce and all.\n\nNote that for most practical purposes you should center your\ntrajectory on your molecule of interest so that it does not diffuse\nthrough the grid. This is especially important for pore proteins,\ncarbon nano tubes and the like when you want to calculate\ncylindrically averaged densities with the analysis program.\n\nThe grid file is read in by a_ri3Dc, the analysis and converter\ntool. At the moment it is mainly useful to calculate cylindrical and\nslice averages and convert the density map into gOpenMol's plt format,\nwhich can also be read by VMD (from version 1.8.2\nonwards). Alternatively, it also outputs the whole grid in ASCII\nformat.\n\nIt outputs 1D graphs (can be displayed with xmgrace\nhttp://plasma-gate.weizmann.ac.il/Grace/) and 2D data and parameter\nfiles which are suitable for xfarbe (A. Preusser,\nhttp://www.fhi-berlin.mpg.de/~grz/pub/xfarbe.html).\n\na_gridcalc can be used to average densities. The plan is to extend it\ninto a more versatile grid calculator (but then again, it may be\neasier using numeric python, dx, or any other software already written\nfor such purposes.)\n\nAs an example I added a Makefile (examples/Makefile.grid) that I use\nto create a whole bunch of graphics, including eps from the 2D plots\n(see the top of Makefile.grid for instructions). examples/slicer.pl is\na small script to generate a succession of 2D density slices of a\ngiven width.\n\n\nCiting\n======\n\nWhen you use gridcount in published work, please cite\n\n  O. Beckstein and Mark S. P. Sansom, Liquid-vapor oscillations of\n  water in hydrophobic nanopores, Proc. Natl. Acad. Sci. USA. 100\n  (2003), 7063-7068. doi:10.1073/pnas.1136844100\n\n\n\nDocumentation\n=============\n\nPlease bear in mind that this is not a finished product. It is\nprovided in the hope that it might be useful to others but it might\nrequire some work on your part to figure out how to put it to best\nuse.\n\nPlease read the output of -h to get started; the source code has also\nsome documentation (apart from the 'self-documenting code'\nitself...). The examples/Makefile.grid shows real-life usage and has\ninstructions for usage in the comments at the top.\n\nExamples of figures created with these programs can be found on\nhttp://sbcb.bioch.ox.ac.uk/oliver/research/pores/hyphobpores.html#liquidvapourosc,\nBeckstein and Sansom, PNAS 100 (2003), 7063 and Beckstein and Sansom,\nPhys Biol 1 (2004), 43, http://stacks.iop.org/1478-3975/1/42 or\nhttp://arxiv.org/abs/q-bio/0402041. \n\n\nThe latest released version of gridcount is available at \n\n   http://sbcb.bioch.ox.ac.uk/oliver/software/#gridcount\n\nThe current source code (including development version) can be found\nat \n\n   https://github.com/orbeckst/gridcount/\n\nNote that the various versions are maintained in different git\nbranches. For instance, the version for Gromacs 4.5 is to be found in\nthe `gromacs_4.5` branch, e.g.\n\n  https://github.com/orbeckst/gridcount/tree/gromacs_4.5\n\nYou would get the source code with\n\n  git clone -b gromacs_4.5 https://github.com/orbeckst/gridcount.git\n\nA version history can be found in the file CHANGELOG.\n\nQuestions from users and (more or less) helpful answers are in the\nfile FAQ.\n\n\n\nAdditional software\n===================\n\nGromacs   http://www.gromacs.org (version 4.x) \nxfarbe    http://www.fhi-berlin.mpg.de/~grz/pub/xfarbe.html\nVMD       http://www.ks.uiuc.edu/Research/vmd/\ngOpenMol  http://www.csc.fi/gopenmol/\n\n\n\nBUGs and such\n=============\n\n* Feel free to send feedback to Oliver Beckstein <orbeckst@gmail.com>\n\n* Problems during compilation/installation: see INSTALL\n\n* PLEASE read the documentation produced by running the programs with\n  the '-h' flag and in particular note the 'BUGs and known limitation'\n  section of the output.\n\n* The analysis tool is fairly limited. I use it to generate densities\n  in channels and pores (that's why it only does cylindrical\n  averages). If you need spherical spatial distribution functions look\n  into Christoph Freudenberger's g_sdf.\n\n* When the box size or shape changes over time (for instance, due to\n  pressure coupling or centering of a trajectory on a protein) then\n  the outer regions of the density are necessarily ill defined and\n  need to be discarded.\n\n* Only works with rectangular boxes.\n\n\nSee Also\n========\n\n* g_densmap, g_spatial and g_rdf in the standard Gromacs source\n  distribution\n* load density data into NumPy arrays and use the power of Python\n  (e.g. https://github.com/orbeckst/GridDataFormats )\n\n\nTODO\n====\n\n* Resampling of the grid (ie coarse graining) should be possible in\n  a_ri3Dc but it isn't (yet).\n\n* There should be a way of switching on all (hidden) plots of empty\n  cells (`holes') with one option instead of specifying all hole\n  options separately.\n\n* Probably more code cleanup.\n\n* The native density format should be something like OpenDX because\n  then it would be more interoperable and easier to manipulate with\n  existing tools.\n\n* Triclinic box support should be added.\n\n* Currently only atoms can be counted, not molecules.\n", 
  "read_at": 1462553090, 
  "description": "gridcount is an analysis tool for Gromacs that creates 3D (number) densities from molecular dynamics trajectories. Typically, this is used to look at the density of water or ions near proteins or in channels. It provides tools to generate the 3D map in portable formats, 2D cylindrical averages and 1D linear averages (\"density profiles\").", 
  "id": 889321
}