{
  "read_at": 1462543083, 
  "description": "bibtex categoriser", 
  "README.md": "bibcat\n======\n\nwhat is bibcat\n--\nIt takes a bibtex file and for each entry will call the arXiv API and try\nand find its arXiv category from the title. Supposing it is able to find\nit, it will then write that entry into a file of that name. After doing this, there\nis another script that will go on to combine these files into \"main\" bibtex files\nwhich can then be browser conveniently in, say, [JabRef](http://jabref.sourceforge.net/).\n\n\nwhy would I want to do that?\n--\nLike me, you may have far too many bibtex entries in a single file, and so you'd like\nto split them in some fashion that makes sense. I happen to think that this way makes\nsense.\n\n\nhow do I use it?\n--\nclone it from github:\n\n    git clone git://github.com/silky/bibcat.git\n\ngo into the directionry\n\n    cd bibcat\n\nrun bibcat on your bibtex file\n\n    python bibcat.py sample.bib\n\nobserve that many .bib files have been created in your current directory. Hence, you\nmay now optionally run *do_group.py*, which will trivially group the bib files by\nconcatinating them in the wat you specify\n\n    python do_group.py\n\nobserve that grouped bibtex files have now been created in your current directory.\nrejoice.\n\n\nwhat do I need?\n--\nPython. and you'll want to pip install the relevant dependencies (these will be\napparent by running it).\n\nThe exact dependencies are:\n\n  * Python 2.7+ (Works on this version at least)\n  * pip (then \"pip install feedparser\")\n  * cat (if you're running linux or mac you probably have this)\n  * A \"nicely\" formatted bibtex file. Specifically, each key/value should be on a\n    seperate line and preferably be always surrounded by curly-braces: {}; this is the\n    standard representation in JabRef.\n\n\nhow do I specify the \"main\" categories?\n--\nBy editing the *do_groups.py* file; it allows you to specify files and wildcards for\nthe output (of bibcat) that it should include in this file. Notably, it works by just\nconcatenating the files together.\n\nNote that if it can't locate a file on the arXiv it will write it to the \"nocat.bib\"\nfile.\n\n\nfaqs\n--\n\nNone yet; email [me](mailto:noonsilk+bibcat@gmail.com) if you'd like help using it though.\n", 
  "id": 9189836
}