{
  "read_at": 1462543095, 
  "description": "Synchronous Counting", 
  "README.md": "Synchronous Counting\n====================\n\nThis repository contains supporting material related to the following\npaper:\n\n  - Danny Dolev, Keijo Heljanko, Matti Jarvisalo, Janne H. Korhonen,\n    Christoph Lenzen, Joel Rybicki, Jukka Suomela, and Siert Wieringa:\n    \"Synchronous Counting and Computational Algorithm Design\",\n    Journal of Computer and System Sciences (to appear),\n    http://arxiv.org/abs/1304.5719\n\n\nSummary\n-------\n\nConsider a complete communication network on _n_ nodes, each of which\nis a state machine with s states. In **synchronous 2-counting**, the\nnodes receive a common clock pulse and they have to agree on which\npulses are \"odd\" and which are \"even\". We require that the solution is\n*self-stabilising* (reaching the correct operation from any initial\nstate) and it tolerates f *Byzantine failures* (nodes that send\narbitrary misinformation).\n\nIn this repository we have computer-generated deterministic algorithms\nthat provide solutions to the following cases (see directory `positive`):\n\n  - s = 3, n >= 4, f = 1\n  - s = 2, n >= 6, f = 1\n\nWe also have a compact, computer-generated proof that the following\ncase is not solvable by any algorithm (see directory `negative`):\n\n  - s = 2, n = 4, f = 1\n\nWe provide Python scripts that can be used to verify that the algorithms\nand the lower-bound proofs are correct (see directory `code`).\n\nFor a quick start, try:\n\n    cd code\n    ./verify-all.sh\n\nFor some illustrations of the computer-generated algorithms, see the\ndirectory `illustrations`.\n\nSynthesis tools for finding computer-generated algorithms are given in\nthe `synthesis` directory.\n\n\nAuthors\n-------\n\n  - Danny Dolev, The Hebrew University of Jerusalem\n  - Keijo Heljanko, HIIT and Aalto University\n  - Matti Jarvisalo HIIT and University of Helsinki\n  - Janne H. Korhonen, HIIT and University of Helsinki\n  - Christoph Lenzen, MPI Saarbrucken\n  - Joel Rybicki, HIIT and Aalto University\n  - Jukka Suomela, HIIT and Aalto University\n  - Siert Wieringa, HIIT and Aalto University\n\n", 
  "id": 9413189
}